{
    "id": "250425",
    "title": "New species of human relative discovered in South African cave",
    "impactStatement": "The discovery of a new species of human relative was announced today (Sept. 10) by the University of the Witwatersrand (Wits University), the National Geographic Society and the South African Department of Science and Technology/ National Research Foundation (DST/NRF). Besides shedding light on the origins and diversity of our genus, the new species, <i>Homo naledi</i>, appears to have intentionally deposited bodies of its dead in a remote cave chamber, a behaviour previously thought limited to humans.",
    "published": "2015-09-10T13:45:00Z",
    "subjects": [
        {
            "id": "genomics-evolutionary-biology",
            "name": "Genomics and Evolutionary Biology"
        }
    ],
    "content": [
        {
            "type": "paragraph",
            "text": "The finds are described in two papers published in the scientific journal <a href=\"https://doi.org/10.7554/eLife.09560\">eLife</a> and reported in the cover story of the <a href=\"http://natgeo.org/naledi\">October issue of National Geographic magazine</a> and a <a href=\"http://www.pbs.org/wgbh/nova/evolution/dawn-of-humanity.html\">NOVA/National Geographic Special</a> (#NalediFossils). An international team of scientists took part in the research."
        },
        {
            "type": "paragraph",
            "text": "Consisting of more than 1,550 numbered fossil elements, the discovery is the single largest fossil hominin find yet made on the continent of Africa. The initial discovery was made in 2013 in a cave known as Rising Star in the <a href=\"http://www.gauteng.net/cradleofhumankind\">Cradle of Humankind World Heritage Site</a>, some 50 kilometers (30 miles) northwest of Johannesburg, South Africa, by Wits University scientists and volunteer cavers. The fossils, which have yet to be dated, lay in a chamber about 90 meters (some 100 yards) from the cave entrance, accessible only through a chute so narrow that a special team of very slender individuals was needed to retrieve them."
        },
        {
            "type": "paragraph",
            "text": "So far, the team has recovered parts of at least 15 individuals of the same species, a small fraction of the fossils believed to remain in the chamber. “With almost every bone in the body represented multiple times, <i>Homo naledi</i> is already practically the best-known fossil member of our lineage,” said Lee Berger, research professor in the <a href=\"http://www.wits.ac.za/esi/17918/evolutionary_studies_institute.html\">Evolutionary Studies Institute</a> at the University of the Witwatersrand and a <a href=\"http://www.nationalgeographic.com/explorers/bios/lee-berger/\">National Geographic Explorer-in-Residence</a>, who led the two expeditions that <a href=\"http://www.wits.ac.za/newsroom/newsitems/201312/21993/news_item_21993.html\">discovered</a> and <a href=\"http://www.wits.ac.za/newsroom/newsitems/201312/22195/news_item_22195.html\">recovered</a> the fossils."
        },
        {
            "type": "paragraph",
            "text": "“This is a tremendously significant find,” said Terry Garcia, the National Geographic Society’s chief science and exploration officer. “That is why, when National Geographic received a call from Lee Berger reporting the fossils’ initial discovery, we immediately committed our support to this remarkable effort.”"
        },
        {
            "type": "section",
            "title": "A blend of primitive and human",
            "content": [
                {
                    "type": "paragraph",
                    "text": "<i>H. naledi</i> was named after the Rising Star cave — “<i>naledi</i>” means “star” in Sesotho, a local South African language. “Overall, <i>Homo naledi</i> looks like one of the most primitive members of our genus, but it also has some surprisingly human-like features, enough to warrant placing it in the genus<i> Homo</i>,” said John Hawks of the <a href=\"http://www.wisc.edu/\">University of Wisconsin-Madison</a>, U.S., a senior author on the paper describing the new species. “<i>H. naledi</i> had a tiny brain, about the size of an average orange (about 500 cubic centimeters), perched atop a very slender body.” The research shows that on average <i>H. naledi</i> stood approximately 1.5 meters (about 5 feet) tall and weighed about 45 kilograms (almost 100 pounds)."
                },
                {
                    "type": "paragraph",
                    "text": "<i>H. naledi</i>’s teeth are described as similar to those of the earliest-known members of our genus, such as <i>Homo habilis</i>, as are most features of the skull. The shoulders, however, are more similar to those of apes. “The hands suggest tool-using capabilities,” said Dr Tracy Kivell of the <a href=\"https://www.kent.ac.uk/\">University of Kent</a>, U.K., who was part of the team that studied this aspect of <i>H. naledi</i>’s anatomy. “Surprisingly, <i>H. naledi</i> has extremely curved fingers, more curved than almost any other species of early hominin, which clearly demonstrates climbing capabilities.”"
                },
                {
                    "type": "paragraph",
                    "text": "This contrasts with the feet of <i>H. naledi</i>, which are “virtually indistinguishable from those of modern humans,” said Dr William Harcourt-Smith of <a href=\"http://www.lehman.cuny.edu/\">Lehman College, City University of New York</a>, and the American Museum of Natural History, who led the study of <i>H. naledi</i>’s feet. Its feet, combined with its long legs, suggest that the species was well-suited for long-distance walking. “The combination of anatomical features in <i>H. naledi</i> distinguishes it from any previously known species,” added Berger."
                }
            ]
        },
        {
            "type": "section",
            "title": "Appearance of ritualised behavior",
            "content": [
                {
                    "type": "paragraph",
                    "text": "Perhaps most remarkably, the context of the find has led the researchers to conclude that this primitive-looking hominin may have practiced a form of behaviour previously thought to be unique to humans. The fossils — which consist of infants, children, adults and elderly individuals — were found in a room deep underground that the team named the Dinaledi Chamber, or “Chamber of Stars”. That room has “always been isolated from other chambers and never been open directly to the surface,” said Dr Paul Dirks of <a href=\"http://www.jcu.edu.au/\">James Cook University</a> in Queensland, Australia, lead author of the eLife paper on the context of the find. “What’s important for people to understand is that the remains were found practically alone in this remote chamber in the absence of any other major fossil animals.”"
                },
                {
                    "type": "paragraph",
                    "text": "So remote was the space that out of more than 1,550 fossil elements recovered, only about a dozen are not hominin, and these few pieces are isolated mouse and bird remains, meaning that the chamber attracted few accidental visitors. “Such a situation is unprecedented in the fossil hominin record,” Hawks said. The team notes that the bones bear no marks of scavengers or carnivores or any other signs that non-hominin agents or natural processes, such as moving water, carried these individuals into the chamber. “We explored every alternative scenario, including mass death, an unknown carnivore, water transport from another location, or accidental death in a death trap, among others,” said Berger. “In examining every other option, we were left with intentional body disposal by <i>Homo naledi</i> as the most plausible scenario.” This suggests the possibility of a form of ritualised behaviour previously thought to be unique to humans. (In this context, “ritualised” refers to repeated behavior.)"
                }
            ]
        },
        {
            "type": "section",
            "title": "‘Underground astronauts’",
            "content": [
                {
                    "type": "paragraph",
                    "text": "The fossil material was recovered in two expeditions conducted in November 2013 and March 2014, dubbed the <a href=\"http://voices.nationalgeographic.com/blog/rising-star-expedition/\">Rising Star Expeditions</a>. In the initial expedition, over a period of 21 days, more than 60 cavers and scientists worked together in what Marina Elliott, one of the excavating scientists, described as “some of the most difficult and dangerous conditions ever encountered in the search for human origins”. Elliott was one of six women selected as “underground astronauts” from a global pool of candidates after Berger issued a call on social media for experienced scientist/cavers who could fit through the 18-centimeter(7-inch)-wide cave opening. Social media continued to play a role in the project, as the team shared expedition progress with a large public audience, schoolchildren and scientists. “This was a first in the history of the field,” said Hawks, who worked with Berger to design the media outreach."
                },
                {
                    "type": "paragraph",
                    "text": "The fossils were analysed in a <a href=\"http://www.wits.ac.za/newsroom/newsitems/201401/22678/news_item_22678.html\">unique workshop</a> in May 2014 funded by the South African DST/NRF, Wits University and National Geographic. More than 50 experienced scientists and early-career researchers came together to study and analyze the treasure trove of fossils and to compose scientific papers."
                },
                {
                    "type": "paragraph",
                    "text": "Much remains to be discovered in the Rising Star cave. “This chamber has not given up all of its secrets,” Berger said. “There are potentially hundreds if not thousands of remains of <i>H. naledi</i> still down there.”"
                },
                {
                    "type": "paragraph",
                    "text": "“If we learned about a completely new form of hominin only because a couple of cavers were skinny enough to fit through a crack in a well-explored South African cave, we really don’t have a clue what else might be out there,” National Geographic Executive Editor for Science Jamie Shreeve writes in National Geographic magazine."
                },
                {
                    "type": "paragraph",
                    "text": "The discovery is featured as the cover story of National Geographic magazine’s October 2015 issue, <a href=\"http://natgeo.org/naledi\">available online</a> now and on print newsstands starting September 29, 2015. The NOVA/National Geographic Special, “Dawn of Humanity,” premieres September 16, 2015, at 9 p.m. ET/8 p.m. CT on PBS in the United States and is streaming <a href=\"http://www.pbs.org/wgbh/nova/evolution/dawn-of-humanity.html\">online</a> now. The programme will air in the U.K. on Channel 4 at 7 p.m. September 27 as “Secret History: Chamber of the Lost Cave Men”. You can follow the conversation using #NalediFossils."
                },
                {
                    "type": "paragraph",
                    "text": "The research was supported by Wits University, the National Geographic Society and South African DST/NRF. Ongoing exploration and conservation of the Rising Star site is supported by the <a href=\"http://www.lydahillfoundation.org/\">Lyda Hill Foundation</a>.</p>"
                }
            ]
        }
    ],
    "relatedContent": [
        {
            "status": "vor",
            "stage": "published",
            "id": "09560",
            "version": 1,
            "type": "research-article",
            "doi": "10.7554/eLife.09560",
            "title": "<i>Homo naledi</i>, a new species of the genus <i>Homo</i> from the Dinaledi Chamber, South Africa",
            "published": "2015-09-10T00:00:00Z",
            "versionDate": "2016-03-28T00:00:00Z",
            "statusDate": "2016-03-28T00:00:00Z",
            "volume": 4,
            "elocationId": "e09560",
            "authorLine": "Lee R Berger et al",
            "pdf": "https://elifesciences.org/content/4/e09560.pdf",
            "subjects": [
                {
                    "id": "genomics-evolutionary-biology",
                    "name": "Genomics and Evolutionary Biology"
                }
            ],
            "impactStatement": "A new hominin species has been unearthed in the Dinaledi Chamber of the Rising Star cave system in the largest assemblage of a single species of hominins yet discovered in Africa."
        }
    ],
    "mediaContacts": [
        {
            "name": {
                "preferred": "Shirona Patel",
                "index": "Patel, Shirona"
            },
            "emailAddresses": [
                "shirona.patel@wits.ac.za"
            ],
            "phoneNumbers": [
                "+27833621995"
            ],
            "affiliations": [
                {
                    "name": [
                        "Wits University"
                    ]
                }
            ]
        },
        {
            "name": {
                "preferred": "Schalk Mouton",
                "index": "Mouton, Schalk"
            },
            "emailAddresses": [
                "schalk.mouton@wits.ac.za"
            ],
            "phoneNumbers": [
                "+27827399637"
            ],
            "affiliations": [
                {
                    "name": [
                        "Wits University"
                    ]
                }
            ]
        },
        {
            "name": {
                "preferred": "Erna van Wyk",
                "index": "van Wyk, Erna"
            },
            "emailAddresses": [
                "erna.vanwyk@wits.ac.za"
            ],
            "phoneNumbers": [
                "+27823996574"
            ],
            "affiliations": [
                {
                    "name": [
                        "Wits University"
                    ]
                }
            ]
        },
        {
            "name": {
                "preferred": "Barbara Moffet",
                "index": "Moffet, Barbara"
            },
            "emailAddresses": [
                "bmoffet3@gmail.com"
            ],
            "phoneNumbers": [
                "+12027756160",
                "+17036184266"
            ],
            "affiliations": [
                {
                    "name": [
                        "National Geographic"
                    ]
                }
            ]
        },
        {
            "name": {
                "preferred": "Mimi Koumanelis",
                "index": "Koumanelis, Mimi"
            },
            "emailAddresses": [
                "mkoumane@ngs.org"
            ],
            "phoneNumbers": [
                "+12028575814"
            ],
            "affiliations": [
                {
                    "name": [
                        "National Geographic"
                    ]
                }
            ]
        },
        {
            "name": {
                "preferred": "Zoe Dunford",
                "index": "Dunford, Zoe"
            },
            "emailAddresses": [
                "z.dunford@elifesciences.org"
            ],
            "phoneNumbers": [
                "+447786303597"
            ],
            "affiliations": [
                {
                    "name": [
                        "eLife"
                    ]
                }
            ]
        }
    ],
    "about": [
        {
            "type": "paragraph",
            "text": "The South African <b>Department of Science and Technology</b> (<a href=\"http://www.dst.gov.za/\">DST</a>) has made many important contributions to South Africa’s development and continues to do so, living up to its mandate to use science and technology to improve the country’s economy, create employment and improve the quality of life of all citizens. The <b>National Research Foundation</b> (<a href=\"http://www.nrf.ac.za/\">NRF</a>) is as an independent government agency with the mandate to promote and support research through funding, human resource development and the provision of the necessary research facilities in order to facilitate the creation of knowledge, innovation and development in all fields of science and technology, including indigenous knowledge, and thereby contribute to the improvement of the quality of life of all South Africans."
        },
        {
            "type": "paragraph",
            "text": "The <b>University of the Witwatersrand</b> is a renowned research University and a world leader in palaeosciences research. Through its Evolutionary Studies Institute and the DST-NRF Centre of Excellence in Palaeosciences, it has a long association with the COHWHS in terms of scientific discoveries and research. Wits owns and manages important fossil sites in the Cradle and for nearly 90 years, its scientists have made some of the most extraordinary fossil finds in this area. Details: <a href=\"http://www.wits.ac.za\">www.wits.ac.za</a> or find us on <a href=\"https://www.facebook.com/witsuniversity\">Facebook</a>, <a href=\"https://twitter.com/Wits_News\">Twitter</a>, <a href=\"https://www.youtube.com/user/WitsWebmaster\">YouTube</a> and <a href=\"http://www.linkedin.com/company/university-of-the-witwatersrand?trk=company_logo\">LinkedIn</a>."
        },
        {
            "type": "paragraph",
            "text": "<b>National Geographic</b> is a global nonprofit membership organization driven by a passionate belief in the power of science, exploration and storytelling to change the world. Each year, it funds hundreds of research, conservation and education programs around the globe. Every month, it reaches more than 700 million people through its media platforms, products and events. National Geographic’s work to inspire, illuminate and teach through scientific expeditions, award-winning journalism and education initiatives is supported through donations, purchases and memberships. For more information, visit <a href=\"http://www.nationalgeographic.com\">www.nationalgeographic.com</a> and find us on <a href=\"https://www.facebook.com/natgeo\">Facebook</a>, <a href=\"https://twitter.com/natgeo\">Twitter</a>, <a href=\"http://instagram.com/natgeo\">Instagram</a>, <a href=\"https://plus.google.com/+NatGeo/posts\">Google+</a>, <a href=\"https://www.youtube.com/natgeo\">YouTube</a>, <a href=\"https://www.linkedin.com/company/national-geographic-society?trk=top_nav_home\">LinkedIn</a> and <a href=\"https://www.pinterest.com/nationalgeographic/\">Pinterest</a>."
        },
        {
            "type": "paragraph",
            "text": "<b>eLife</b> is a unique collaboration between the funders and practitioners of research to improve the way important research is selected, presented and shared. eLife publishes outstanding works across the life sciences and biomedicine — from basic biological research to applied, translational and clinical studies. eLife is supported by the Howard Hughes Medical Institute, the Max Planck Society and the Wellcome Trust. Learn more at <a href=\"http://www.elifesciences.org\">elifesciences.org</a>."
        }
    ]
}