[
    {
        "status": "vor",
        "stage": "published",
        "id": "04395",
        "version": 2,
        "type": "research-article",
        "doi": "10.7554/eLife.04395",
        "title": "Mapping the zoonotic niche of Ebola virus disease in Africa",
        "published": "2014-09-19T00:00:00Z",
        "versionDate": "2016-03-28T00:00:00Z",
        "statusDate": "2016-03-28T00:00:00Z",
        "volume": 3,
        "elocationId": "e04395",
        "authorLine": "David M Pigott, Nick Golding ... Simon I Hay",
        "pdf": "https://elifesciences.org/content/4/e04395.pdf",
        "subjects": [
            {
                "id": "epidemiology-global-health",
                "name": "Epidemiology and Global Health"
            },
            {
                "id": "microbiology-infectious-disease",
                "name": "Microbiology and Infectious Disease"
            }
        ],
        "abstract": {
            "content": [
                {
                    "text": "Ebola virus disease (EVD) is a complex zoonosis that is highly virulent in humans. The largest recorded outbreak of EVD is ongoing in West Africa, outside of its previously reported and predicted niche. We assembled location data on all recorded zoonotic transmission to humans and Ebola virus infection in bats and primates (1976–2014). Using species distribution models, these occurrence data were paired with environmental covariates to predict a zoonotic transmission niche covering 22 countries across Central and West Africa. Vegetation, elevation, temperature, evapotranspiration, and suspected reservoir bat distributions define this relationship. At-risk areas are inhabited by 22 million people; however, the rarity of human outbreaks emphasises the very low probability of transmission to humans. Increasing population sizes and international connectivity by air since the first detection of EVD in 1976 suggest that the dynamics of human-to-human secondary transmission in contemporary outbreaks will be very different to those of the past.",
                    "type": "paragraph"
                }
            ],
            "doi": "10.7554/eLife.04395.001"
        },
        "impactStatement": "Understanding where future Ebola virus outbreaks may start and the changing nature of the populations living in these places is of critical importance in helping to prepare for future outbreaks."
    },
    {
        "id": "80494",
        "doi": "10.1101/2022.06.24.497502",
        "pdf": "https://www.biorxiv.org/content/10.1101/2022.06.24.497502v1.full.pdf",
        "status": "reviewed",
        "authorLine": "Tianze Xu, Jing Cai ... Kuanyu Li",
        "title": "Aging-related iron deposit prevents the benefits of HRT from late postmenopausal atherosclerosis",
        "stage": "published",
        "type": "reviewed-preprint",
        "published": "2022-10-20T03:00:00Z",
        "reviewedDate": "2022-10-20T03:00:00Z",
        "versionDate": "2022-10-20T03:00:00Z",
        "statusDate": "2022-10-20T03:00:00Z",
        "subjects": [
            {
                "id": "cell-biology",
                "name": "Cell Biology"
            }
        ]
    }
]
