{
  "id": "104580",
  "doi": "10.1101/2024.10.17.618760",
  "version": 1,
  "status": "reviewed",
  "authorLine": "Sung Hoon Cho, Marissa A Jones ... Mark R Boothby",
  "title": "B cell expression of the enzyme PexRAP, an intermediary in ether lipid biosynthesis, promotes antibody responses and germinal center size",
  "published": "2025-01-15T14:00:00Z",
  "reviewedDate": "2025-01-15T14:00:00Z",
  "versionDate": "2025-01-15T14:00:00Z",
  "statusDate": "2025-01-15T14:00:00Z",
  "stage": "published",
  "subjects": [
    {
      "id": "immunology-inflammation",
      "name": "Immunology and Inflammation"
    }
  ],
  "elifeAssessment": {
    "title": "eLife Assessment",
    "content": [
      {
        "type": "paragraph",
        "text": "This study provides useful insights into the ways in which germinal center B cell metabolism, particularly lipid metabolism, affects cellular responses. The authors use sophisticated mouse models to demonstrate that ether lipids are relevant for B cell homeostasis and efficient humoral responses. Although the data were collected from in vitro and in vivo experiments and analyzed using solid and validated methodology, more careful experiments and extensive revision of the manuscript will be required to strengthen the authors' conclusions."
      }
    ],
    "id": "sa3",
    "doi": "10.7554/eLife.104580.1.sa3",
    "significance": [
      "useful"
    ],
    "strength": [
      "solid"
    ]
  },
  "indexContent": "Sung Hoon Cho, Marissa A Jones, Kaylor Meyer, David M Anderson, Sergei Chetyrkin, M Wade Calcutt, Richard M Caprioli, Clay F Semenkovich, Mark R Boothby <section id=\"introduction\"><h1 id=\"s1\" class=\"heading-1\">Introduction</h1><p>The qualities and concentrations of antigen (Ag)-specific antibodies (Ab) are key elements of immunity and the pathophysiology of diverse conditions involving inflammation (<a href=\"#c1\">1</a>–<a href=\"#c3\">3</a>). Ab are secreted by cells in the B lymphocyte lineage, but the exact sources are diverse (<a href=\"#c4\">4</a>–<a href=\"#c7\">7</a>). Many derive from a subset termed B1 B cells, which are thought to having characteristics of innate responses (<a href=\"#c4\">4</a>, <a href=\"#c5\">5</a>), but progeny of follicular and marginal zone B cells (FoB and MZB, respectively) can differentiate into Ab-secreting plasma cells (PC) after activation and proliferation (<a href=\"#c6\">6</a>–<a href=\"#c8\">8</a>). In addition to Ab concentrations and affinity for Ag, the efficacy of pathogen clearance can depend on the isotype to which B lymphocytes may transfer the Ag-combining variable region from an IgM heavy chain constant region to a new immunoglobulin (Ig) heavy chain (<a href=\"#c9\">9</a>–<a href=\"#c12\">12</a>). Importantly, the affinities of serum Ab for target Ag can increase over time after an immune exposure, especially after recurrent encounter(s) (<a href=\"#c8\">8</a>, <a href=\"#c9\">9</a>, <a href=\"#c13\">13</a>, <a href=\"#c14\">14</a>).</p><p>Many sources and forms of Ab can be protective, though in several autoimmune diseases these molecules and the somatic mutations that diversify an initial BCR repertoire drive pathology (<a href=\"#c15\">15</a>, <a href=\"#c16\">16</a>). A micro-anatomic structure termed the secondary follicle or germinal center (GC) provides one mechanism to increase spectrum of Ab affinities over time and repeated Ag exposure (<a href=\"#c17\">17</a>–<a href=\"#c19\">19</a>). Although diversification can, like PC production, occur independent from GC, results with different forms of vaccination support the practical importance of T cell help (<a href=\"#c20\">20</a>) and of this micro-anatomic process (<a href=\"#c21\">21</a>). Current evidence holds that most Ig class-switching is executed before GC entry of proliferating B cells (<a href=\"#c22\">22</a>). GC reactions are initiated after B cells in a primary lymphoid follicle encounter Ag, migrate to interact with activated helper T cells after extensive proliferation (<a href=\"#c23\">23</a>). GC formation, size, and function depend on factors that include both the efficiency of population growth for B cells in a phase before they enter and take on characteristics of GC B cells, and on homeostatic and differentiative processes while in the secondary follicle [reviewed in (<a href=\"#c24\">24</a>)]. Proliferation and selection end in development as Ab-secreting plasma cells or memory B cells [reviewed in (<a href=\"#c14\">14</a>, <a href=\"#c18\">18</a>, <a href=\"#c19\">19</a>)]. In line with a selection process, substantial rates of B cell death have been measured in GC (<a href=\"#c25\">25</a>), so that determinants of survival efficiency affect their outputs. As such, the qualities and quantities of Ab elicited by immunization (or vaccination) depend on B cell proliferation and survival both prior to GC entry as well as during GC reactions.</p><p>Accumulating evidence indicates that metabolic reprogramming and intermediary metabolism play pivotal roles in survival, proliferation, differentiation and function in the pre-immune populations that provide immune protection (<a href=\"#c26\">26</a>, <a href=\"#c27\">27</a>), including B cells (<a href=\"#c28\">28</a>, <a href=\"#c29\">29</a>). Among core metabolic processes, several converge on oxidative metabolism fed by glycolytic generation of pyruvate, anaplerotic use of amino acids such as glutamine, and fatty acid oxidation [reviewed in (<a href=\"#c29\">29</a>, <a href=\"#c30\">30</a>)]. Compared to resting populations such as naive B cells, rates of such metabolism in B cells appear to be increased after activation, including in GC B cells [31-36; reviewed in (<a href=\"#c29\">29</a>)] although in one case at a rate that may be less heightened in this specialized subset than after T-independent B cell activation (<a href=\"#c33\">33</a>). Such increases support the generation of substrates for anabolic processes in the dividing cell population and perhaps the energy demands thereof.</p><p>Mitochondria have been the focus of investigations exploring molecular mechanisms for oxidative metabolism to generate energy and substrates in lymphocytes during immune responses [reviewed in (<a href=\"#c37\">37</a>, <a href=\"#c38\">38</a>)]. Oxidative phosphorylation in and dynamics of this organelle appear to be important in determining rates of somatic hypermutation that characterize GC B cell biology (<a href=\"#c33\">33</a>–<a href=\"#c35\">35</a>), albeit by a molecular mechanism that has not yet been identified. Use of the Krebs TCA cycle to feed an electron transport chain (ETC) and efficient conversion of ADP to ATP as a high-energy phosphate donor is among specialized functions of this highly dynamic subcellular organelle. Along with other sources, mitochondria generate reactive oxygen species (ROS) via the ETC at a rate determined by structural and biochemical features (<a href=\"#c39\">39</a>, <a href=\"#c40\">40</a>). Rates of ROS production, release, and resolution require regulation at multiple levels because these labile species and their reactions with cellular molecules are important for both signaling and cell proliferation but undermine cell function or survival when excessive.</p><p>B cells in most GC exhibit inadequacy of oxygen delivery relative to demands (<a href=\"#c31\">31</a>, <a href=\"#c41\">41</a>–<a href=\"#c43\">43</a>). Of note, genome-wide screening for genes that help cells adapt to hypoxia revealed a requirement for peroxisomes and an ER enzyme involved in synthesizing plasmalogen ether lipids (EL) (<a href=\"#c44\">44</a>). Using an unbiased lipidomic analysis that combined imaging mass spectrometry (IMS) and techniques for identifying GC in sections of spleen from immunized mice, we had found that after immunization, local concentrations of a subset of EL were heightened in GC relative to other portions of the spleen (<a href=\"#c45\">45</a>). Ether phospholipids (EPL) have a fatty acid linked to the glycerol backbone with an alkyl or a vinyl ether bond at the sn-1 position (<a href=\"#c46\">46</a>, <a href=\"#c47\">47</a>). Synthesis of ether phospholipids depends on the generation of precursors in peroxisomes and final processing in the ER (<a href=\"#c48\">48</a>, <a href=\"#c49\">49</a>). However, EL biosynthesis is prominent in the liver, and in theory these species or their precursors might distribute to tissues from a primary site of biosynthesis or from the diet (<a href=\"#c49\">49</a>–<a href=\"#c53\">53</a>). Thus, the finding that secondary follicles had greater densities of some - but not all - ether phospholipids left several key questions unanswered – (<a href=\"#c1\">1</a>) Does the capacity to synthesize and increase ether lipids in B cell follicles – primary or secondary (i.e., GC) - affect antibody responses? (<a href=\"#c2\">2</a>) Are any of the EL dependent on B lineage-intrinsic metabolism to generate precursors or final products? Moreover, there is debate whether EL or their plasmalogen subset promote cell death or resistance, and whether inactivation of biosynthesis causes defects in establishment or maintenance of hematopoietic cells (<a href=\"#c46\">46</a>, <a href=\"#c53\">53</a>–<a href=\"#c55\">55</a>).</p><p>Peroxisomal Reductase Activating PPARγ (PexRAP, encoded by the <em>Dhrs7b</em> gene) catalyzes the reduction of alkyl-dihydroxyacetonephosphate (DHAP) to 1-alkyl-G3P (<a href=\"#c46\">46</a>, <a href=\"#c48\">48</a>, <a href=\"#c56\">56</a>), which then is transferred into endoplasmic reticulum (ER) and further metabolized to generate EL. Recent work notes that this enzyme may substantially function in the ER in addition to the peroxisome (<a href=\"#c56\">56</a>). Widespread inactivation of <em>Dhrs7b</em> in mature mice decreased hepatic production of ether lipid species and reduced the population of erythrocytes and neutrophils (<a href=\"#c46\">46</a>). Although questioned based on inborn errors of metabolism affecting other aspects of ether lipid biosynthesis (<a href=\"#c54\">54</a>), this body of work indicated that PexRAP can be essential in some aspects of ether lipid metabolism and may function in hematopoietic cells. Diverse functions of ether lipids in general, and the plasmalogen subset in particular, have been proposed or supported by prior work [reviewed in (<a href=\"#c57\">57</a>–<a href=\"#c61\">61</a>)]. The ether linkage may provide a sink for oxygen radicals - thereby acting directly to resolve the reactivity and contribute to ROS homeostasis, although there is debate as to the physiological impact of this chemical property (<a href=\"#c62\">62</a>). Whether or not this lipid subset influences adaptive immunity or conventional lymphocyte lineages, however, is unclear.</p><p>Herein, we tested the hypotheses that (i) the ether lipid profiles in activated B cells depend on their expression of the biosynthetic enzyme PexRAP [alternatively referred to as acyl/alkyl-DHAP reductase (ADHAPR) (<a href=\"#c56\">56</a>)], and (ii) this enzyme promotes B cell physiology. To do so, we combined conventional lipidomics, Imaging Mass Spectrometry (IMS), and immunization experiments with genetic models in which loss-of-function for <em>Dhrs7b</em> is induced in adult mice. We provide evidence that PexRAP impacts B cell proliferation via enhanced survival associated with controlling levels of ROS and membrane peroxidation. The results also indicate that beyond an impact on B cell homeostasis, GC are reduced in its absence, and the magnitude and affinity maturation of a serological response depend on B cell expression of PexRAP. Taken together, these finding support a function of B cell-intrinsic biosynthesis of ether lipids in B lymphocyte homeostasis, the production of Ab, and in promoting GC reactions.</p><h1 id=\"s2\" class=\"heading-1\">Results</h1><h2 id=\"s2a\" class=\"heading-2\">PexRAP promotes homeostatic maintenance and proliferation of B cells</h2><p>By use of IMS, we had reported that at least a dozen ether phospholipids - including plasmalogens - were enriched in splenic germinal centers of immunized mice when compared to the rest of the tissue (<a href=\"#c45\">45</a>).</p><p>While previous work provided evidence that these lipid molecules were important for the homeostasis of short-lived neutrophils (<a href=\"#c46\">46</a>), this effect was questioned based on inborn errors of metabolism (<a href=\"#c54\">54</a>). Moreover, the impact of these molecules on adaptive immune cells or functions is not known. Accordingly, we sought to test for effects of an intervention that interferes with a key biosynthetic pathway used for endogenous synthesis of these molecules. To do so, we started with analyses using induced loss-of-function for <em>Dhrs7b<sup>f/f</sup></em> and the widely expressed <em>Rosa26-CreER<sup>T2</sup></em> transgene (<a href=\"#c63\">63</a>, <a href=\"#c64\">64</a>) used in (<a href=\"#c46\">46</a>), which reduced hepatic generation of a subset of ether lipids and acts in all hematopoietic cells as well.</p><p>We modeled initial experiments on the published work with imaging mass spectrometry (<a href=\"#c45\">45</a>). Mice were treated with tamoxifen using conditions less intense than a regimen shown to have no effect on pre-immune splenic populations or B lineage (<a href=\"#c65\">65</a>, <a href=\"#c66\">66</a>), immunized with SRBC [akin to the analyses in (<a href=\"#c31\">31</a>, <a href=\"#c36\">36</a>, <a href=\"#c41\">41</a>, <a href=\"#c45\">45</a>)], and analyzed 7 d after immunization (<a href=\"#fig1\">Fig. 1A</a>). Functional inactivation of <em>Dhrs7b</em> in T and B lymphocytes was confirmed by Western blot analysis using anti-PexRAP Ab (<a href=\"#fig1\">Fig. 1B</a>). The frequencies and numbers of CD19<sup>+</sup> B220<sup>+</sup> B cells in <em>Dhrs7b<sup>f/f</sup></em>; <em>Rosa26-CreER<sup>T2</sup></em> - only a small minority of which would have been activated by the immunization - were approximately 0.6 the values for controls (<em>Dhrs7b</em><sup>+/+</sup> <em>Rosa26-CreER<sup>T2</sup></em>, i.e., wild-type locus) (<a href=\"#fig1\">Fig. 1C, D</a>). In contrast to B cell populations, TCRβ<sup>+</sup> CD4<sup>+</sup> T cells and TCRβ<sup>+</sup> CD4<sup>-</sup> CD8 T cells were intact in tamoxifen-treated and SRBC-immunized <em>Dhrs7b<sup>f/f</sup></em>; <em>Rosa26-CreER<sup>T2</sup></em> mice (Supplemental Fig. 1A-C). These results suggest that <em>Dhrs7b</em> is non-redundantly required for fully functional B cell maintenance but indicate that the enzyme is dispensable for the main populations of conventional T cells. In light of the earlier finding that a subset of ether lipids was more prevalent in secondary follicles, we analyzed GC in these samples. Microscopy and flow cytometry analyses after immunofluorescent staining found that less GC B cells were present after immunization of <em>Dhrs7b<sup>f/f</sup></em>; <em>Rosa26-CreER<sup>T2</sup></em> mice, i.e., less IgD<sup>-</sup> CD95<sup>+</sup> GL7<sup>+</sup> (GC-phenotype) B cells (<a href=\"#fig1\">Fig. 1E-I</a>; Supplemental Fig. 1D). Quantitation of the immune fluorescence micrography with spleens from immunized mice revealed that the numbers of GC per spleen were halved in <em>Dhrs7b</em><sup>Δ/Δ</sup> mice compared with controls (<a href=\"#fig1\">Fig. 1I</a>; Supplemental Fig. 1E). The sizes of those GC that did form were substantially reduced as well (<a href=\"#fig1\">Fig. 1I</a>; Supplemental Fig. 1F). The lower number of B cells found in immunized mice - while a less profound effect than the reduction in GC - tempers the result, and it was possible that the function of helper CD4 T cells was impaired even their though numbers were not affected. While not addressing whether or not B cells are part of the requirement for PexRAP in promoting GC, these results indicate that <em>Dhrs7b</em> is necessary for a normal-sized geminal center response.</p><div class=\"figure-container\"><figure class=\"figure\" id=\"fig1\"><label class=\"figure__label\">Figure 1.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/104580%2Fv1%2Fcontent%2F618760v3_fig1.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/104580%2Fv1%2Fcontent%2F618760v3_fig1.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">PexRAP promotes GC response.</h4><p>(A) Schematic of immunization with SRBC after inactivation of <em>Dhrs7b</em> in adult mice. Mice (<em>Rosa26</em>-CreER<sup>T2</sup>; <em>Dhrs7b<sup>+/+</sup>, or Rosa26</em>-CreER<sup>T2</sup>; <em>Dhrs7b<sup>ff</sup></em>) were treated with tamoxifen, immunized with SRBC, and harvested 1 wk after immunization, as described in <em>Materials and Methods</em>. (B) Deletion efficiency of <em>Dhrs7b</em> conditional alleles. B and T lymphocytes were isolated from spleens of <em>Rosa26-</em>CreER<sup>T2</sup> or <em>Dhrs7b<sup>f/f</sup>;Rosa26-</em>CreER<sup>T2</sup> mice after in vivo tamoxifen injections followed by immunization with SRBC. WT and <em>Dhrs7b<sup>Δ/Δ</sup></em>were analyzed by immunoblotting with antibodies directed against PexRAP (protein product of <em>Dhrs7b</em>) and actin (internal loading control). (C, D) PexRAP acutely regulates B cell numbers. Representative flow plots of viable splenic B cells (C) and aggregate data for three biologically independent replicate experiments (D) (n = 8 WT and 7 cKO). For data on T cells, see supplemental data Fig. S1A-C. (E, F) Effect of PexRAP on GC B cell response. Flow plots of GL7<sup>+</sup> CD95<sup>+</sup> GC B cells among viable B cells (E), and aggregated frequencies and numbers of GC B cells, as indicated, in the three replicate experiments (F). (G, H) PexRAP impact on GC response. After tamoxifen injections, <em>Dhrs7b</em> deficient mice [<em>Rosa26</em>-CreER<sup>T2</sup>; <em>Dhrs7b/<sup>ff</sup></em> (<a href=\"#c46\">46</a>)] and WT controls (<em>Rosa26</em>-CreER<sup>T2</sup>) were immunized with SRBC and analyzed 7 d later, as in <a href=\"#fig1\">Fig. 1A-F</a>. Data on gating strategy, GC counts per unit area and LZ area are in Supplemental data <a href=\"#fig1\">Fig. 1D-F</a>. (G, H) Shown are representative images from immunofluorescence staining of spleens with the indicated Ab in two independent experiments (5 WT vs 4 <em>Dhrs7b</em> cKO), showing a low-power overview with many follicles (G) and a representative higher-magnification image to better delineate primary and secondary follicles (H). (I) Quantitation of number (left panel) and size (right panel) of GC in spleen sections, with GL7-positive, IgD-negative areas that include both CD35+ (LZ) and CD35- (DZ) areas. Mann-Whitney U test was used to calculate p values.</p></figcaption></figure></div><p>To determine if there are B lineage-specific functions of PexRAP, we used a conditionally active Cre transgene that is expressed specifically in mature B cells (<a href=\"#c67\">67</a>). <em>Dhrs7b</em> f/f, <em>huCD20-CreER<sup>T2</sup></em> mice and <em>huCD20-CreER<sup>T2</sup></em> were treated with tamoxifen to induce Cre-mediated recombination of the floxed alleles after initial establishment of normal B cell populations (<a href=\"#fig2\">Fig. 2A</a>). Western blot analyses showed an almost complete absence of PexRAP protein from B cells purified from tamoxifen-treated <em>Dhrs7b<sup>f/f</sup></em>; <em>huCD20-CreER<sup>T2</sup></em>(hereinafter, <em>Dhrs7b</em><sup>Δ/Δ<em>-</em>B</sup>) mice compared to similarly treated <em>huCD20-</em>CreER<sup>T2</sup> controls (<a href=\"#fig2\">Fig. 2B</a>). The enzyme encoded by this gene catalyzes the synthesis of a lipid precursor to many - but not all - plasmalogens and other ether phospholipids (<a href=\"#c46\">46</a>–<a href=\"#c48\">48</a>), and <em>Dhrs7b</em> deficiency impacted neutrophil survival (<a href=\"#c46\">46</a>). When we tested if <em>Dhrs7b</em> inactivation affected the steady-state B cell population, the frequencies and total numbers of CD19<sup>+</sup> B220<sup>+</sup> B cells in viable lymphocyte gates were about 20% lower in tamoxifen-treated <em>Dhrs7b</em><sup>Δ/Δ<em>-</em>B</sup> mice compared to tamoxifen-injected, <em>huCD20</em>-CreER<sup>T2</sup>, <em>Dhrs7b</em><sup>+/+</sup> controls (<a href=\"#fig2\">Fig. 2C</a>). With loss-of-function after production of mature B cells, i.e., inactivation of <em>Dhrs7b</em> at ages over 6 wk, we observed balanced decreases in the numbers of multiple subsets within the B lineage without evidence of selectivity among main sub-classes of B cell (Supplemental Fig 1G-I). Thus, the frequencies of MZB and FOB amidst the smaller population of splenic B cells in tamoxifen-treated <em>Dhrs7b<sup>f/f</sup></em>; <em>huCD20-CreER<sup>T2</sup></em> mice were similar (Supplemental Fig 1H), and frequencies of B1 B cells in the peritoneal cavity also were unaffected (Supplemental Fig 1I). Prior work documents normal frequencies and numbers of developing and mature B cells under harsher conditions of tamoxifen-induced deletion with CreER<sup>T2</sup> (<a href=\"#c65\">65</a>). De novo B cell production rates are too low to yield the ∼20% decrease observed one week after gene disruption, and few splenic B cells are in cell cycle. Accordingly, we infer that after maturation of a B cell, <em>Dhrs7b</em> promotes its survival, albeit to a modest degree.</p><div class=\"figure-container\"><figure class=\"figure\" id=\"fig2\"><label class=\"figure__label\">Figure 2.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/104580%2Fv1%2Fcontent%2F618760v3_fig2.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/104580%2Fv1%2Fcontent%2F618760v3_fig2.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">PexRAP promotes proliferation of B cells.</h4><p>(A) Schematic of <em>Dhrs7b</em> inactivation in mature mice via tamoxifen treatment and a B cell type-specific conditional allele. Mice (<em>huCD20</em>-CreER<sup>T2</sup>; <em>Dhrs7b<sup>+/+</sup>, or huCD20</em>-CreER<sup>T2</sup>; <em>Dhrs7b<sup>ff</sup></em>) were injected with tamoxifen (d1, 3, 5) and harvested at day 10. (B) Deletion efficiency of conditional <em>Dhrs7b</em> alleles. After in vivo tamoxifen injections, B cells were isolated from spleens of <em>hCD20-</em>CreER<sup>T2</sup> or <em>Dhrs7b<sup>f/f</sup>; hCD20-</em>CreER<sup>T2</sup> mice, as indicated, and analyzed by immunoblotting as in <a href=\"#fig1\">Fig. 1B</a>. (C) PexRAP and the maintenance of B cells. Shown are the frequencies and the numbers of CD19<sup>+</sup> B220<sup>+</sup> B cells among viable lymphocytes in spleen (left and right panels, respectively). Data are pooled from four independent replicate experiments (n = 12 WT and 12 cKO). Shown in feather plots are the means, with whiskers that extend to the minimum and maximum values and boxes that outline upper and lower quartile values with the midline identifying the median.(D-F) PexRAP regulates B cell proliferation in vivo. CTV-labeled B cells were adoptively transferred into µMT recipient mice and analyzed 4 days thereafter. Shown are the frequencies of B220<sup>+</sup> CD19<sup>+</sup> events among splenocytes in the viable cell gate (D), along with representative flow plots of CTV partitioning and surface IgD in B cell gates (E) and aggregated frequencies of divided B cells from five independent replicate experiments (F) (n =10 WT and 11 cKO). Additional data on the IgD<sup>neg</sup> population are in supplemental <a href=\"#fig1\">Fig.1J</a>. (G-I) PexRAP promotes B cell proliferation in vitro. After in vivo tamoxifen injections, bead-purified B cells from spleens of CreER<sup>T2</sup> mice (WT and <em>Dhrs7b</em><sup>Δ/Δ</sup> <em>, i.e., cKO</em>) were stained with Cell Trace Violet (CTV), activated and cultured 4 days in anti-CD40, BAFF, IL-4, IL-5 and 4-hydroxytamoxifen in three biologically independent experiments totaling 6 WT and 7 cKO mice). (G) Representative flow-cytometric analysis of CTV partitioning. (H) Quantified frequencies of divided &gt;3 times. (I) Numbers of B cells recovered at the end of the cultures.</p></figcaption></figure></div><p>B cell population growth can be impacted by increased cell death. To test if PexRAP affects proliferation in vivo, <em>Dhrs7b</em><sup>Δ/Δ</sup> B cells were stained with CellTrace Violet (CTV) and adoptively transferred into B cell deficient µMT recipient mice. Strikingly fewer PexRAP-depleted B cells were recovered (<a href=\"#fig2\">Fig. 2D</a>), and the frequencies of <em>Dhrs7b</em><sup>Δ/Δ</sup> B cells that were IgD<sup>-</sup> (i.e., had been activated) were half those of controls (<a href=\"#fig2\">Fig. 2E</a>; supplemental Fig. S1J). As compared to control B cells, CTV partitioning analyses suggested that division rates in vivo were modestly lower for the <em>Dhrs7b</em><sup>Δ/Δ</sup> B cells (<a href=\"#fig2\">Fig. 2F, G</a>). Mitogen-stimulated <em>Dhrs7b</em><sup>Δ/Δ</sup> B cells that proliferated in culture exhibited substantially less robust division: frequencies of viable cells that had undergone &gt;3 divisions were halved in <em>Dhrs7b</em><sup>Δ/Δ</sup> B cells) and yielded ∼1/3 as large a progeny population (<a href=\"#fig2\">Fig. 2G, H</a>). Collectively, these data indicate that the <em>Dhrs7b</em> gene product supports homeostatic maintenance of a quiescent (pre-immune) B cell population <em>in vivo</em> and effective proliferation of B cells.</p><h2 id=\"s2b\" class=\"heading-2\">B cell expression of PexRAP is required for achieving normally distributed concentrations of ether phospholipids</h2><p>As noted, lipidomic analyses that used 2-dimensional image mass-spectrometry (2D-IMS) discovered that local concentrations of a subset of ether lipids are enriched in GC compared with the area outside of GC after immunization (<a href=\"#c45\">45</a>). To measure the extent to which PexRAP expression within mature B cells can affect their lipid content and composition, including their ether- and plasmalogen phospholipids, LC-MS-MS analyses were performed with B cells directly isolated from spleens as well as those cultured after mitogenic activation. These analyses showed substantial reductions in many ether phospholipids - as well as lysophosphatidylethanolamines (LPE) generated by phospholipase cleavage of the R2 fatty acid sidechain of an ether phospholipid - in PexRAP-deficient B cells (<a href=\"#fig3\">Fig. 3A, B</a>; Supplemental Fig. 2A, B). While beyond the scope of this work, this evidence suggests that generation of potential signaling molecules via phospholipase(s) such as PLA2 may be reduced. Of note, whereas differences were modest or absent in the naive population, the greatest impact of PexRAP on quantitative amounts of phospholipids was found in the activated B cells, for which tamoxifen treatment and CreERT2 made minimal differences (Supplemental Fig. 2C, D). Several species, skewed towards those with the most detected ions, were at less than 1/5th the level of non-deleted control B cells (<a href=\"#fig3\">Fig. 3C, D</a>). There is no in vitro surrogate that faithfully represents GC or the GC B cell, but collectively these data provide strong evidence that the capacity to rapidly produce increased levels of many ether lipid molecules after lymphocyte activation depends on a functional <em>Dhrs7b</em> gene in B cells. Although additional uptake or biosynthesis pathways may add to the overall pool, as previously noted (<a href=\"#c46\">46</a>, <a href=\"#c47\">47</a>) - and especially in resting B cells that are out of cycle - the data indicate that <em>Dhrs7b</em> in B cells enhances cell-autonomous biosynthesis. The straightforward inference is that PexRAP catalyzes the generation of ether lipid precursors in amounts crucial for regulating the overall ether phospholipid pools, especially after B cell activation.</p><div class=\"figure-container\"><figure class=\"figure\" id=\"fig3\"><label class=\"figure__label\">Figure 3.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/104580%2Fv1%2Fcontent%2F618760v3_fig3.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/104580%2Fv1%2Fcontent%2F618760v3_fig3.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">B cell expression of PexRAP is essential for normal concentrations of most ether phospholipids.</h4><p>Splenic B cells (CreER<sup>T2+</sup> or CreER<sup>T2+</sup>, <em>Dhrs7b</em> Δ/Δ) from tamoxifen-injected mice were analyzed by LC-MS-MS either directly ex vivo (“Naive”) or after activation and culture (48 h) (“Activated”) as in <a href=\"#fig2\">Fig. 2</a>. Shown are z-scored heat maps for the relative abundance of subsets of ether and plasmalogen phospholipids and lysophospholipids identified by exact mass and secondary fragmentation in (A) positive and/or (B) negative ion modes. More species are displayed in Supplemental Fig. 2. (C) Quantitated peak areas for activation-induced increases (’fold-induction’ ratios of activated/resting, plotted on log10 scale) for the indicated ether, plasmalogen, and diacyl (non-ether) phospholipids in the PexRAP-sufficient and -depleted B cells. * denotes species for which P&lt;0.05 for the effect of <em>Dhrs7b</em> inactivation. (D) Shown are the raw values of mean peak areas for the indicated species in the freshly purified and the activated B cells of the indicated genotypes, as indicated. (Three independent samples from individual mice of each genotype were analyzed.) * p&lt;0.05, ** p&lt;0.01 by unpaired Student’s. t-test. Additional data including controls comparing B cells of unmanipulated B6 mice to those expressing CreER<sup>T2</sup> and injected with tamoxifen are in Supplemental Fig. 2.</p></figcaption></figure></div><p>Our earlier work (<a href=\"#c45\">45</a>) reported only ion mode features in negative mode and did not analyze the primary follicle (the vast majority of which are resting B cells) relative to the extrafollicular white pulp, red pulp, and GC. To investigate these issues and ultimately the requirement for specific expression of PexRAP, we started with AID-GFP mice to enhance spatial localization. These measurements confirmed that a substantial number of both positive and negatively charged ions whose exact masses identified them as plasmalogens were substantially concentrated in GC as compared to the rest of the B cell follicle (<a href=\"#tbl1\">Table 1</a>; Supplemental Fig. 3A, B). Accordingly, we tested if the differential enrichment of any ether lipid species in primary or secondary follicles depends on biosynthesis within a specific lymphoid lineage. Mice with conditional mutations were tamoxifen-treated, immunized with SRBC, harvested seven days thereafter, and analyzed by IMS (<a href=\"#fig4\">Fig. 4A, B</a>). With deletion driven by the widely expressed <em>Rosa26-CreER<sup>T2</sup></em> transgene, as in earlier work (<a href=\"#c46\">46</a>) and <a href=\"#fig1\">Fig. 1</a>, substantial reductions of the GC enrichment pattern were observed (<a href=\"#fig4\">Fig. 4C</a>). For instance, two representative ions identified in negative ion mode (i.e. <em>m/z</em> 752.5545 and <em>m/z</em> 776.5556) were again enriched in GC regions of spleens from immunized WT mice. These features barely increased in splenic samples of immunized <em>Dhrs7b</em><sup>Δ/Δ</sup> (tamoxifen-injected <em>Dhrs7b</em><sup>f/f</sup>; <em>Rosa26-CreER<sup>T2</sup>)</em> mice (<a href=\"#fig4\">Fig. 4C</a>).</p><div class=\"figure-container\"><figure class=\"figure\" id=\"fig4\"><label class=\"figure__label\">Figure 4.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/104580%2Fv1%2Fcontent%2F618760v3_fig4.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/104580%2Fv1%2Fcontent%2F618760v3_fig4.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">PexRAP is essential for normal concentrations and distributions of some ether phospholipids in splenic follicles.</h4><p>(A) Schematic of immunization for IMS analyses. Mice of the indicated genotypes were treated with tamoxifen, immunized with SRBC, and harvested 1 wk after immunization. (B) Schematic diagram illustrating the 2D-IMS analysis work flow, image merging and quantitation. Harvested spleens were used to generate serial tissue sections followed by immunofluorescence (IF) staining of one section and IMS analysis with the adjacent one. IF and IMS images were aligned to map ion intensity distributions to microanatomic regions (B cell follicle and GC). The intensities of specific ions on B cell follicles and GC regions were quantitated as described in <em>Materials and Methods.</em> (C) Identification of ether lipid species localizing to lymphoid follicles. Representative ion images of two ions [<em>m/z</em> 752.5545, and <em>m/z</em> 776.5556] with spleens from immunized mice (WT and <em>Dhrs7b</em><sup>Δ/Δ</sup>). (D) Identification of ether lipid species localizing to lymphoid follicles. Representative ion images of three ions [<em>m/z</em> 752.5545, <em>m/z</em> 872.5749, and <em>m/z</em> 700.4958] in mass spectrometry imaging of spleens from WT and <em>Dhrs7b</em><sup>Δ<em>/</em>Δ−<em>B</em></sup> mice. Immunofluorescent images at higher magnification, delineating LZ and DZ marked by CD35 staining, along with quantification of sizes of GC and their LZ and DZ, are shown in supplemental data Fig. S4A, B. (E) Shown in the bar graphs are the mean (±SEM) ion intensities in primary lymphoid follicles (B cell zones) and GC from spleens of WT and <em>Dhrs7b</em><sup>Δ/Δ-<em>B</em></sup> mice, immunized or not (“UI”) as indicated. Median intensity of each ion was obtained from 3 follicles / spleen and 3 GC / spleen from WT and <em>Dhrs7b</em><sup>Δ/Δ-<em>B</em></sup> mice (three biological replications comprising 7 WT and 6 cKO spleens). P values were calculated by Mann-Whitney U test.</p></figcaption></figure></div><div class=\"figure-container\"><figure class=\"figure\" id=\"tbl1\"><label class=\"figure__label\">Table 1.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/104580%2Fv1%2Fcontent%2F618760v3_tbl1.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/104580%2Fv1%2Fcontent%2F618760v3_tbl1.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Immunization-induced increases of selected lipids in GC</h4></figcaption></figure></div><p>To determine if the levels of particular ether phospholipids in GC regions were affected by PexRAP expression in B cells, <em>Dhrs7b<sup>f/f</sup></em>; <em>huCD20-</em>CreER<sup>T2</sup> mice and <em>huCD20-</em>CreER<sup>T2</sup> controls were analyzed after tamoxifen injections followed by immunization, and compared to samples from unimmunized mice. IMS using both positive and negative ion modes identified at least eight ions - including <em>m/z</em> 752.5545, <em>m/z</em> 776.5556, and <em>m/z</em> 872.5749 - much more substantially (∼2-3-fold) concentrated in GC of immunized control mice (<a href=\"#fig4\">Fig. 4D, E</a>; <a href=\"#tbl2\">Table 2</a>) than in the primary follicle of unimmunized mice. Notably, these increased signals in secondary follicles (GC) were reduced or almost completely eliminated in GCs of mice immunized after B cell-specific PexRAP depletion (<em>Dhrs7b</em><sup>Δ/Δ-B</sup>) (<a href=\"#fig4\">Fig. 4D, E</a>; <a href=\"#tbl2\">Table 2</a>; Supplemental Fig. 3C).</p><div class=\"figure-container\"><figure class=\"figure\" id=\"tbl2\"><label class=\"figure__label\">Table 2.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/104580%2Fv1%2Fcontent%2F618760v3_tbl2.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/104580%2Fv1%2Fcontent%2F618760v3_tbl2.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Impact of PexRAP on relative quantities of selected lipid species in primary and secondary follicles (GC).</h4></figcaption></figure></div><p>Collectively, these results indicate that <em>Dhrs7b</em> gene expression in activated B cells regulates the spectrum of ether lipids in the micro-anatomic locale of a secondary follicle. Interestingly, immunization also led to modest increases in the levels of some ether and conventional phospholipids in the B cell-rich primary follicle regions (<a href=\"#tbl2\">Table 2</a>). This finding extends the previous report (<a href=\"#c45\">45</a>), which focused on the relationship between the AID-GFP<sup>hi</sup> region (i.e., GC) and lipid features. Moreover, the absence of PexRAP blunted most of the immunization-induced increases observed in the primary follicles. These findings and those of <a href=\"#fig3\">Fig. 3</a> suggest that there are secondary consequences of <em>Dhrs7b</em> inactivation (e.g., some di-acyl phospholipids are affected), but provide direct evidence that the enhancement of many ether phospholipid signals in the GC depends on PexRAP in B cells.</p><h2 id=\"s2c\" class=\"heading-2\">B cell-intrinsic role of <em>Dhrs7b</em> in Ab affinity and quantity</h2><p>As key components of adaptive immunity, progeny of an activated B cell can differentiate into Ab-secreting plasma cells (PC) or into GC B cells - whose physiology diversifies the affinity for and breadth of antigen recognized by the original clone and improves properties of memory [(<a href=\"#c14\">14</a>, <a href=\"#c17\">17</a>–<a href=\"#c19\">19</a>, <a href=\"#c68\">68</a>). PC that develop after a second encounter with antigen yield affinity maturation, and the higher quality and proper quantity of Ag-specific Abs from plasma cells are integral to humoral immune responses (<a href=\"#c68\">68</a>). An increasing body of evidence indicates that metabolic reprogramming and intermediary metabolites modulate immune cell differentiation and function (<a href=\"#c26\">26</a>–<a href=\"#c36\">36</a>). The observed B cell-intrinsic function of <em>Dhrs7b</em> in the accumulation of many ether lipid species in both primary and secondary follicles prompted us to test the effect of B cell type-restricted PexRAP depletion on GC responses and Ag-specific Ab production. Tamoxifen-injected <em>Dhrs7b<sup>f/f</sup></em>; <em>huCD20-CreER<sup>T2</sup></em> and control mice were immunized with NP-ovalbumin (NP-OVA), then boosted with NP-OVA to elicit affinity-matured Ab, and harvested 1 week thereafter (<a href=\"#fig5\">Fig. 5A</a>). Although PexRAP-deficient B cell numbers were reduced less than 20% a week after starting gene inactivation prior to immunization (i.e., were over 0.8-fold those of controls) (<a href=\"#fig2\">Fig 2A-C</a>), frequencies and numbers of IgD<sup>neg</sup> B cells were halved in <em>Dhrs7b</em><sup>Δ/Δ-B</sup> mice at harvest (4 wk after completion of the induced deletion) (<a href=\"#fig5\">Fig. 5B, C</a>). Moreover, the GL7<sup>+</sup> CD95<sup>+</sup> fraction of the B cell population in the dump / IgD<sup>neg</sup> gate was substantially reduced (<a href=\"#fig5\">Fig. 5D</a>), such that numbers of GL7<sup>+</sup> CD95<sup>+</sup> GC B cells were dramatically decreased in <em>Dhrs7b</em><sup>Δ/Δ-B</sup> mice (<a href=\"#fig5\">Fig. 5E</a>). Consistent with these findings, GC in <em>Dhrs7b</em><sup>Δ/Δ-B</sup> mice were reduced after SRBC immunization, with a modest change in the DZ/LZ ratio (Supplemental Fig. 4A, B).</p><div class=\"figure-container\"><figure class=\"figure\" id=\"fig5\"><label class=\"figure__label\">Figure 5.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/104580%2Fv1%2Fcontent%2F618760v3_fig5.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/104580%2Fv1%2Fcontent%2F618760v3_fig5.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">B cell intrinsic role of PexRAP in GC response.</h4><p>(A) Schematic of immunization with NP-OVA in alum after inactivation of <em>Dhrs7b</em> in B lineage cells. Tamoxifen-treated WT (<em>hCD20</em>-CreER<sup>T2</sup>; <em>Dhrs7b<sup>+/+</sup></em>) or <em>Dhrs7b</em><sup>Δ/Δ-<em>B</em></sup> mice <em>(hCD20</em>-CreER<sup>T2</sup>; <em>Dhrs7b<sup>ff</sup></em>) were immunized with NP-OVA, boosted with NP-OVA 3 wk thereafter, and harvested 1 wk after the 2<sup>nd</sup> immunization. (B, C) Representative flow plots of splenic IgD<sup>neg</sup> B cells (B) and aggregate data (C) for two replicate experiments (n = 5 WT and 5 cKO). The cocktail of reagents for the dump channel included anti-IgD. (D, E) B cell-intrinsic function of PexRAP in GC B cell response. Representative flow plots of GL7<sup>+</sup> CD95<sup>+</sup> GC B cells among viable IgD<sup>neg</sup> B cells (D), and aggregated frequencies and numbers of GC B cells for two replicate experiments (E). Mann-Whitney U test was used to calculate p values.</p></figcaption></figure></div><p>Ab class-switch recombination (CSR) and affinity maturation can occur through extrafollicular response, but the GC reaction significantly increases Ab diversification and high-affinity Ab production, in part later in a primary response but also upon secondary exposure to antigens (<a href=\"#c6\">6</a>, <a href=\"#c8\">8</a>, <a href=\"#c9\">9</a>, <a href=\"#c17\">17</a>–<a href=\"#c19\">19</a>). ELISA on sera at 3 wk post-immunization (<a href=\"#fig6\">Fig. 6A-D</a>), just before the boost, showed that B cell-specific depletion of PexRAP prior to immunization reduced NP-specific IgM and the switched isotype IgG1 (<a href=\"#fig6\">Fig. 6A, C</a>). Of note, the capacity to generate high-affinity Ab, detected with low valency NP2, was even more severely undermined than the overall response - especially for IgG1 (<a href=\"#fig6\">Fig. 6B, D</a>). A week after a second immunization, Ab-secreting cells (ASCs) in the spleen (<a href=\"#fig6\">Fig. 6E</a>) and circulating anti-NP IgM concentrations were diminished in <em>Dhrs7b</em><sup>Δ/Δ-B</sup> mice compared with controls that were <em>huCD20</em>-CreER<sup>T2</sup>, <em>Dhrs7b</em><sup>+/+</sup> treated with tamoxifen in parallel to the mice with induced loss of PexRAP (<a href=\"#fig6\">Fig. 6F</a>). The ratio of high-affinity (NP2-binding) to all-affinity (NP20) IgM Ab also was substantially lower in <em>Dhrs7b</em><sup>Δ/Δ-B</sup> mice (<a href=\"#fig6\">Fig. 6G</a>), as were the serum levels of high-affinity IgG1 and IgG2c, class-switched isotypes (Supplemental Fig. S4C, D). These data reinforce and extend the conclusion that the expression of PexRAP in mature B cells is important for their physiology and function.</p><div class=\"figure-container\"><figure class=\"figure\" id=\"fig6\"><label class=\"figure__label\">Figure 6.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/104580%2Fv1%2Fcontent%2F618760v3_fig6.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/104580%2Fv1%2Fcontent%2F618760v3_fig6.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Ab response and affinity increase promoted by PexRAP in B cells.</h4><p>Tamoxifen-treated mice (<em>hCD20</em>-CreER<sup>T2</sup>; <em>Dhrs7b<sup>+/+</sup></em> or <em>hCD20</em>-CreER<sup>T2</sup>; <em>Dhrs7b<sup>ff</sup></em>, i.e., <em>Dhrs7b</em><sup>Δ/Δ-<em>B</em></sup>) were immunized as in <a href=\"#fig5\">Fig. 5</a>, with venous blood collected to measure Ag-specific Ab just prior to a second immunization, followed by harvesting a week thereafter. (A-D) Ag-specific Ab in primary response sera, prior to the boost. Shown are the all-(NP20) and high- (NP2) -affinity anti-NP IgM (A, B) and IgG1 (C, D), as indicated, with NP20 a high hapten density to detect both low- and high-affinity Ab and NP2 a low hapten density selective for high-affinity Ab. (E, F) Levels of anti-NP IgM detected using NP20 and NP2 for ELISpot (F) and ELISA (G) as described in <em>Materials and Methods</em>. Graphs show mean (± SEM) number of Ab-secreting cells in spleen (E) and (F) mean (± SEM) OD450nm in measurement of NP-specific IgM in serial dilutions of sera. P values were calculated by students’ t-test. * indicates p&lt;0.05, and ** indicates p&lt;0.01. (G) PexRAP regulates Ab affinity maturation. The bar graph shows the mean (± SEM) ratios of high-affinity to all-affinity NP-specific IgM Ab in sera of individual mice (each dot representing one subject) using OD450nm values at the 1:2000 dilution, with data from three independent experiments comprising 8 mice of each type (WT; <em>Dhrs7b</em><sup>Δ<em>/</em>Δ−<em>B</em></sup>). P values were calculated by Mann-Whitney U test. (H, I) PexRAP promotes CD138<sup>+</sup> cell differentiation in vivo. B cells were adoptively transferred into µMT recipient mice and analyzed at 4 days after transfer. Representative flow plot of CD138 and cD19 expression (H) and aggregated frequencies of CD138<sup>+</sup> CD19<sup>+</sup> cells in the viable cell gate (I) from four independent replicate experiments. To test for a potential distortion arising from outlier values, statistical testing was performed both with and without their inclusion.</p></figcaption></figure></div><p>Consistent with <em>in vivo</em> results finding reduced Ag-specific ASCs in <em>Dhrs7b</em><sup>Δ/Δ-B</sup> mice compared with controls (<a href=\"#fig6\">Fig. 6E</a>), the attenuated population of PexRAP-deficient B lineage cells recovered after transfer into recipient mice (<a href=\"#fig2\">Fig. 2D</a>) yielded lower frequencies of CD138<sup>+</sup> progeny (<a href=\"#fig6\">Fig. 6H, I</a>) along with evidence of reduced activation [i.e., lower frequencies of IgD<sup>-</sup> progeny (Supplemental Fig. 1I). Mitogen-stimulated <em>Dhrs7b</em><sup>Δ/Δ</sup> B cells also yielded lower frequencies of CD138<sup>+</sup> cells in vitro, but the division-specific frequencies of CD138<sup>+</sup> cells showed only modest decreases in <em>Dhrs7b</em><sup>Δ/Δ</sup> B cells (Supplemental Fig. 4E). Thus, the reduction of CD138<sup>+</sup> cell differentiation appears to be due mostly to its dependence on survival to a sufficient division count.</p><p><em>Dhrs7b</em> inactivation was initiated prior to immunization in the preceding experiments. Therefore, the impact of PexRAP deficiency on GC and the Ab response in such a setting might be due exclusively to impairment of B cells, e.g., their reduced population expansion, prior to their entry into GC. Alternatively, the effects could also in part involve a requirement for PexRAP-dependent metabolites within GC B cells. To test if <em>Dhrs7b</em> functions within GC, we used conditional deletion of <em>Dhrs7b</em> driven by the <em>S1pr2-CreER<sup>T2</sup></em> transgene whose expression at high levels marks GC B cells (<a href=\"#c69\">69</a>). Of note, experiments with a fate-marking reporter allele showed that activated B cells that lack the GC B phenotype were not marked by this conditional Cre after immunization with the NP-carrier approach (<a href=\"#c69\">69</a>). <em>Dhrs7b<sup>f/f</sup></em>; <em>S1pr2-CreER<sup>T2</sup></em>and control <em>S1pr2-CreER<sup>T2</sup></em> (control) mice were immunized with SRBC, and tamoxifen was injected at a time point after the initiation of GC to assure more fully that the inactivation of <em>Dhrs7b</em> would be in GC B cells rather than pre-GC blasts (<a href=\"#fig7\">Figure 7A</a>). Frequencies of GC B cells were substantially lower in tamoxifen-treated <em>Dhrs7b<sup>f/f</sup></em>; <em>S1pr2-</em>CreER<sup>T2</sup> mice (<a href=\"#fig7\">Figure 7B</a>, C), whereas the overall populations of CD138<sup>+</sup> cells, and CD19<sup>+</sup> B220<sup>+</sup> plasmablasts (PBs) among them - almost all of which would have developed prior to the induced loss-of-function - were normal (<a href=\"#fig7\">Figure 7D</a>, E). These data provide evidence that <em>Dhrs7b</em> expression within GC B cells influences them during an Ab response. Collectively, these data indicate that an optimal GC response requires PexRAP function in B cells, and the B cell-intrinsic functions of <em>Dhrs7b</em> promote the quantity and affinity maturation of Ab responses, in part via net proliferation of B cells.</p><div class=\"figure-container\"><figure class=\"figure\" id=\"fig7\"><label class=\"figure__label\">Figure 7.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/104580%2Fv1%2Fcontent%2F618760v3_fig7.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/104580%2Fv1%2Fcontent%2F618760v3_fig7.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Function of PexRAP in GC response.</h4><p>(A) Schematic of the time line of immunization followed later by tamoxifen injections into <em>S1pr2</em>-CreER<sup>T2</sup> mice (<em>Dhrs7b<sup>+/+</sup></em>or <em>Dhrs7b<sup>f/f</sup></em>). Note that deletion is initiated after the germinal center reaction starts (∼ 3.5 d post-immunization). Mice (<em>S1pr2</em>-CreER<sup>T2</sup>; <em>Dhrs7b<sup>+/+</sup></em> or <em>S1pr2</em>-CreER<sup>T2</sup>; <em>Dhrs7b<sup>f/f</sup></em>) were immunized with NP-OVA, treated with tamoxifen on days 3, 5, and 7 after NP-OVA immunization (<a href=\"#c36\">36</a>) and harvested at day 9. (B) Representative flow plots of GL7<em><sup>+</sup></em>CD95<em><sup>+</sup></em> GC B cells among viable B cells and (C) aggregated mean (±SEM) frequencies of GC B cells from three replicate experiments (7 WT; 9 cKO mice). Mann-Whitney U test was used to calculate p values. (D, E) Effect of PexRAP on the level of plasmablasts in spleen. Representative flow plots of B220<sup>+</sup> CD19<sup>+</sup> plasmablasts among the events in a dump<sup>-</sup> CD138<sup>+</sup> TACI<sup>+</sup> gate (D) and aggregated mean (±SEM) frequencies of these plasmablasts (E).</p></figcaption></figure></div><h2 id=\"s2d\" class=\"heading-2\"><em>Dhrs7b</em> contributes to modulation of ROS and their impact on B cell population growth</h2><p>Increased susceptibility to cell death after activation would be a mechanism that could cause the reduced population expansion, GC, and Ab production. Consistent with earlier analyses of LPS-stimulated B cells (<a href=\"#c70\">70</a>), we had noted that ROS levels were higher in GC B cells, memory B cells (MBCs) and ASCs than in the naive B2 B cell pool (<a href=\"#c36\">36</a>). ROS can be produced in activated B cells via diverse sources that include mitochondrial electron transport chain function, NADPH oxidase activated by BCR engagement, and fatty acid oxidation in peroxisomes (<a href=\"#c71\">71</a>–<a href=\"#c73\">73</a>). ROS can positively mediate signal transduction, but their steady-state concentrations need to be calibrated because overproduction can have deleterious effect on cells, for instance via lipid peroxidation at excessive rates (<a href=\"#c74\">74</a>–<a href=\"#c76\">76</a>). Endogenous antioxidant properties have been imputed to plasmalogens because the vinyl ether bond is susceptible to reaction with reactive oxygen, thereby scavenging ROS (<a href=\"#c48\">48</a>, <a href=\"#c57\">57</a>–<a href=\"#c59\">59</a>). When we tested if <em>Dhrs7b</em> function is critical for redox control in B cells, mitogen-stimulated <em>Dhrs7b</em><sup>Δ/Δ</sup> B cells exhibited ∼3 fold higher signal and about a doubling when stained with fluorescent sensors of cellular and mitochondrial ROS, respectively, compared to WT B cells <em>in vitro</em> (<a href=\"#fig8\">Fig. 8A-D</a>). Iron- and copper-dependent lipid peroxidation is considered to be a biological mechanism for ROS-mediated cell death (<a href=\"#c75\">75</a>, <a href=\"#c76\">76</a>). Lipid peroxidation measured by a fluorescent indicator (C11-Bodipy) in vitro was enhanced in mitogen-activated <em>Dhrs7b</em><sup>Δ/Δ</sup> B cells compared with WT controls (<a href=\"#fig8\">Fig. 8E</a>). One independent means of driving increased ROS and lipid peroxidation in B cells (supplemental Fig. S5A) rapidly led to reduced cell viability and B cell numbers (<a href=\"#fig8\">Fig. 8F</a>). Furthermore, in vitro analyses indicated that B cells lacking PexRAP also exhibited increases in the activated executioner caspase, cleaved caspase-3 (CC3) along with early apoptotic cells that are annexin V<sup>+</sup> but exclude 7-aminoactinomycin D (<a href=\"#fig8\">Fig. 8G, H</a>). These data indicate that <em>Dhrs7b</em> function supports not only protection against cell death, but also control of cellular and mitochondrial ROS levels and their impact on lipid modification. Of note, while H2O2 did not increase this early apoptotic population (Supplemental Fig. SC), increasing ROS with menadione drove B cell death preceded by annexin V<sup>+</sup> state without an increase in C11-Bodipy signal (Supplemental Fig. S5D-G). We infer that rather than a single mode of death, increased ROS resulting from PexRAP depletion stimulates at least two distinct modes of B cell death.</p><div class=\"figure-container\"><figure class=\"figure\" id=\"fig8\"><label class=\"figure__label\">Figure 8.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/104580%2Fv1%2Fcontent%2F618760v3_fig8.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/104580%2Fv1%2Fcontent%2F618760v3_fig8.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">PexRAP contributes to ROS homeostasis and B cell population growth in vitro.</h4><p>(A-D) PexRAP is critical for maintenance of normal ROS levels. Bead-purified B cells from spleens of tamoxifen-treated <em>huCD20</em>-CreER<sup>T2</sup> mice (<em>Dhrs7b</em><sup>Δ/Δ-B</sup> and <em>Dhrs7b</em><sup>+/+</sup>) were cultured 3 days in anti-CD40, BAFF, IL-4, IL-5 and 4-hydroxytamoxifen. Total cellular (A, B) and mitochondrial ROS, mtROS (C, D) in B lymphoblasts were determined by flow cytometry after staining with surface markers and H2DCFDA and MitoSOX, as described in the Methods. Representative histogram image of H2DCFDA (A) and MitoSOX (C) in the B cell gate, and aggregated mean (± SEM) geometric MFI of H2DCFDA (B) and MitoSOX (D) from 3 independent experiments, each using two mice of each type (6 WT; 6 cKO). P values were calculated by Mann-Whitney U test. (E) PexRAP restrains lipid peroxidation. B cells were activated and cultured as in (A). A representative result of flow cytometric analyses of lipid peroxidation assayed using C11-Bodipy is shown, based on three independent experiments. (F, G) PexRAP promotes B cell survival. (F) Shown are the mean (±SEM) frequencies of total viable ’events’ (by FSC, SSC, and 7-AAD exclusion) in flow cytometry (filled circles) and MFI of Bodipy-C11 (open squares) after exposure to H2O2 (200 µM). (*, ** -p=0.03 and 0.003, respectively). (G-I) WT and <em>Dhrs7b</em><sup>Δ/Δ</sup> B cells were cultured (2 d) in anti-CD40, BAFF, IL-4, IL-5 and 4-hydroxytamoxifen. (G) Increased cleaved caspase 3 (CC3) in PexRAP-deficient cells generated in vitro. Cleaved caspase 3 in B cells was detected by intracellular staining and flow cytometry. Shown are a representative pair of histograms for WT and <em>Dhrs7b</em><sup>Δ/Δ</sup> B cells as indicated (left panel) and a dot graph aggregating all experiments’ outcomes (right panel). (H) Frequencies of apoptotic B cells in cultures as in (A-D) were scored for annexin V and 7AAD as described (<a href=\"#c84\">84</a>). Shown are representative data of flow plots in the lymphocyte gate (left panel) and a dot graph aggregating all experiments’ outcomes (right panel). (I, J) PexRAP and ROS control promote B cell population growth in vitro. WT and <em>Dhrs7b</em><sup>Δ/Δ</sup> B cells were cultured 5 days in anti-CD40, BAFF, IL-4, IL-5 and 4-hydroxytamoxifen in the presence or absence of ROS scavenger NAC (1 mM vs 5 mM) (H). (I) B cells activated as in (A-G) were cultured 5 d in the presence or absence of NAC (1 mM) or thioridazine (100 nM). The bar graphs show the mean (± SEM) recovered cell number from three independent experiments, each with two independent samples of each genotype (WT; <em>Dhrs7b</em><sup>Δ/Δ</sup>).</p></figcaption></figure></div><p>Consistent with the increased steady-state ROS and death, activated <em>Dhrs7b</em><sup>Δ/Δ</sup> B cells exhibited a defect in B cell population growth <em>in vivo</em> and <em>in vitro</em> (<a href=\"#fig2\">Fig. 2</a>; <a href=\"#fig8\">Fig. 8A-H</a>). The well-established ROS scavenger, N-acetyl-L-cysteine (NAC), exerted a concentration-dependent effect that improved the survival and population growth of PexRAP-deficient B cells (<a href=\"#fig8\">Fig. 8I</a>).</p><p>We exploited the sub-maximal rescue by a lower concentration of NAC (1 mM) to explore if peroxisomal oxidative metabolism might contribute to the toxicity observed when B cells are PexRAP-depleted. Although thioridazine on its own provided no increase in the B cell population growth, its combination with 1 mM NAC treatment improved growth of the <em>Dhrs7b</em><sup>Δ/Δ</sup> B cell population compared to either agent on its own (<a href=\"#fig8\">Fig. 8J</a>). These data indicate that sufficient generation of PexRAP-dependent products is crucial for B cell survival. Moreover, this enzyme contributes - directly or indirectly - to a resolution or detoxification of ROS that is critical for population growth of activated B cells.</p><h2 id=\"s2e\" class=\"heading-2\"><em>Dhrs7b</em> in B cells affects their oxidative metabolism and ER mass</h2><p>Our finding that mitochondrial ROS were increased prompted us to investigate how PexRAP affects physiological functions by measuring respiration in activated B cells. Mitochondrial stress tests with in vitro activated B lymphoblasts measured small but definite decreases in both basal and maximal respiration (oxygen consumption rates, or OCR) (<a href=\"#fig9\">Fig. 9A-C</a>). The altered performance of mitochondria was associated with reductions in calculated ATP generation and proton leak as well as a small decrease in spare respiratory capacity (SRC) (<a href=\"#fig9\">Fig. 9D-F</a>, respectively). In contrast, the rates of glucose-stimulated extracellular acidification - cytosolic reactions and a surrogate that can approximate glycolytic activity - were unaffected (<a href=\"#fig9\">Fig. 9G</a>).</p><div class=\"figure-container\"><figure class=\"figure\" id=\"fig9\"><label class=\"figure__label\">Figure 9.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/104580%2Fv1%2Fcontent%2F618760v3_fig9.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/104580%2Fv1%2Fcontent%2F618760v3_fig9.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">PexRAP deficiency in activated B cells reduces mitochondrial metabolism and ER mass.</h4><p>(A-G) Purified B cells were activated with and cultured (2 d) in αCD40, BAFF, IL-4, IL-5, and 4-OHT, then divided and analyzed using a Seahorse XFe96. (A) Shown are aggregated results from three independent experiments measuring oxygen consumption rate (OCR) quantified via metabolic flux analysis during mitochondrial stress testing. (B) Basal OCR, (C) maximal OCR, (D) ATP-production coupled respiration, (E) proton leak, and (F) spare respiratory capacity of WT and <em>Dhrs7b<sup>Δ/Δ</sup></em> B cells assayed in (A). Data points of individual samples are show (each individual dot), as well as bars to display mean (±SEM) values. T-tests with Welch’s correction were used to calculate p-values. *, p&lt;0.05; ***, p&lt;0.001. (G) Extracellular acidification rate (ECAR) of B cells cultured as described previously (<a href=\"#c36\">36</a>) and assessed using the glycolytic stress test. (H, I) PexRAP influences ER mass. WT and <em>Dhrs7b</em><sup>Δ/Δ</sup> B cells were cultured 5 days in anti-CD40, BAFF, IL-4, IL-5 and 4-hydroxytamoxifen followed by the staining with ER-Tracker Green. Representative histogram of ER-Tracker Green in viable cells (H) and aggregated MFI (±SEM) of ER-Tracker Green from three replicate experiments (I). Mann-Whitney U test was used to calculate p values.</p></figcaption></figure></div><p>Thus, the altered respiration did not reflect a decrease in all cell metabolism. Inasmuch as peroxisomes and mitochondria form contacts and functionally interact with the ER, we measured relative ER mass and found that the signal of the fluorophore ERTracker was consistently reduced in PexRAP-depleted B cells (<a href=\"#fig9\">Fig. 9H, I</a>). We infer that both mitochondrial function and ER mass in B cells are promoted by their expression of PexRAP.</p><h1 id=\"s3\" class=\"heading-1\">Discussion</h1><p>We have shown herein that B lymphocyte expression of an enzyme essential for biosynthesis of a subset of ether phospholipids is crucial for part of the increases in their levels localized to GC. Moreover, the genetic approach used to deplete B cells of PexRAP allowed us to show that the B cell type-restricted gene, <em>Dhrs7b</em>, promotes B cell survival, proliferation, and GC size along with affinity maturation and serum concentrations of Ag-specific Ab after immunization. Taken together, this work establishes the predictive value of the discovery approach that identified an unexpected feature of cellular biochemistry in GC and indicates that B cell-autonomous generation of ether lipid species is crucial for B cell survival and the qualities of the Ab elicited by immunization.</p><p>Using imaging mass spectrometry for discovery-based hypothesis generation, we had reported that the concentrations of at least a dozen ether phospholipids are increased in splenic GC relative to the remainder of the tissue (<a href=\"#c45\">45</a>). The analyses presented here confirm and extend the observations, and provide evidence that after immunization, these concentrations increase even in the primary B cell follicle, albeit to a modest degree when compared to the magnitude of increases in GC, and in B cells activated ex vivo. The cell type-specific gene inactivation after establishment of a pre-immune population establishes that an enzyme crucial for generation of a number of plasmalogens has substantial effects on B lymphocyte physiology and function.</p><p>Plasmalogens and other ether lipids and phospholipids have long been shown to be major constituents of lipid bilayers and cell membranes (<a href=\"#c48\">48</a>, <a href=\"#c49\">49</a>, <a href=\"#c57\">57</a>). However, remarkably little is known about whether or not cell-intrinsic synthesis of ether lipids or the balance among their specific molecular species matters for hematopoietic cells or in immunity. Several inborn errors of metabolism in humans are attributable to loss-of-function mutations of genes encoding peroxisomal proteins that impact ether lipid (and hence plasmalogen) synthesis (<a href=\"#c58\">58</a>) but affect other critical processes as well [reviewed in (<a href=\"#c48\">48</a>, <a href=\"#c58\">58</a>–<a href=\"#c62\">62</a>)]. Several of these - such as Zellweger Syndrome and rhizomelic chondrodysplasia punctata (RCDP) - and the mouse models generated to study mechanisms in these human disease, lead to severe neurological defects and early post-partum death (<a href=\"#c57\">57</a>, <a href=\"#c58\">58</a>). Whether or not lymphocyte development, homeostasis or function were affected in these studies is not clear. Deficient generation of ether lipids is among many abnormalities caused by elimination of fatty acid synthase (FAS) (<a href=\"#c46\">46</a>, <a href=\"#c47\">47</a>). Acute inactivation of <em>Fasn</em>, the gene encoding this enzyme, in young mature mice caused a decrease in spleen size disproportionate to the reduction in neutrophils, which was the most profound hematological consequence (<a href=\"#c46\">46</a>). In addition, circulating lymphocytes were reduced despite normal steady-state representation in the marrow. In-trans cell-extrinsic functions of ether lipids have been noted previously - specifically, as ligands for the invariant natural killer T cell receptor (<a href=\"#c77\">77</a>) or for a G-protein coupled receptor on natural killer cells (<a href=\"#c78\">78</a>). As such, the widespread loss of FAS function and the potential for indirect and pleiotropic effects of this enzyme deficiency left unresolved what cells actually depend on their own synthesis of ether lipids.</p><p>PexRAP, the enzyme encoded by the <em>Dhrs7b</em> gene, generates intermediates vital for the synthesis of some - but not all - ether lipids in cells such as neutrophils (<a href=\"#c46\">46</a>). Analyses of neutrophil numbers and survival provided evidence that this enzyme can be crucial for a normal membrane composition. Moreover, PexRAP promoted viability of this very short-lived cell type whose membranes have a high plasmalogen content (<a href=\"#c46\">46</a>). The bloodborne population of lymphocytes was reduced in the <em>Rosa</em>26-CreER<sup>T2</sup>, <em>Dhrs7b</em><sup>f/f</sup> mice (<a href=\"#c46\">46</a>), but the specific types of lymphoid cell were not reported and the circulating cell number does not necessarily correlate with that in spleen or other organs. Of note, although subject to points articulated in (<a href=\"#c53\">53</a>), the interpretation that the neutrophil phenotype is due to insufficiency of ether lipids or plasmalogens has been questioned based on alternative gene disruption results (<a href=\"#c54\">54</a>). Several models of unconditional gene inactivation or mutation that drastically reduced the phospholipid end-products were noted to have normal neutrophils [summarized in (<a href=\"#c54\">54</a>), albeit at older ages (4 - 7 mo) than those used in (<a href=\"#c46\">46</a>). As noted, however, there may be age-related changes in the processes analyzed herein using young (age ∼ 2 mo) mice (<a href=\"#c53\">53</a>). Moreover, cellular and organismal selection for adaptation variants makes the results of acute loss-of-function inherently different from unconditional loss and heterozygote parentage (<a href=\"#c53\">53</a>). The potential for toxicity induced by 4OHT activation of CreER<sup>T2</sup> was among concerns mooted about the earlier study of neutrophils (<a href=\"#c54\">54</a>). This concern may have been extrapolated from papers that noted impairment in earlier hematopoiesis when <em>Rosa26</em>-CreER<sup>T2</sup> was combined with intensive regimens of tamoxifen administration to infant mice (<a href=\"#c65\">65</a>, <a href=\"#c79\">79</a>). Of note, such studies used individual doses over 4-fold higher that those used herein, and delivered by gavage five times on a daily basis, yet the IgM<sup>+</sup> B cell population sizes in spleen and marrow were normal even in the face of reduced erythropoiesis and thymopoiesis (<a href=\"#c65\">65</a>). Moreover, the analyses herein compared B lineage-specific deletion to CreER<sup>T2+/-</sup>, <em>Dhrs7b</em><sup>+/+</sup> mice identically dosed in parallel with the test subjects. Thus, the work herein indicates that PexRAP is essential for normal physiology and function of mature B lymphocytes, in particular after their activation.</p><p>The findings are most consistent with a capacity for PexRAP function to contribute towards B lymphocyte survival and effective proliferation by restraining both executioner caspase activation and lipid peroxidation due to excessive ROS levels. These findings are consistent with those obtained with neutrophils (<a href=\"#c46\">46</a>). On the surface such results might appear to present a conundrum relative to work indicating that both fatty acyl-CoA reductase 1 and the enzyme that later generates an alkenyl bond at a terminal step in plasmalogen biosynthesis are crucial for the susceptibility of HT-1080 and 786-O tumor cell lines to ferroptosis (<a href=\"#c55\">55</a>). However, our data are consistent with published evidence that PexRAP is needed for a narrower subset of ether lipids than the broad requirement for FAS or fatty acyl-CoA reductases (<a href=\"#c46\">46</a>–<a href=\"#c49\">49</a>, <a href=\"#c80\">80</a>, <a href=\"#c81\">81</a>). Moreover, molecular dissection of mechanisms in various non-hematopoietic cell types (including the cancer line 786-O) showed that ether lipid biosynthesis can either promote susceptibility or resistance to ferroptosis (<a href=\"#c82\">82</a>). Collectively, our findings suggest that for B cells the inactivation of PexRAP tilts the balance toward death and reduced Ab - perhaps involving lower fractions of poly-unsaturated fatty acids (PUFA) (<a href=\"#c82\">82</a>), or a lower ratio of plasmalogens (alkenyl linkages) relative to alkyl-linked ether lipids.</p><p>PexRAP localizes to peroxisomes (<a href=\"#c35\">35</a>–<a href=\"#c37\">37</a>), and prior work has suggested both that peroxisomes are increased in GC B cells and likely contribute to FAO by these cells (<a href=\"#c26\">26</a>). In line with the possibility that this organelle may affect PexRAP-dependent survival, our data indicated that specific inhibition of peroxisomal FAO could collaborate with sub-optimal ROS scavenging to mitigate the reduced growth of activated B cells. However, recent findings show that PexRAP also is expressed in the ER and is capable of contributing to ether lipid biosynthesis via catalysis in this organelle in addition to or instead of the peroxisome (<a href=\"#c56\">56</a>). Thus, although ROS generated in peroxisomes likely contribute to the stress experienced by PexRAP-deficient B cells, the phenotypes observed herein may not reflect the need for the peroxisomal fraction of the enzyme.</p><p>Our findings with an intermediary in ether lipid biosynthesis add to an increasing body of evidence that metabolism in B lymphocytes affects their differentiation or function (<a href=\"#c28\">28</a>–<a href=\"#c36\">36</a>). Many sources and forms of Ab can be protective, while in several autoimmune diseases these molecules can drive pathology (<a href=\"#c1\">1</a>, <a href=\"#c2\">2</a>). The capacity to generate increased affinities and circulating concentrations of Ab is an important factor both in protective immunity and auto-immune disease. Antigen-independent, TLR-driven PC differentiation requires increased oxidative phosphorylation (<a href=\"#c70\">70</a>), while oxidative metabolism in GC B cells promotes affinity maturation by unknown mechanisms (<a href=\"#c33\">33</a>–<a href=\"#c35\">35</a>). While not the exclusive determinant of such properties, GC are major sources of higher affinity Ab with a broader spectrum of specificities (<a href=\"#c9\">9</a>, <a href=\"#c13\">13</a>, <a href=\"#c14\">14</a>). GC formation, size, and function depend on the efficiency of population growth for B cells in a phase before they enter and take on characteristics of GC B cells, and then homeostatic and differentiative processes while in the secondary follicle. Thus, while the findings with the post-immunization inactivation of <em>Dhrs7b</em> using <em>S1pr2</em>-CreER<sup>T2</sup> provide evidence that the expression of PexRAP is important within GC B cells, the decreases of GC and affinity-matured Ab are likely also to involve a pre-GC phase of clonal expansion. In any case, the rapidity of the effects suggests that pharmacological inhibition of PexRAP may be a target in inflammatory disease in which B cells participate, particularly in light of the potential for impacts on pro-inflammatory neutrophils.</p><h1 id=\"s4\" class=\"heading-1\">Materials &amp; methods</h1><h2 id=\"s4a\" class=\"heading-2\">Reagents</h2><p>Monoclonal antibodies (mAb) against mouse CD40, CD90.2, B220 (CD45R), and other mAbs (purified, biotinylated, or fluorophore-conjugated) were from BD Biosciences or Tonbo Biosciences (San Diego CA) unless otherwise indicated. BAFF was from AdipoGen (San Diego, CA). Recombinant mouse IL-4 and recombinant mouse IL-5 were from Peprotech (Rocky Hill NJ). Glucose, 2-deoxyglucose, oligomycin, rotenone, antimycin A, carbonyl cyanide 4-phenylhydrazone (FCCP), N-acetyl-cysteine (NAC), thioridazine hydrochloride, H2O2, and 4-hydroxytamoxifen (4-OHT) were from Sigma-Aldrich Chemicals (St. Louis MO), and menadione from Cayman Chemicals (Ann Arbor, MI). Tamoxifen (Tmx) was from APExBio Technology (Houston TX). NP-BSA and NP-PSA (for capture in ELISA) as well as NP-OVA (for immunization) were obtained from Biosearch Technology (Novato CA). SRBCs (sheep red blood cells) were from Thermo Fisher Scientific (Waltham MA). CellTrace<sup>TM</sup> Violet cell proliferation kit, CM-H2DCFDA, MitoSOX<sup>TM</sup> Red, and BODIPY<sup>TM</sup> 581/591 C11 were obtained from Invitrogen (Waltham, MA).</p><h2 id=\"s4b\" class=\"heading-2\">Mice, immunizations, ELISA and ELISpot</h2><p>All animal protocols were reviewed and approved by the Vanderbilt University Institutional Animal Care and Use Committee. Mice were housed in ventilated micro-isolators under Specified Pathogen-Free conditions in a Vanderbilt University Medical Center mouse facility and used both male and female mice at 6–8 weeks of age. For cell type specific inactivation of <em>Dhrs7b</em> genes, <em>Dhrs7b</em><sup>f/f</sup> mice (<a href=\"#c46\">46</a>) were crossed with <em>Rosa26-</em> CreER<sup>T2</sup> (<a href=\"#c46\">46</a>), <em>huCD20-</em>CerER<sup>T2</sup> (<a href=\"#c30\">30</a>), or <em>S1pr2-</em>CreER<sup>T2</sup> strains (<a href=\"#c51\">51</a>, <a href=\"#c52\">52</a>), all on C57/BL6 genetic background. Tamoxifen was administered as previously reported (<a href=\"#c25\">25</a>, <a href=\"#c30\">30</a>). To control for potential Cre toxicity, CreER<sup>T2</sup> mice were similarly injected to use as wild-type (WT) controls.</p><p>Mice (ages ∼ 8wk) were immunized with SRBCs (2×10<sup>8</sup> cells per mouse) and analyzed 1 week after immunization as described (<a href=\"#c25\">25</a>, <a href=\"#c45\">45</a>). Alternatively, mice were immunized and boosted by i.p. injections [each of 100 µg NP16-OVA (Biosearch Technologies, Novato, CA) emulsified in 100 µL of Imject<sup>TM</sup> Alum (Thermo Fisher Scientific, Pittsburgh, PA)] as described previously (<a href=\"#c25\">25</a>, <a href=\"#c30\">30</a>), and harvested for analyses 1 wk after the 2<sup>nd</sup> injection. Isotype-specific relative levels of Ag-specific Ab were quantitated by capture ELISA using Ag (NP20-BSA or NP2-PSA for all- or high-affinity hapten-specific Abs, respectively) followed by SBA Clonotyping System (Southern Biotech, Birmingham AL), as described previously (<a href=\"#c25\">25</a>, <a href=\"#c30\">30</a>). As previously described (<a href=\"#c30\">30</a>), frequencies of Ab-secreting cells (ASCs) were analyzed by ELISpot and quantitated using an ImmunoSpot Analyzer (Cellular Technology, Shaker Heights OH).</p><h2 id=\"s4c\" class=\"heading-2\">Cell cultures, proliferation assay, and reversion of population growth</h2><p>Splenic B cells were purified (90-95%) using negative selection as previously described (<a href=\"#c30\">30</a>) or by positive selection with anti-mouse B220 microbeads (Miltenyi Biotech, Auburn, CA). B cells (5 × 10<sup>5</sup> cells in 1 ml) were activated with anti-CD40 (1 μg/mL) and cultured with BAFF (10 ng/mL), IL-4 (10 ng/mL), IL-5 (10 ng/mL) and 4-OHT (50 nM) in Iscoves Modified Dulbecco’s Medium (IMDM) supplemented with 10% Fetal Bovine Serum (FBS), 100 U/mL penicillin 100 µg/mL streptomycin (Invitrogen), 3 mM L-glutamine, nonessential amino acids (Invitrogen), 0.1 mM 2-ME (Sigma-Aldrich). To analyze the effect of ROS scavenger and inhibition of peroxisomal lipid oxidation on population growth, bead-purified B cells from tamoxifen-treated <em>huCD20-</em>CerER<sup>T2</sup> or <em>Dhrs7b<sup>f/f</sup></em>; <em>huCD20-</em>CerER<sup>T2</sup> mice were activated with anti-CD40, cultured with BAFF, IL-4 and IL-5 in the presence or absence of NAC (1 mM and 5 mM) and/or thioridazine·HCl (100 µM) for 5 days. For enhancement of ROS in WT B cells, purified B cells were analyzed 3 d after activation as for ROS scavenging, but vehicle, H2O2 (200 μM) or menadione (8 μM) was added at three different time points (overnight, 3 hours, and 1 hour prior to processing for flow cytometry to counting and measurements of DCFDA, annexin V, and C11 Bodipy signals.</p><p>For the analysis of proliferation in vitro, B cells were purified by depleting CD90.2<sup>+</sup> T cells and CD138<sup>+</sup> cells using biotinylated anti-CD90.2 Ab and biotinylated anti-CD138 Ab followed by streptavidin-conjugated microbeads (iMag<sup>TM</sup>; BD Bioscience), labeled with 5 µM CellTrace<sup>TM</sup> Violet (CTV, Invitrogen), activated and cultured as above. To analyze proliferation in vivo, B cells were purified, labeled with CTV, and injected intravenously into B cell deficient µMT recipient mice. Mice were harvested at 4 days after adoptive transfer.</p><h2 id=\"s4d\" class=\"heading-2\">Flow cytometry - general and measurements of ROS, lipids peroxidation, and ER</h2><p>GC B cells were identified as GL7<sup>+</sup> CD95<sup>+</sup> events in the viable B220<sup>+</sup> dump<sup>-</sup> gate (dump channel consisting of one fluorophore for CD11b, CD11c, F4/80, Gr1, TCRβ, and 7AAD), while plasmablasts were defined as B220<sup>+</sup> CD138<sup>+</sup> TACI<sup>+</sup> dump<sup>-</sup> cells. For flow analyses of total intracellular ROS and mitochondrial superoxide, B cells (1 × 10<sup>6</sup> cells) were washed with PBS and stained with 1.25 µM CM-H2DCFDA or 5 µM MitoSOX<sup>TM</sup> Red in PBS (20 min at 37°C), respectively, then washed with 1% BSA containing PBS, and further stained with anti-B220, anti-CD19, anti-CD138, and Ghost-BV510. To measure the lipid peroxidation, cultured B cells (1 × 10<sup>6</sup>) were washed with PBS and stained with 1.25 µM C11-BODIPY<sup>TM</sup> in PBS (20 min at 37°C), and washed with 1% BSA containing PBS followed by surface staining as above. To analyze the level of endoplasmic reticulum (ER), B cells (1 × 10<sup>6</sup>) were stained with 0.5 µM ER-Tracker<sup>TM</sup> Green (Molecular Probes, Eugene OR) in Hank’s Balanced Salt Solution with calcium and magnesium (HBSS/Ca/Mg; Gibco) for 30 min at 37°C.</p><p>For measurements of cell death (<a href=\"#c78\">78</a>), cultured B cells (1 x 10<sup>6</sup>) were washed twice with PBS, once with Annexin V binding buffer (10 mM HEPES, pH 7.4, 140 mM NaCl, 2.5 mM CaCl2), and then incubated (15 min at 20 C in the dark) with Annexin V-rPE, 7AAD, APC-conjugated CD138, APC-Cy7-conjugated B220, e450-CD19. Cells were then washed with Annexin V binding buffer and analyzed on the flow cytometer. To measure levels of cleaved caspase-3 (<a href=\"#c25\">25</a>), an activated apoptosis executor, the cultured cells were rinsed with PBS after harvest, stained (15 min at 4 C) with 7AAD, APC-conjugated CD138, APC-Cy7-conjugated B220, e450-CD19, washed (FBS, 1% v/v in PBS), then fixed with paraformaldehyde (4% w/v, 10 min at 20 C), permeabilized with permeabilization buffer (saponin, 0.2% w/v with FBS 1% in PBS), stained with FITC-conjugated Ab specific for cleaved caspase-3 (BD Biosciences), rinsed, and analyzed by flow cytometry.</p><h2 id=\"s4e\" class=\"heading-2\">Immunohistochemistry, MALDI-IMS, and IMS data analysis</h2><p>Mice were immunized with SRBC and spleens were harvested at 1 week after immunization. Spleens were snap frozen on dry ice, and mounted to a cryostat chuck with a minimal amount of OCT (Thermo Fisher Scientific, San Jose, CA). Frozen spleens were cut at 12 µm thickness using a Leica CM3050S (Leica, IL, USA) at -20 °C, fixed with 1% paraformaldehyde for 10 min, washed twice with PBS, and blocked with M.O.M<sup>TM</sup> (Vector Lab) followed by incubation with GL7-FITC, anti-IgD-PE, and anti-CD35-biotin Ab followed by streptavidin-conjugated Alex647at 4 °C. After the tile scanning of spleen sections, GC size and numbers were quantified with FIJI Image J software.</p><p>For Matrix-Assisted Laser Desorption/Ionization (MALDI) Imaging Mass Spectrometry (IMS), frozen spleens were cut as above, and mounting onto indium tin oxide (ITO) coated microscope slides (Delta Technologies ETC). Slides were then vacuum desiccated for at least 30 minutes before matrix application. Pre-IMS autofluorescence (AF) images were acquired prior to matrix application on a Zeiss Axio Scan Z1 Slide Scanner using the brightfield channel and the DAPI (ex. 340-380 nm; em. 435-485 nm, blue), EGFP (ex. 450-490 nm; em. 500-550 nm, green), DsRed (ex. 538-562 nm; em. 570-640 nm, red) filter cubes. After taking AF images, a custom in-house developed sublimation device was used to apply the matrices 2,5-dihydroxyacetophenone (DHA) and 1,5-diaminonaphthalene (DAN) (Sigma Aldrich, St. Louis, MO, USA) to tissue sections for positive and negative ion mode analyses, respectively (<a href=\"#c78\">78</a>). For immunized AID-GFP mice, the fluorescence emissions identified GC localization within the section used next for IMS. Alternatively, two serial sections of immunized mice spleens were used, one for 2D-IMS and the contiguous section for immunohistochemistry (IHC). Fluorescence data were registered with the 2D-IMS visualizations of phospholipids to align images (<a href=\"#c45\">45</a>), allowing quantitation of the ion intensities in specific m/z peaks within defined micro-anatomic portions of the spleen (<a href=\"#fig4\">Fig. 4B</a>). MALDI IMS data were acquired with a 10 µm pixel size (laser spot size 8 µm) in full scan mode using a Bruker trapped ion mobility time-of-flight (timsTOF) Flex mass spectrometer (Bruker Daltonics Billerica, MA, USA). Data were acquired with 250 shots per pixel and a mass range of <em>m/z</em> 200-2000. SCiLS (software Bruker Daltonics) was used to process the data, normalize ion intensity, visualize ion images, and merge the images.</p><h2 id=\"s4f\" class=\"heading-2\">LC-MS for lipidomics</h2><p>To prepare samples, a one-phase method was used to extract lipids (<a href=\"#c85\">85</a>). Briefly, 0.5 mL of MeOH/MTBE/CHCl3 mix (1.3:1:1) was added to a frozen pellet of B-cells (1x10<sup>6</sup> cells total), spiked with 10 uL EquiSPLASH-lipidomics internal standard mix (Avanti Research), briefly vortexed and shaken gently for 20 min, followed by centrifugation at 20,000 x <em>g</em> for 15 min at 10°C. The supernatant was transferred to a clean Eppendorf tube, evaporated under a gentle stream of N2 gas, and resuspended in 100 uL methanol/CHCl3 (9:1) and 2uL were used for LC-HRMS (high-resolution MS) analysis. Each sample was injected two times - one injection in positive ESI mode followed by one in negative mode. Pooled QCs were injected to assess the performance of the LC and MS instruments at the beginning, in the middle and at the end of each sequence. Discovery lipidomics data were acquired using a Vanquish UHPLC (ultrahigh performance liquid chromatography) system interfaced to a Q Exactive HF quadrupole/orbitrap mass spectrometer (Thermo Fisher Scientific).</p><p>Chromatographic separation was performed with a reverse-phase Acquity BEH C18 column (1.7 mm, 2.1x150mm, Waters, Milford, MA) at a flow rate of 250 ul/min. Mobile phases were made up of 10 mM ammonium formate and 0.1% formic acid in (A) H2O/CH3CN (40:60) and in (B) CH3CN/ iPrOH (10:90). Gradient conditions were as follows: 0–1 min, B = 20 %; 1–8 min, B = 20– 100 %; 8–10 min, B = 100 %; 10–10.5 min, B = 100–20 %; 10.5–15 min, B = 20%. The total chromatographic run time was 15 min. Mass spectra were acquired over a precursor ion scan range of m/z 200 to 1,600 at a resolving power of 60,000 using the following HESI-II source parameters: spray voltage 4 kV (3 kV in negative mode); capillary temperature 250°C; S-lens RF level 60 V; N2 sheath gas 40; N2 auxiliary gas 10; auxiliary gas temperature 350°C. MS/MS spectra were acquired for the top-seven most abundant precursor ions with an MS/MS AGC target of 1e5, a maximum MS/MS injection time of 100 ms, and a normalized collision energy of 15, 30, 40. High resolution mass spectrometry data were processed with MS-DIAL version 4.70 in lipidomics mode (<a href=\"#c86\">86</a>). MS1, and MS2 tolerances were set to 0.01 and 0.025 Da respectively. Minimum peak height was set to 30,000 to decrease the number of false positive hits. Peaks were aligned on a quality control (QC) reference file with RT tolerance of 0.1 min and mass tolerance of 0.015 Da. Default lipid library was used (Msp20210527163602_converted.lbm2), solvent type was set to HCOONH4 to match the solvent used for separation, and the identification score cut off was set to 80%. All lipid classes were made available for the search. After lipid identification was completed, MS-DIAL results were exported into Excel and cleaned using minimum RSD for QC samples set to 20% and minimum ratio of QC to Blank set to 10. For species identified in both PexRAP-depleted (<em>Dhrs7b</em> Δ/Δ) B cells and controls, mean levels (areas under peak curves) and their variance were analyzed in Excel.</p><h2 id=\"s4g\" class=\"heading-2\">Metabolic flus analyses</h2><p>Oxygen Consumption Rate (OCR) were measured using Seahorse XF96 extracellular flux analyzer (Agilent Technology, Santa Clara, CA) as described previously (<a href=\"#c30\">30</a>). Briefly, in vitro activated B cells were washed twice, resuspended in XF Base Media (Agilent Technologies) supplemented with 2 mM L-glutamine, and equal numbers of B cells (2 × 10<sup>5</sup>) were plated on extracellular flux assay plates (Agilent Technologies) coated with 2.5 µg/mL CellTak (Corning) according to the manufacturer’s protocol. Before extracellular flux analysis, B cells were rested (25 minutes at 37°C, atmospheric CO2) in XF Base Media. OCR and ECAR were measured before and after the sequential addition of 1.5 µM oligomycin, 0.5 µM FCCP and 0.5 µM rotenone/antimycin A.</p></section><section id=\"supplemental-information\"><h1 id=\"\" class=\"heading-1\">Supplemental information</h1><h2 id=\"\" class=\"heading-2\">Supplemental Figures</h2><div class=\"figure-container\"><figure class=\"figure\" id=\"figs1\"><label class=\"figure__label\">Supplemental Figure 1.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/104580%2Fv1%2Fcontent%2F618760v3_figs1.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/104580%2Fv1%2Fcontent%2F618760v3_figs1.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">PexRAP is dispensable for T cell homeostasis and does not affect balance among pre-immune B cell subsets.</h4><p>Mice (<em>Rosa26</em>-CreER<sup>T2</sup>; <em>Dhrs7b<sup>+/+</sup>, or Rosa26</em>-CreER<sup>T2</sup>; <em>Dhrs7b</em><sup>f/f</sup>) were treated with tamoxifen and immunized with SRBC as described in <em>Materials and Methods,</em> and 1 wk after immunization. (A-C) PexRAP is dispensable for homeostatic maintenance of T cells. Shown are the representative flow plots of splenic T cells (A), mean (± SEM) frequencies of TCRβ<sup>+</sup> CD4<sup>+</sup> T cells (B), and CD8 (TCRβ<sup>+</sup> CD4<sup>-)</sup> T cells (C) from WT and cKO mice in three replicate experiments totaling 8 WT and 7 cKO mice. (D) A representative gating scheme illustrating the flow-cytometric determination of the GC B cell population in mice. (E) Numbers of GC identified by microscopy of immunofluorescently stained sections of immunized mice as in <a href=\"#fig1\">Fig. 1</a>. (F) A representative gating scheme illustrating the flow-cytometric estimation of the MZ, FO, and B1 B cell populations in mice. (G) Shown are the mean (±SEM) frequencies of CD19<sup>+</sup> IgM<sup>+</sup> CD23<sup>-</sup> MZB cells (left panel) and CD19<sup>+</sup> IgM<sup>-</sup>CD23<sup>+</sup> FOB cells (righthand panel) in spleen, and (H) CD19<sup>+</sup> CD23<sup>lo</sup> CD43<sup>+</sup> CD5<sup>+</sup> B1B cells in peritoneal cavity. (I) In vivo generation of IgD<sup>-</sup> progeny from four independent replicate experiments (n =8 WT and 9 cKO). Shown are mean (±SEM) frequencies of IgD<sup>-</sup> B cells as aggregate data for the frequencies of IgD-events in the gate for viable B cells recovered from µMT recipient mice after transfer of WT or PexRAP-depleted B cells (experiments of <a href=\"#fig2\">Fig. 2D</a>-F), as indicated, with representative flow plots in <a href=\"#fig2\">Fig. 2E</a>.</p></figcaption></figure></div><div class=\"figure-container\"><figure class=\"figure\" id=\"figs2\"><label class=\"figure__label\">Supplemental Figure 2.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/104580%2Fv1%2Fcontent%2F618760v3_figs2.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/104580%2Fv1%2Fcontent%2F618760v3_figs2.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Activation of B cells induces PexRAP-dependent increases in their ether and plasmalogen P-lipids.</h4><p>As in <a href=\"#fig3\">Fig. 3</a>, B lymphocytes of the indicated <em>Dhrs7b</em> genotypes were prepared from individual tamoxifen-injected mice and divided to analyze without activation (“naive”) or after activation and culture (48 h) (“activated”). Shown are heat maps with more extensive lists of ether phospholipids and plasmalogens identified in the LC-MS-MS analyses for both genotypes in positive (A) and negative (B) ion modes. (C, D) LC-MS-MS results for lipids in B cells, activated or not, as indicated, of conventional non-transgenic B6 mice not injected with tamoxifen and those of tamoxifen-injected CreER<sup>T2+</sup> mice (the “+/+“ samples of panels A, B and of <a href=\"#fig3\">Figure 3</a>). Bar graphs in (C) and (D) show results of these control comparisons for some of the phospholipids analyzed in prior figures panels (<a href=\"#fig3\">Fig. 3A, B</a>).</p></figcaption></figure></div><div class=\"figure-container\"><figure class=\"figure\" id=\"figs3\"><label class=\"figure__label\">Supplemental Figure 3.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/104580%2Fv1%2Fcontent%2F618760v3_figs3.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/104580%2Fv1%2Fcontent%2F618760v3_figs3.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Immunization induces increases in P-lipids of both primary and secondary follicles dependent on PexRAP in B cells.</h4><p>(A, B) Selected representative <em>m/z</em> features Spleens of AID-GFP were harvested at 7 days after immunization with SRBC and analyzed for exact mass signatures of ether lipid species in (A) negative and (B) positive ion modes. (C) Spleens of immunized mice (tamoxifen-treated <em>hCD20</em>-CreER<sup>T2</sup>; <em>Dhrs7b<sup>f/f</sup></em> and <em>hCD20</em>-CreER<sup>T2</sup> controls) were analyzed by IMS. Shown are the positive ions presented in (B) for GC vs follicles of immunized AID-GFP mice. The bar graph shows the mean (± SEM) ion intensities in lymphoid follicles and GC from WT and <em>Dhrs7b</em><sup>Δ/Δ-B</sup> spleens. Median intensity of each ion was obtained from three follicles per spleen and three GC per spleen from WT and <em>Dhrs7b</em><sup>Δ/Δ-<em>B</em></sup> mice (three biological replication experiments totaling seven WT and six cKO subjects). P values were calculated by Mann-Whitney U test.</p></figcaption></figure></div><div class=\"figure-container\"><figure class=\"figure\" id=\"figs4\"><label class=\"figure__label\">Supplemental Figure 4.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/104580%2Fv1%2Fcontent%2F618760v3_figs4.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/104580%2Fv1%2Fcontent%2F618760v3_figs4.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">A subset of ether phospholipids in primary follicles and GC (secondary follicles) depend on PexRAP in B cells.</h4><p>(A) As in <a href=\"#fig4\">Fig. 4</a>, <em>Dhrs7b</em> was inactivated by tamoxifen injections into mice bearing the hCD20-CreER<sup>T2</sup> transgene, followed by immunization with SRBC and analysis. Shown are representative higher-magnification images defining the primary (IgD<sup>+</sup>) and secondary (IgD<sup>lo/neg</sup>, GL7<sup>+</sup>) follicles and the identification of light (CD35<sup>+</sup>) and dark (CD35<sup>neg</sup>) zones. (B) The sizes of GC and their light zones (LZ) after immunization were quantified. Spleens of immunized mice (tamoxifen-treated <em>hCD20</em>-CreER<sup>T2</sup>; <em>Dhrs7b<sup>f/f</sup></em>and <em>hCD20</em>-CreER<sup>T2</sup> controls, as indicated) were analyzed by immunofluorescence staining as in (A). Each dot represents one follicle in a given mouse. Totals of three GC per spleen from immunized mice were used were used, with seven WT and five <em>Dhrs7b</em><sup>Δ/Δ-<em>B</em></sup>. (C, D) Mean (±SEM) absorbances of ELISA performed across the indicated dilutions of sera from the tamoxifen-treated mice (<em>hCD20</em>-CreER<sup>T2</sup>; <em>Dhrs7b<sup>+/+</sup></em>or <em>hCD20</em>-CreER<sup>T2</sup>; <em>Dhrs7b<sup>f/f</sup></em>, i.e., <em>Dhrs7b</em><sup>Δ/Δ-<em>B</em></sup>) of <a href=\"#fig6\">Fig. 6</a>. Shown are the results for (C) all- (NP20 captured) and (D) high- (NP2 captured) -affinity anti-NP Ab of the IgG1 and IgG2c isotypes, as indicated. (E) Proliferation and development of CD138<sup>+</sup> progeny. Shown are representative flow plots from three independent experiments with six WT and seven <em>Dhrs7b</em><sup>Δ/Δ-<em>B</em></sup> mice.</p></figcaption></figure></div><div class=\"figure-container\"><figure class=\"figure\" id=\"figs5\"><label class=\"figure__label\">Supplemental Figure 5.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/104580%2Fv1%2Fcontent%2F618760v3_figs5.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/104580%2Fv1%2Fcontent%2F618760v3_figs5.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Distinct outcomes of heightened ROS elicited by H2O2 versus menadione.</h4><p>(A-B) Induction of ROS independent from B cell activation. Shown are representative flow plots of DCFDA in the viable B cell gate after exposure (1 h) (A) to H2O2 (200 μM) or (B) menadione (8 μM), as in (<a href=\"#c87\">87</a>). (C-D) Representative flow plots of annexin V vs 7-AAD for identification of early-apoptotic B cells. Cultured B cells were analyzed 3 hr after treatment with (C) 200 μM H2O2 or (D) 8 μM menadione. Inset numbers represent the fraction of B cells that are Annexin V<sup>+</sup> 7-AAD<sup>neg</sup> or Annexin V<sup>neg</sup> 7-AAD<sup>+</sup>. (E-G) Shown are the results of three independent experiments to measure (E) total cell viability, (F) BODIPY C11 MFI and (G) frequencies of Annexin V<sup>+</sup> 7-AAD<sup>neg</sup> frequency in B cells treated (8 μM) menadione overnight (E) or for 3 h (D). P-values were calculated using the unpaired Student’s t-test.</p></figcaption></figure></div><p><strong>Supplemental Table 1. Immunization-induced increases of selected ether lipids in GC.</strong> Shown are (a) a sample of <em>m/z</em> features characteristic of the indicated phospholipid species identified by the LIPIDMAPS database, and (b) the mean ±SEM ion intensity / counts in IMS data generated from spleens of AID-GFP mice, immunized or not (UI), after mapping to the indicated regions of interest (primary follicles or GC, i.e. secondary follicles) using fluorescent images. Shown are ions more accumulated in GC regions compared to primary follicles (8 ions from negative ion mode, and 5 ions from positive ion mode, all p&lt;0.05 for comparison of 1<sup>0</sup> follicle to UI (c), or GC to 1<sup>0</sup> follicle (d). P values were calculated by Mann-Whitney U test.</p><p><strong>Supplemental Table 2. Impact of PexRAP on relative quantities of selected lipid species in primary and secondary follicles (GC).</strong> As in <a href=\"#tbl1\">Table 1</a> except that B cells of immunized mice were either WT or lacked PexRAP (cKO, i.e., <em>Dhrs7b</em><sup>Δ/Δ-B</sup>). Shown are (a) a sample of <em>m/z</em> features characteristic of the indicated phospholipid species. (b) the mean ±SEM ion intensity counts in IMS data after mapping to the indicated regions of interest as in <a href=\"#tbl1\">Table 1</a>. (c-f) indicate that p&lt;0.05 for the null hypothesis in considering a difference between WT mouse spleens after immunization versus UI controls (c), 1<sup>0</sup> B cell follicles in spleens of immunized WT vs <em>Dhrs7b</em><sup>Δ/Δ-B</sup> mice (d), GC vs in 1<sup>0</sup> B cell follicles in spleens of immunized WT mice (e), and GC of immunized WT vs <em>Dhrs7b</em><sup>Δ/Δ-B</sup> mice (f) in the ions counts for designated <em>m/z</em> features. P values were calculated by Mann-Whitney U test.</p></section><section id=\"acknowledgements\"><h1 class=\"heading-1\">Acknowledgements</h1><p>The experimental work was funded by NIH Grants to VUMC [R01 AI113292 (M.R.B), R01 HL106812 (M.R.B.), followed by R21 AI164760 (M.R.B.) and departmental funds]. Mass spectrometry imaging was supported in part by NIH grant P41 GM103391 to Vanderbilt University (R.M.C.). Additional support for M. A. J. was provided by the National Science Foundation, NSF DGE-1445197. NIH Shared Instrumentation Grant 1S10OD018015 as well as scholarships via the Cancer Center Support Grant (CA068485) and Diabetes Research Center (DK0205930) helped defray costs of Vanderbilt Cores. We thank J. Cyster for generously expediting shipment of <em>S1pr2</em>-CreERT2 breeding stock, and Vanderbilt institutional cores (High-Throughput Screening; Flow Cytometry Shared Resource; Mass Spectrometry Shared Resource; Cell &amp; Developmental Biology) for equipment, expertise, and assistance.</p></section>"
}
