{
  "id": "104779",
  "doi": "10.31219/osf.io/4yh36",
  "version": 1,
  "status": "reviewed",
  "authorLine": "Marie-Alphée Laurent, Corentin Jacques ... Bruno Rossion",
  "title": "A tight relationship between BOLD fMRI activation/deactivation and increase/decrease in single neuron responses in human association cortex",
  "published": "2025-02-03T14:00:00Z",
  "reviewedDate": "2025-02-03T14:00:00Z",
  "versionDate": "2025-02-03T14:00:00Z",
  "statusDate": "2025-02-03T14:00:00Z",
  "stage": "published",
  "subjects": [
    {
      "id": "neuroscience",
      "name": "Neuroscience"
    }
  ],
  "elifeAssessment": {
    "title": "eLife Assessment",
    "content": [
      {
        "type": "paragraph",
        "text": "This valuable short paper is an ingenious use of clinical patient data to address an issue in imaging neuroscience. The authors clarify the role of face-selectivity in human fusiform gyrus by measuring both BOLD fMRI and depth electrode recordings in the same individuals; furthermore, by comparing responses in different brain regions in the two patients, they suggested that the suppression of blood oxygenation is associated with a decrease in local neural activity. While the methods are compelling and provide a rare dataset of potentially general importance, the presentation of the data in its current form is incomplete."
      }
    ],
    "id": "sa4",
    "doi": "10.7554/eLife.104779.1.sa4",
    "significance": [
      "valuable"
    ],
    "strength": [
      "compelling",
      "incomplete"
    ]
  },
  "indexContent": "<p><strong>eLife Assessment</strong></p>\n<p>This valuable short paper is an ingenious use of clinical patient data to address an issue in imaging neuroscience. The authors clarify the role of face-selectivity in human fusiform gyrus by measuring both BOLD fMRI and depth electrode recordings in the same individuals; furthermore, by comparing responses in different brain regions in the two patients, they suggested that the suppression of blood oxygenation is associated with a decrease in local neural activity. While the methods are compelling and provide a rare dataset of potentially general importance, the presentation of the data in its current form is incomplete.</p>\n\n    <p><strong>Reviewer #1 (Public review):</strong></p>\n<p>Summary:</p>\n<p>Measurement of BOLD MR imaging has regularly found regions of the brain that show reliable suppression of BOLD responses during specific experimental testing conditions. These observations are to some degree unexplained, in comparison with more usual association between activation of the BOLD response and excitatory activation of the neurons (most tightly linked to synaptic activity) in the same brain location. This paper finds two patients whose brains were tested with both non-invasive functional MRI and with invasive insertion of electrodes, which allowed the direct recording of neuronal activity. The electrode insertions were made within the fusiform gyrus, which is known to process information about faces, in a clinical search for the sites of intractable epilepsy in each patient. The simple observation is that the electrode location in one patient showed activation of the BOLD response and activation of neuronal firing in response to face stimuli. This is the classical association. The other patient showed an informative and different pattern of responses. In this person, the electrode location showed a suppression of the BOLD response to face stimuli and, most interestingly, an associated suppression of neuronal activity at the electrode site.</p>\n<p>Strengths:</p>\n<p>Whilst these results are not by themselves definitive, they add an important piece of evidence to a long-standing discussion about the origins of the BOLD response. The observation of decreased neuronal activation associated with negative BOLD is interesting because, at various times, exactly the opposite association has been predicted. It has been previously argued that if synaptic mechanisms of neuronal inhibition are responsible for the suppression of neuronal firing, then it would be reasonable</p>\n<p>Weaknesses:</p>\n<p>The chief weakness of the paper is that the results may be unique in a slightly awkward way. The observation of positive BOLD and neuronal activation is made at one brain site in one patient, while the complementary observation of negative BOLD and neuronal suppression actually derives from the other patient. Showing both effects in both patients would make a much stronger paper.</p>\n,<p><strong>Reviewer #2 (Public review):</strong></p>\n<p>Summary:</p>\n<p>This is a short and straightforward paper describing BOLD fMRI and depth electrode measurements from two regions of the fusiform gyrus that show either higher or lower BOLD responses to faces vs. objects (which I will call face-positive and face-negative regions). In these regions, which were studied separately in two patients undergoing epilepsy surgery, spiking activity increased for faces relative to objects in the face-positive region and decreased for faces relative to objects in the face-negative region. Interestingly, about 30% of neurons in the face-negative region did not respond to objects and decreased their responses below baseline in response to faces (absolute suppression).</p>\n<p>Strengths:</p>\n<p>These patient data are valuable, with many recording sessions and neurons from human face-selective regions, and the methods used for comparing face and object responses in both fMRI and electrode recordings were robust and well-established. The finding of absolute suppression could clarify the nature of face selectivity in human fusiform gyrus since previous fMRI studies of the face-negative region could not distinguish whether face &lt; object responses came from absolute suppression, or just relatively lower but still positive responses to faces vs. objects.</p>\n<p>Weaknesses:</p>\n<p>The authors claim that the results tell us about both 1) face-selectivity in the fusiform gyrus, and 2) the physiological basis of the BOLD signal. However, I would like to see more of the data that supports the first claim, and I am not sure the second claim is supported.</p>\n<p>(1) The authors report that ~30% of neurons showed absolute suppression, but those data are not shown separately from the neurons that only show relative reductions. It is difficult to evaluate the absolute suppression claim from the short assertion in the text alone (lines 105-106), although this is a critical claim in the paper.<br />\n(2) I am not sure how much light the results shed on the physiological basis of the BOLD signal. The authors write that the results reveal \"that BOLD decreases can be due to relative, but also absolute, spike suppression in the human brain\" (line 120). But I think to make this claim, you would need a region that exclusively had neurons showing absolute suppression, not a region with a mix of neurons, some showing absolute suppression and some showing relative suppression, as here. The responses of both groups of neurons contribute to the measured BOLD signal, so it seems impossible to tell from these data how absolute suppression per se drives the BOLD response.</p>\n,<p><strong>Reviewer #3 (Public review):</strong></p>\n<p>Summary:</p>\n<p>In this paper the authors conduct two experiments an fMRI experiment and intracranial recordings of neurons in two patients P1 and P2. In both experiments, they employ a SSVEP paradigm in which they show images at a fast rate (e.g. 6Hz) and then they show face images at a slower rate (e.g. 1.2Hz), where the rest of the images are a variety of object images. In the first patient, they record from neurons over a region in the mid fusiform gyrus that is face-selective and in the second patient, they record neurons from a region more medially that is not face selective (it responds more strongly to objects than faces). Results find similar selectivity between the electrophysiology data and the fMRI data in that the location which shows higher fMRI to faces also finds face-selective neurons and the location which finds preference to non faces also shows non face preferring neurons.</p>\n<p>Strengths:</p>\n<p>The data is important in that it shows that there is a relationship between category selectivity measured from electrophysiology data and category-selective from fMRI. The data is unique as it contains a lot of single and multiunit recordings (245 units) from the human fusiform gyrus - which the authors point out - is a humanoid specific gyrus.</p>\n<p>Weaknesses:</p>\n<p>My major concerns are two-fold:<br />\n(i) There is a paucity of data; Thus, more information (results and methods) is warranted; and in particular there is no comparison between the fMRI data and the SEEG data.</p>\n<p>(ii) One main claim of the paper is that there is evidence for suppressed responses to faces in the non-face selective region. That is, the reduction in activation to faces in the non-face selective region is interpreted as a suppression in the neural response and consequently the reduction in fMRI signal is interpreted as suppression. However, the SSVEP paradigm has no baseline (it alternates between faces and objects) and therefore it cannot distinguish between lower firing rate to faces vs suppression of response to faces.</p>\n<p>(1) Additional data: the paper has 2 figures: figure 1 which shows the experimental design and figure 2 which presents data, the latter shows one example neuron raster plot from each patient and group average neural data from each patient. In this reader's opinion this is insufficient data to support the conclusions of the paper. The paper will be more impactful if the researchers would report the data more comprehensively.</p>\n<p>(a) There is no direct comparison between the fMRI data and the SEEG data, except for a comparison of the location of the electrodes relative to the statistical parametric map generated from a contrast (Fig 2a,d). It will be helpful to build a model linking between the neural responses to the voxel response in the same location - i.e., estimate from the electrophysiology data the fMRI data (e.g. Logothetis &amp; Wandell, 2004)</p>\n<p>(b) More comprehensive analyses of the SSVEP neural data: It will be helpful to show the results of the frequency analyses of the SSVEP data for all neurons to show that there are significant visual responses and significant face responses. It will be also useful to compare and quantify the magnitude of the face responses compared to the visual responses.</p>\n<p>(c) The neuron shown in E shows cyclical responses tied to the onset of the stimuli, is this the visual response? If so, why is there an increase in the firing rate of the neuron before the face stimulus is shown in time 0? The neuron's data seems different than the average response across neurons; This raises a concern about interpreting the average response across neurons in panel F which seems different than the single neuron responses</p>\n<p>(d) Related to (c) it would be useful to show raster plots of all neurons and quantify if the neural responses within a region are homogeneous or heterogeneous. This would add data relating the single neuron response to the population responses measured from fMRI. See also Nir 2009.</p>\n<p>(e) When reporting group average data (e.g., Fig 2C,F) it is necessary to show standard deviation of the response across neurons.</p>\n<p>(f) Is it possible to estimate the latency of the neural responses to face and object images from the phase data? If so, this will add important information on the timing of neural responses in the human fusiform gyrus to face and object images.</p>\n<p>(g) Related to (e) In total the authors recorded data from 245 units (some single units and some multiunits) and they found that both in the face and nonface selective most of the recoded neurons exhibited face -selectivity, which this reader found confusing: They write \" Among all visually responsive neurons, we 87 found a very high proportion of face-selective neurons (p &lt; 0.05) in both activated 88 and deactivated MidFG regions (P1: 98.1%; N = 51/52; P2: 86.6%; N = 110/127)'. Is the face selectivity in P1 an increase in response to faces and P2 a reduction in response to faces or in both it's an increase in response to faces</p>\n<p>(1) Additional methods<br />\n(a) it is unclear if the SSVEP analyses of neural responses were done on the spikes or the raw electrical signal. If the former, how is the SSVEP frequency analysis done on discrete data like action potentials?<br />\n(b) it is unclear why the onset time was shifted by 33ms; one can measure the phase of the response relative to the cycle onset and use that to estimate the delay between the onset of a stimulus and the onset of the response. Adding phase information will be useful.</p>\n<p>(2) Interpretation of suppression:</p>\n<p>The SSVEP paradigm alternates between 2 conditions: faces and objects and has no baseline; In other words, responses to faces are measured relative to the baseline response to objects so that any region that contains neurons that have a lower firing rate to faces than objects is bound to show a lower response in the SSVEP signal. Therefore, because the experiment does not have a true baseline (e.g. blank screen, with no visual stimulation) this experimental design cannot distinguish between lower firing rate to faces vs suppression of response to faces.<br />\nThe strongest evidence put forward for suppression is the response of non-visual neurons that was also reduced when patients looked at faces, but since these are non-visual neurons, it is unclear how to interpret the responses to faces.</p>\n\n    <p><strong>Author response:</strong></p>\n<blockquote>\n<p><strong>eLife Assessment</strong></p>\n<p>This valuable short paper is an ingenious use of clinical patient data to address an issue in imaging neuroscience. The authors clarify the role of face-selectivity in human fusiform gyrus by measuring both BOLD fMRI and depth electrode recordings in the same individuals; furthermore, by comparing responses in different brain regions in the two patients, they suggested that the suppression of blood oxygenation is associated with a decrease in local neural activity. While the methods are compelling and provide a rare dataset of potentially general importance, the presentation of the data in its current form is incomplete.</p>\n</blockquote>\n<p>We thank the Reviewing editor and Senior editor at eLife for their positive assessment of our paper. After reading the reviewers’ comments – to which we reply below - we agree that the presentation of the data could be completed. We provide additional presentation of data in the responses below and we will slightly modify Figure 2 of the paper. However, in keeping the short format of the paper, the revised version will have the same number of figures, which support the claims made in the paper.</p>\n<blockquote>\n<p><strong>Reviewer #1 (Public review):</strong></p>\n<p>Summary:</p>\n<p>Measurement of BOLD MR imaging has regularly found regions of the brain that show reliable suppression of BOLD responses during specific experimental testing conditions. These observations are to some degree unexplained, in comparison with more usual association between activation of the BOLD response and excitatory activation of the neurons (most tightly linked to synaptic activity) in the same brain location. This paper finds two patients whose brains were tested with both non-invasive functional MRI and with invasive insertion of electrodes, which allowed the direct recording of neuronal activity. The electrode insertions were made within the fusiform gyrus, which is known to process information about faces, in a clinical search for the sites of intractable epilepsy in each patient. The simple observation is that the electrode location in one patient showed activation of the BOLD response and activation of neuronal firing in response to face stimuli. This is the classical association. The other patient showed an informative and different pattern of responses. In this person, the electrode location showed a suppression of the BOLD response to face stimuli and, most interestingly, an associated suppression of neuronal activity at the electrode site.</p>\n<p>Strengths:</p>\n<p>Whilst these results are not by themselves definitive, they add an important piece of evidence to a long-standing discussion about the origins of the BOLD response. The observation of decreased neuronal activation associated with negative BOLD is interesting because, at various times, exactly the opposite association has been predicted. It has been previously argued that if synaptic mechanisms of neuronal inhibition are responsible for the suppression of neuronal firing, then it would be reasonable</p>\n<p>Weaknesses:</p>\n<p>The chief weakness of the paper is that the results may be unique in a slightly awkward way. The observation of positive BOLD and neuronal activation is made at one brain site in one patient, while the complementary observation of negative BOLD and neuronal suppression actually derives from the other patient. Showing both effects in both patients would make a much stronger paper.</p>\n</blockquote>\n<p>We thank reviewer #1 for their positive evaluation of our paper. Obviously, we agree with the reviewer that the paper would be much stronger if BOTH effects – spike increase and decrease – would be found in BOTH patients in their corresponding fMRI regions (lateral and medial fusiform gyrus) (also in the same hemisphere). Nevertheless, we clearly acknowledge this limitation in the (revised) version of the manuscript (p.8: Material and Methods section).</p>\n<p>In the current paper, one could think that P1 shows only increases to faces, and P2 would show only decreases (irrespective of the region). However, that is not the case since 11% of P1’s face-selective units are decreases (89% are increases) and 4% of P2’s face-selective units are increases. This has now been made clearer in the manuscript (p.5).</p>\n<p>As the reviewer is certainly aware, the number and position of the electrodes are based on strict clinical criteria, and we will probably never encounter a situation with two neighboring (macro-micro hybrid electrodes), one with microelectrodes ending up in the lateral MidFG, the other in the medial MidFG, in the same patient. If there is no clinical value for the patient, this cannot be done.</p>\n<p>The only thing we can do is to strengthen these results in the future by collecting data on additional patients with an electrode either in the lateral or the medial FG, together with fMRI. But these are the only two patients we have been able to record so far with electrodes falling unambiguously in such contrasted regions and with large (and comparable) measures.</p>\n<p>While we acknowledge that the results may be unique because of the use of 2 contrasted patients only (and this is why the paper is a short report), the data is compelling in these 2 cases, and we are confident that it will be replicated in larger cohorts in the future.</p>\n<blockquote>\n<p><strong>Reviewer #2 (Public review):</strong></p>\n<p>Summary:</p>\n<p>This is a short and straightforward paper describing BOLD fMRI and depth electrode measurements from two regions of the fusiform gyrus that show either higher or lower BOLD responses to faces vs. objects (which I will call face-positive and facenegative regions). In these regions, which were studied separately in two patients undergoing epilepsy surgery, spiking activity increased for faces relative to objects in the face-positive region and decreased for faces relative to objects in the face-negative region. Interestingly, about 30% of neurons in the face-negative region did not respond to objects and decreased their responses below baseline in response to faces (absolute suppression).</p>\n<p>Strengths:</p>\n<p>These patient data are valuable, with many recording sessions and neurons from human face-selective regions, and the methods used for comparing face and object responses in both fMRI and electrode recordings were robust and well-established. The finding of absolute suppression could clarify the nature of face selectivity in human fusiform gyrus since previous fMRI studies of the face-negative region could not distinguish whether face &lt; object responses came from absolute suppression, or just relatively lower but still positive responses to faces vs. objects.</p>\n<p>Weaknesses:</p>\n<p>The authors claim that the results tell us about both 1) face-selectivity in the fusiform gyrus, and 2) the physiological basis of the BOLD signal. However, I would like to see more of the data that supports the first claim, and I am not sure the second claim is supported.</p>\n<p>(1) The authors report that ~30% of neurons showed absolute suppression, but those data are not shown separately from the neurons that only show relative reductions. It is difficult to evaluate the absolute suppression claim from the short assertion in the text alone (lines 105-106), although this is a critical claim in the paper.</p>\n</blockquote>\n<p>We thank reviewer #2 for their positive evaluation of our paper. We understand the reviewer’s point, and we partly agree. Where we respectfully disagree is that the finding of absolute suppression is critical for the claim of the paper: finding an identical contrast between the two regions in terms of RELATIVE increase/decrease of face-selective activity in fMRI and spiking activity is already novel and informative. Where we agree with the reviewer is that the absolute suppression could be more documented: it wasn’t, due to space constraints (brief report). We provide below an example of a neuron showing absolute suppression to faces. In the frequency domain, there is only a face-selective response (1.2 Hz and harmonics) but no significant response at 6 Hz (common general visual response). In the time-domain, relative to face onset, the response drops below baseline level. It means that this neuron has baseline (non-periodic) spontaneous spiking activity that is actively suppressed when a face appears.</p>\n<p><strong>Author response image 1.</strong></p>\n<p><a href=\"https://imgur.com/kQmlrR8\"><img src=\"https://i.imgur.com/kQmlrR8.jpg\" title=\"source: imgur.com\" /></a></p>\n<blockquote>\n<p>(2) I am not sure how much light the results shed on the physiological basis of the BOLD signal. The authors write that the results reveal \"that BOLD decreases can be due to relative, but also absolute, spike suppression in the human brain\" (line 120). But I think to make this claim, you would need a region that exclusively had neurons showing absolute suppression, not a region with a mix of neurons, some showing absolute suppression and some showing relative suppression, as here. The responses of both groups of neurons contribute to the measured BOLD signal, so it seems impossible to tell from these data how absolute suppression per se drives the BOLD response.</p>\n</blockquote>\n<p>It is a fact that we find both kinds of responses in the same region.  We cannot tell with this technique if neurons showing relative <em>vs.</em> absolute suppression of responses are spatially segregated for instance (e.g., forming two separate sub-regions) or are intermingled. And we cannot tell from our data how absolute suppression <em>per se</em> drives the BOLD response. In our view, this does not diminish the interest and originality of the study, but the statement \"that BOLD decreases can be due to relative, but also absolute, spike suppression in the human brain” will be rephrased in the revised manuscript, in the following way: \"that BOLD decreases can be due to relative, or absolute (or a combination of both), spike suppression in the human brain”.</p>\n<blockquote>\n<p><strong>Reviewer #3 (Public review):</strong></p>\n<p>In this paper the authors conduct two experiments an fMRI experiment and intracranial recordings of neurons in two patients P1 and P2. In both experiments, they employ a SSVEP paradigm in which they show images at a fast rate (e.g. 6Hz) and then they show face images at a slower rate (e.g. 1.2Hz), where the rest of the images are a variety of object images. In the first patient, they record from neurons over a region in the mid fusiform gyrus that is face-selective and in the second patient, they record neurons from a region more medially that is not face selective (it responds more strongly to objects than faces). Results find similar selectivity between the electrophysiology data and the fMRI data in that the location which shows higher fMRI to faces also finds face-selective neurons and the location which finds preference to non faces also shows non face preferring neurons.</p>\n<p>Strengths:</p>\n<p>The data is important in that it shows that there is a relationship between category selectivity measured from electrophysiology data and category-selective from fMRI. The data is unique as it contains a lot of single and multiunit recordings (245 units) from the human fusiform gyrus - which the authors point out - is a humanoid specific gyrus.</p>\n<p>Weaknesses:</p>\n<p>My major concerns are two-fold:</p>\n<p>(i) There is a paucity of data; Thus, more information (results and methods) is warranted; and in particular there is no comparison between the fMRI data and the SEEG data.</p>\n</blockquote>\n<p>We thank reviewer #3 for their positive evaluation of our paper. If the reviewer means paucity of data <em>presentation</em>, we agree and we provide more presentation below, although the methods and results information appear as complete to us. The comparison between fMRI and SEEG is there, but can only be indirect (i.e., collected at different times and not related on a trial-by-trial basis for instance). In addition, our manuscript aims at providing a short empirical contribution to further our understanding of the relationship between neural responses and BOLD signal, not to provide a model of neurovascular coupling.</p>\n<blockquote>\n<p>(ii) One main claim of the paper is that there is evidence for suppressed responses to faces in the non-face selective region. That is, the reduction in activation to faces in the non-face selective region is interpreted as a suppression in the neural response and consequently the reduction in fMRI signal is interpreted as suppression. However, the SSVEP paradigm has no baseline (it alternates between faces and objects) and therefore it cannot distinguish between lower firing rate to faces vs suppression of response to faces.</p>\n</blockquote>\n<p>We understand the concern of the reviewer, but we respectfully disagree that our paradigm cannot distinguish between lower firing rate to faces <em>vs.</em> suppression of response to faces. Indeed, since the stimuli are presented periodically (6 Hz), we can objectively distinguish stimulus-related activity from spontaneous neuronal firing. The baseline corresponds to spikes that are non-periodic, i.e., unrelated to the (common face and object) stimulation. For a subset of neurons, even this non-periodic baseline activity is suppressed, above and beyond the suppression of the 6 Hz response illustrated on Figure 2. We mention it in the manuscript, but we agree that we do not present illustrations of such decrease in the time-domain for SU, which we did not consider as being necessary initially (please see below for such presentation).</p>\n<blockquote>\n<p>(1) Additional data: the paper has 2 figures: figure 1 which shows the experimental design and figure 2 which presents data, the latter shows one example neuron raster plot from each patient and group average neural data from each patient. In this reader's opinion this is insufficient data to support the conclusions of the paper. The paper will be more impactful if the researchers would report the data more comprehensively.</p>\n</blockquote>\n<p>We answer to more specific requests for additional evidence below, but the reviewer should be aware that this is a short report, which reaches the word limit. In our view, the group average neural data should be sufficient to support the conclusions, and the example neurons are there for illustration. And while we cannot provide the raster plots for a large number of neurons, the anonymized data will be made available upon publication of the final version of the paper.</p>\n<blockquote>\n<p>(a) There is no direct comparison between the fMRI data and the SEEG data, except for a comparison of the location of the electrodes relative to the statistical parametric map generated from a contrast (Fig 2a,d). It will be helpful to build a model linking between the neural responses to the voxel response in the same location - i.e., estimate from the electrophysiology data the fMRI data (e.g., Logothetis &amp; Wandell, 2004).</p>\n</blockquote>\n<p>As mentioned above the comparison between fMRI and SEEG is indirect (i.e., collected at different times and not related on a trial-by-trial basis for instance) and would not allow to make such a model.</p>\n<blockquote>\n<p>(b) More comprehensive analyses of the SSVEP neural data: It will be helpful to show the results of the frequency analyses of the SSVEP data for all neurons to show that there are significant visual responses and significant face responses. It will be also useful to compare and quantify the magnitude of the face responses compared to the visual responses.</p>\n</blockquote>\n<p>The data has been analyzed comprehensively, but we would not be able to show all neurons with such significant visual responses and face-selective responses.</p>\n<blockquote>\n<p>(c) The neuron shown in E shows cyclical responses tied to the onset of the stimuli, is this the visual response?</p>\n</blockquote>\n<p>Correct, it’s the visual response at 6 Hz.</p>\n<blockquote>\n<p>If so, why is there an increase in the firing rate of the neuron before the face stimulus is shown in time 0?</p>\n</blockquote>\n<p>Because the stimulation is continuous. What is displayed at 0 is the onset of the face stimulus, with each face stimulus being preceded by 4 images of nonface objects.</p>\n<blockquote>\n<p>The neuron's data seems different than the average response across neurons; This raises a concern about interpreting the average response across neurons in panel F which seems different than the single neuron responses</p>\n</blockquote>\n<p>The reviewer is correct, and we apologize for the confusion. This is because the average data on panel F has been notch-filtered for the 6 Hz (and harmonic responses), as indicated in the methods (p.11):  ‘a FFT notch filter (filter width = 0.05 Hz) was then applied on the 70 s single or multi-units time-series to remove the general visual response at 6 Hz and two additional harmonics (i.e., 12 and 18 Hz)’.</p>\n<p>Here is the same data without the notch-filter (the 6Hz periodic response is clearly visible):</p>\n<p><strong>Author response image 2.</strong></p>\n<p><a href=\"https://imgur.com/b6bvSMq\"><img src=\"https://i.imgur.com/b6bvSMq.jpg\" title=\"source: imgur.com\" /></a></p>\n<p>For sake of clarity, we prefer presenting the notch-filtered data in the paper, but the revised version will make it clear in the figure caption that the average data has been notch-filtered.</p>\n<blockquote>\n<p>(d) Related to (c) it would be useful to show raster plots of all neurons and quantify if the neural responses within a region are homogeneous or heterogeneous. This would add data relating the single neuron response to the population responses measured from fMRI. See also Nir 2009.</p>\n</blockquote>\n<p>We agree with the reviewer that this is interesting, but again we do not think that it is necessary for the point made in the present paper. Responses in these regions appear rather heterogenous, and we are currently working on a longer paper with additional SEEG data (other patients tested for shorter sessions) to define and quantify the face-selective neurons in the MidFusiform gyrus with this approach (without relating it to the fMRI contrast as reported here).</p>\n<blockquote>\n<p>(e) When reporting group average data (e.g., Fig 2C,F) it is necessary to show standard deviation of the response across neurons.</p>\n</blockquote>\n<p>We agree with the reviewer and have modified Figure 2 accordingly in the revised manuscript.</p>\n<blockquote>\n<p>(f) Is it possible to estimate the latency of the neural responses to face and object images from the phase data? If so, this will add important information on the timing of neural responses in the human fusiform gyrus to face and object images.</p>\n</blockquote>\n<p>The fast periodic paradigm to measure neural face-selectivity has been used in tens of studies since its original reports:</p>\n<p>- in EEG: Rossion et al., 2015: <a href=\"https://doi.org/10.1167/15.1.18\">https://doi.org/10.1167/15.1.18</a></p>\n<p>- in SEEG: Jonas et al., 2016: <a href=\"https://doi.org/10.1073/pnas.1522033113\">https://doi.org/10.1073/pnas.1522033113</a></p>\n<p>In this paradigm, the face-selective response spreads to several harmonics (1.2 Hz, 2.4 Hz, 3.6 Hz, etc.) (which are summed for quantifying the total face-selective amplitude). This is illustrated below by the averaged single units’ SNR spectra across all recording sessions for both participants.</p>\n<p><strong>Author response image 3.</strong></p>\n<p><a href=\"https://imgur.com/Y3mmttR\"><img src=\"https://i.imgur.com/Y3mmttR.jpg\" title=\"source: imgur.com\" /></a></p>\n<p>There is no unique phase-value, each harmonic being associated with a phase-value, so that the timing cannot be unambiguously extracted from phase values. Instead, the onset latency is computed directly from the time-domain responses, which is more straightforward and reliable than using the phase. Note that the present paper is not about the specific time-courses of the different types of neurons, which would require a more comprehensive report, but which is not necessary to support the point made in the present paper about the SEEG-fMRI sign relationship.</p>\n<blockquote>\n<p>g) Related to (e) In total the authors recorded data from 245 units (some single units and some multiunits) and they found that both in the face and nonface selective most of the recoded neurons exhibited face -selectivity, which this reader found confusing: They write “ Among all visually responsive neurons, we found a very high proportion of face-selective neurons (p &lt; 0.05) in both activated and deactivated MidFG regions (P1: 98.1%; N = 51/52; P2: 86.6%; N = 110/127)’. Is the face selectivity in P1 an increase in response to faces and P2 a reduction in response to faces or in both it’s an increase in response to faces</p>\n</blockquote>\n<p>Face-selectivity is defined as a DIFFERENTIAL response to faces compared to objects, not necessarily a larger response to faces. So yes, face-selectivity in P1 is an increase in response to faces and P2 a reduction in response to faces.</p>\n<blockquote>\n<p>(1) Additional methods</p>\n<p>(a) it is unclear if the SSVEP analyses of neural responses were done on the spikes or the raw electrical signal. If the former, how is the SSVEP frequency analysis done on discrete data like action potentials?</p>\n</blockquote>\n<p>The FFT is applied directly on spike trains using Matlab’s discrete Fourier Transform function. This function is suitable to be applied to spike trains in the same way as to any sampled digital signal (here, the microwires signal was sampled at 30 kHz, see Methods).</p>\n<p>In complementary analyses, we also attempted to apply the FFT on spike trains that had been temporally smoothed by convolving them with a 20ms square window (Le Cam et al., 2023, cited in the paper ). This did not change the outcome of the frequency analyses in the frequency range we are interested in.</p>\n<blockquote>\n<p>(b) it is unclear why the onset time was shifted by 33ms; one can measure the phase of the response relative to the cycle onset and use that to estimate the delay between the onset of a stimulus and the onset of the response. Adding phase information will be useful.</p>\n</blockquote>\n<p>The onset time was shifted by 33ms because the stimuli are presented with a sinewave contrast modulation (i.e., at 0ms, the stimulus has 0% contrast). 100% contrast is reached at half a stimulation cycle, which is 83.33ms here, but a response is likely triggered before reaching 100% contrast. To estimate the delay between the start of the sinewave (0% contrast) and the triggering of a neural response, we tested 7 SEEG participants with the same images presented in FPVS sequences either as a sinewave contrast (black line) modulation or as a squarewave (i.e. abrupt) contrast modulation (red line).  The 33ms value is based on these LFP data obtained in response to such sinewave stimulation and squarewave stimulation of the same paradigm. This delay corresponds to 4 screen refresh frames (120 Hz refresh rate = 8.33ms by frame) and 35% of the full contrast, as illustrated below (please see also Retter, T. L., &amp; Rossion, B. (2016). Uncovering the neural magnitude and spatio-temporal dynamics of natural image categorization in a fast visual stream. Neuropsychologia, 91, 9–28).</p>\n<p><strong>Author response image 4.</strong></p>\n<p><a href=\"https://imgur.com/BzKzJwo\"><img src=\"https://i.imgur.com/BzKzJwo.jpg\" title=\"source: imgur.com\" /></a></p>\n<blockquote>\n<p>(2) Interpretation of suppression:</p>\n<p>The SSVEP paradigm alternates between 2 conditions: faces and objects and has no baseline; In other words, responses to faces are measured relative to the baseline response to objects so that any region that contains neurons that have a lower firing rate to faces than objects is bound to show a lower response in the SSVEP signal. Therefore, because the experiment does not have a true baseline (e.g. blank screen, with no visual stimulation) this experimental design cannot distinguish between lower firing rate to faces vs suppression of response to faces.</p>\n<p>The strongest evidence put forward for suppression is the response of non-visual neurons that was also reduced when patients looked at faces, but since these are non-visual neurons, it is unclear how to interpret the responses to faces.</p>\n</blockquote>\n<p>We understand this point, but how does the reviewer know that these are non-visual neurons? Because these neurons are located in the visual cortex, they are likely to be visual neurons that are not responsive to non-face objects. In any case, as the reviewer writes, we think it’s strong evidence for suppression.</p>\n<p>We thank all three reviewers for their positive evaluation of our paper and their constructive comments.</p>\n\n    Marie-Alphée Laurent, Corentin Jacques, Xiaoqian Yan, Pauline Jurczynski, Sophie Colnat-Coulbois, Louis Maillard, Steven Le Cam, Radu Ranta, Benoit R Cottereau, Laurent Koessler, Jacques Jonas, Bruno Rossion\n    <section id=\"introduction\"><h1 id=\"s1\" class=\"heading-1\">Introduction</h1><p>Functional magnetic resonance imaging (fMRI) has revolutionized our understanding of human brain function. While animal studies have characterized Blood-Oxygenation-Level-Dependent (BOLD) fMRI activation as a correlate of local synaptic activity (<a href=\"#c16\">Logothetis et al., 2001</a>; <a href=\"#c1\">Bartolo et al., 2011</a>), the cellular mechanisms of deactivation (negative BOLD signals) remain unknown. Since BOLD activity relies on contrasts between (two) conditions of interest, fMRI deactivations have been attributed to various causes, i.e., (relative) decreases in neuronal activity (<a href=\"#c26\">Shmuel et al., 2006</a>; <a href=\"#c5\">Devor et al., 2008</a>; <a href=\"#c3\">Boorman et al., 2010</a>), (relative) increases in neural activity (without concomitant compensation by cerebral blood flow (CBF) increase) (<a href=\"#c25\">Schridde et al., 2008</a>), or hemodynamic contributions (“blood stealing”; <a href=\"#c10\">Harel et al., 2002</a>). However, notwithstanding recent evidence of fMRI deactivation associated with electrocorticographic alpha power decrease in the human visual cortex (Fracasso et al., 2021), most studies have been carried out in animal models and primary sensory or motor regions. Therefore, the relationship between BOLD responses and increases or decreases in neuronal firing rate across human brain regions, especially the association cortex, remains unknown.</p><p>Here, thanks to a unique opportunity to record fMRI and spiking activity in neighboring populations of neurons of the same region of the association cortex, we shed light on the nature of the relationship between category-selective activity recorded at macroscopic and cellular scales. Specifically, two patients with refractory epilepsy (P1, P2) were implanted with hybrid macro-microelectrodes in their fusiform gyrus, a hominoid-specific cortical structure (<a href=\"#c31\">Weiner and Zilles, 2016</a>) that is critically involved in face recognition (<a href=\"#c4\">Cohen et al., 2019</a>). While microelectrodes recording single-unit activity located in the lateral portion of P1’s middle fusiform gyrus (MidFG) (i.e., in cytoarchitectonic area FG4; <a href=\"#c17\">Lorenz et al., 2017</a>), a region known to elicit larger BOLD activity to faces than non-face objects (‘Fusiform Face Area’, FFA; Kanwisher et al., 1997), in P2 they fell in the medial MidFG portion (FG3), in which lower BOLD responses to faces than objects are typically observed (<a href=\"#c20\">Pelphrey et al., 2003</a>; <a href=\"#c13\">Kanwisher, 2017</a>; <a href=\"#c7\">Gao et al., 2018</a>). By recording face-selective neural responses both in spiking activity and fMRI signals (independent sessions) in two neighboring regions of the same brains, we tested the hypothesis of a systematic relationship between the two types of signals. In particular, we hypothesized that fMRI deactivations to faces were associated with a majority of face-selective decreases in spiking activity.</p><h1 id=\"s2\" class=\"heading-1\">Results</h1><p>In both MidFG regions sampled, robust differential activity to natural images of faces <em>vs.</em> non-face categories was objectively recorded with a similar well-validated frequency-tagging paradigm in fMRI (<a href=\"#fig1\">Fig. 1A</a>) and microelectrode electrophysiological recordings (<a href=\"#fig1\">Fig. 1B</a>).</p><div class=\"figure-container\"><figure class=\"figure\" id=\"fig1\"><label class=\"figure__label\">Fig. 1</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/104779%2Fv1%2F4yh36%2F4yh36v1_fig1.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/104779%2Fv1%2F4yh36%2F4yh36v1_fig1.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">The frequency-tagging Face Localizer paradigm in fMRI (<a href=\"#c7\">Gao et al., 2018</a>) and intracerebral electrophysiological recordings (<a href=\"#c12\">Jonas et al., 2016</a>).</h4><p>In both cases, the same variable natural non-face images alternate at a 6 Hz rate (1 fixation/image). <strong>(A)</strong> During a 405 s fMRI run, a “mini-burst” of 7 images of variable faces (purple: “F”) alternating with 6 non-face object images (orange: “O”) is presented every 9 s (0.111 Hz). A full run is composed of 44 cycles (3 s shown here). <strong>(B)</strong> During intracerebral recordings, variable face images are inserted periodically every fifth image (1.2 Hz). Each recording includes two 70-s stimulation sequences (3 s shown here). With both recording methods (and EEG; <a href=\"#c23\">Rossion et al., 2015</a>), this paradigm provides robust population-level face-selective activity devoid of low-level sensory confounds at the tagged frequencies. Here it is applied to single and multi-unit recording activity in the human fusiform gyrus.</p></figcaption></figure></div><h2 id=\"s2-1\" class=\"heading-2\">FMRI category-selective responses</h2><p><a href=\"#fig2\">Fig. 2A and D</a> illustrate the category-selective regions identified with fMRI, on axial, coronal, and sagittal slices in both participants (Z &gt; 3.1; <em>p</em> &lt; 0.001), relative to the microelectrodes location. Fast Fourier Transform (FFT) of the BOLD response time-courses is used to define face-selective voxels in the frequency-domain (0.111 Hz; <a href=\"#c7\">Gao et al., 2018</a>). BOLD frequency spectra at each voxel are transformed into Z-scores, which can either be positive (higher response to face than non-face stimuli, i.e., BOLD signal increase) or negative (lower response to faces than non-faces, i.e., BOLD signal decrease).</p><div class=\"figure-container\"><figure class=\"figure\" id=\"fig2\"><label class=\"figure__label\">Fig. 2</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/104779%2Fv1%2F4yh36%2F4yh36v1_fig2.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/104779%2Fv1%2F4yh36%2F4yh36v1_fig2.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Relationship between BOLD signal and neuronal activity in the human MidFG.</h4><p><strong>(A), (D)</strong> Significant face-selective activations (hot colors) and deactivations (cold colors) on axial, coronal, and sagittal slices (Z &gt; 3.1; <em>p</em> &lt; 0.001). The estimated location of the microelectrode (green circle) falls in left MidFG activation in P1 and right MidFG deactivation in P2. <strong>(B), (E)</strong> Representative raster plots of two face-selective single-units (SU) showing activity increase in P1 and decrease in P2 to faces, respectively. The representative face-selective SU in panel B also exhibits a high increase in firing rate to the general visual stimulation at 6 Hz. Each line corresponds to a 1 s epoch time-locked to the onset of a face (at 0 s), from a 140 s of recording. SU waveforms are shown in the upper-right corners. <strong>(C), (F)</strong> Average time-courses of all face-selective SU identified (<em>N</em> = 45 across 4 sessions in P1, <em>N</em> = 99 across 7 sessions in P2; Z &gt; 2.32, <em>p</em> &lt; 0.01), showing response increase to faces in P1 and decrease to faces in P2.</p></figcaption></figure></div><p>As expected, faces elicited larger BOLD responses than non-face objects in the lateral MidFG, but lower responses in the medial MidFG (<a href=\"#c20\">Pelphrey et al., 2003</a>; <a href=\"#c7\">Gao et al., 2018</a>). Microwires in P1 (estimated Talairach location -40, -46, -19; <a href=\"#fig2\">Fig. 2A</a>) fell in the lateral MidFG face-selective region: the Fusiform Face Area (“FFA”, peak coordinate: -35, -51, -18) (<a href=\"#c21\">Quiroga et al., 2023</a>), while microwires in P2 (29, -41, -12; <a href=\"#fig2\">Fig. 2D</a>) located in the medial MidFG, an unprecedented sampled region with lower (deactivated) BOLD signal for faces.</p><h2 id=\"s2-2\" class=\"heading-2\">Cellular category-selective responses</h2><p>Recordings of category-selective spiking activity in P1 and P2 took place over up to 11 days, with single-units detected on 7 microwires per session. Across all independent sessions (i.e., on different half-days), we recorded 245 units (<em>N</em> = 206 single-units, SU and <em>N</em> = 39 multi-units, MU; pooled over 4 sessions for P1 and 7 sessions for P2) firing to variable pictures of faces and objects. Following FFT, common visual responses to faces and objects were identified at the base frequency rate and harmonics (6, 12, and 18 Hz) while face-selective responses were measured at the specific face-stimulation frequency and harmonics (i.e., 1.2, 2.4, 3.6, and 4.8 Hz; <a href=\"#fig1\">Fig. 1B</a>) (<a href=\"#c23\">Rossion et al., 2015</a>; <a href=\"#c12\">Jonas et al., 2016</a>). Despite a brief recording time for each unit (2 sequences of 70 s), only a small proportion of single neurons failed to respond (i.e., no significant base rate response: <em>N</em> = 10/62, 16.1% in P1; <em>N</em> = 17/144 11.8% in P2; all Z &lt; 1.64, all <em>p<sub>s</sub></em> &lt; 0.05; no difference between participants, <em>p</em> = 0.54, Pearson’s χ<sup>2</sup>). Among all visually responsive neurons, we found a very high proportion of face-selective neurons (<em>p</em> &lt; 0.05) in both activated and deactivated MidFG regions (P1: 98.1%; <em>N</em> = 51/52; P2: 86.6%; <em>N</em> = 110/127). Even at a more conservative threshold (<em>p</em> &lt; 0.01), strong face-selectivity is observed (P1: 86.5%; <em>N</em> = 45/52 ; P2: 77.9%; <em>N</em> = 99/127; no difference between the two individuals, <em>p</em> = 0.27, Pearson’s χ<sup>2</sup> test).</p><p>We then determined whether face-selective single neurons (<em>p</em> &lt; 0.01) recorded in activated or deactivated face-selective regions exhibited different types of responses to faces relative to non-face objects. While a large majority of face-selective neurons in the lateral MidFG (P1) showed a significant relative increase in spike rate to faces (88.9%; <em>N</em> = 40/45; <a href=\"#fig2\">Fig. 2B, C</a>), most neurons in the medial MidFG (P2) showed significant relative spike rate decrease to faces (95.9%; <em>N</em> = 95/99; <a href=\"#fig2\">Fig. 2E, F</a>). While the mean onset response latency did not differ between increases and decreases (118.2 ms <em>vs.</em> 127.3 ms, respectively; <em>p</em> &gt; 0.05, two-tailed percentile bootstrap; <a href=\"#fig2\">Fig. 2C, F</a>), a significantly lower response (i.e., absolute average firing rate) was found for decreases than increases ([130–300 ms]; 3.69 spikes/sec for increases, ranging from 0.99 to 7.42 spikes/sec; -2.73 spikes/sec for decreases, ranging from -0.44 to -9.67 spikes/sec; <em>t</em>-test <em>p</em> &lt; 0.01). A final noteworthy observation is that, among the 95 single-units showing a reduced firing rate to faces (P2), 34 lacked a significant general visual response (at 6 Hz; i.e., 34,3%; <em>p</em> &lt; 0.05). Beyond a mere relative reduction to faces compared to non-face objects, responses of such “face-exclusive” single neurons therefore appear to reflect genuine suppression of baseline spiking activity upon presentation of a face.</p><h1 id=\"s3\" class=\"heading-1\">Discussion</h1><p>Although BOLD signals correlate better with local field potentials (LFP) than spikes on a trial-by-trial basis (<a href=\"#c16\">Logothetis et al., 2001</a>), positive correlations have been observed between SU and BOLD in human (<a href=\"#c18\">Mukamel et al., 2005</a>; <a href=\"#c19\">Nir et al., 2007</a>) and non-human primates (<a href=\"#c8\">Goense and Logothetis, 2008</a>). Here thanks to a unique combination of fMRI and microelectrode recordings in the same individual human brains, we report a striking correspondence between increases/decreases in BOLD activity and (SU) neuronal firing, in two neighboring areas of the human association cortex. By showing that the sign of the BOLD signal fluctuation during visual stimulation matches the sign of SU activity, our findings shed light on the physiology of BOLD signals, revealing in particular that BOLD decreases can be due to relative, but also absolute, spike suppression in the human brain. Such transient spikes suppression could be due to suppression/reduction of synaptic inputs to the recorded neuron(s) or to inhibitory inputs to the neuron(s).</p><p>Up to now, the cellular basis of the relative BOLD decrease to faces in the medial portion of the fusiform gyrus, attributed to a smaller increase to faces relative to non-face objects or an absence of response to faces (<a href=\"#c13\">Kanwisher, 2017</a>), has remained somewhat of a mystery. Importantly, due to both the lack of a fusiform gyrus in non-hominoid primates (<a href=\"#c31\">Weiner and Zilles, 2016</a>) and of reported BOLD deactivation to faces in the monkey brain, single-unit recordings in macaque monkeys’ face-selective cortical regions (<a href=\"#c28\">Tsao et al., 2006</a>; <a href=\"#c2\">Bell et al., 2011</a>) could not address this issue. Here, our neurophysiological recordings in humans suggest that faces do not only elicit a strong decrease of neuronal activity relative to non-face objects in the medial MidFG, but a genuine suppression of baseline spiking activity in a substantial proportion of the units recorded. Thus, beyond contributing to clarify the physiological basis of the fMRI signal, our study shed light on the nature of face-selective neural activity in the human brain, which can be expressed both as increase and active suppression of spiking activity. Inhibitory cellular activity is thought to play an important balancing role to maintain stable function of cortical circuits (<a href=\"#c29\">Vogels et al., 2011</a>), and has been shown to play a key role in cortical category-selectivity (<a href=\"#c30\">Wang et al., 2000</a>). Further direct recordings in the human association cortex will be necessary to determine the functional relevance (i.e., relationship to visual recognition behavior) and the cellular mechanisms (linked to cyto- and myelo-architecture; <a href=\"#c17\">Lorenz et al., 2017</a>) underlying these category-selective (excitatory and) inhibitory neuronal activities.</p><h1 id=\"s4\" class=\"heading-1\">Materials and methods</h1><h2 id=\"s4-1\" class=\"heading-2\">Participants</h2><p>The study included two right-handed participants (aged 23 and 46) who were patients undergoing clinical intracerebral evaluation with depth electrodes (SEEG; <a href=\"#c27\">Talairach and Bancaud, 1973</a>) for refractory partial epilepsy in the Epilepsy Unit of the University Hospital of Nancy, France in 2019 (P1) and 2023 (P2). The participants gave written informed consent to participate to the study (REUNIE, 2015-A01951-48), which was approved by a national ethical committee (CPP Est III, N°16.02.01).</p><h2 id=\"s4-2\" class=\"heading-2\">Intracerebral recordings acquisition</h2><p>Electrophysiological data were recorded from Behnke-Fried hybrid micro-macro electrodes (Ad-Tech Medical Instrument). Intracerebral depth electrodes were stereotactically implanted within the participant’s brains to delineate their seizure onset zone for clinical purposes. Electrode implantation sites were determined based on non-invasive data collected during the early stages of the investigation and were verified by CT-scan fused with a pre-operative T1-weighted MRI. The present report focuses on recordings from the macro-microelectrodes, i.e., electrodes with macro-contacts modified to include 8 recording microwires and one reference, protruding about 3 to 4 mm beyond the tip of the macro-electrode (Ad-Tech Medical; see <a href=\"#c24\">Salado et al., 2018</a> for details about the macroelectrode implantation procedure). The macro-microelectrodes targeted the right (P1) and the left (P2) MidFG. Although differential recordings in the same hemisphere(s) and individual brains would have been optimal, our results are unlikely to be due to differences between the two individuals or hemispheres reported, for two reasons. First, notwithstanding the right hemisphere’s dominance in human face recognition (<a href=\"#c12\">Jonas et al., 2016</a>; <a href=\"#c13\">Kanwisher, 2017</a>; <a href=\"#c7\">Gao et al., 2018</a>), the same contrasted pattern of BOLD activation/deactivation for faces in the lateral/medial portions of the fusiform gyrus, respectively, has been systematically observed across hemispheres (<a href=\"#c20\">Pelphrey et al., 2003</a>; <a href=\"#fig2\">Fig. 2</a>). Second, while a larger number of single-units were found for P1 than P2 recordings, the proportions of face-selective units did not differ between the two individuals.</p><p>The microwires signal was recorded at a 30 kHz sampling rate, using a 256-channel amplifier (BlackRock Microsystems), and recording activity was band-pass filtered (0.3–7500 Hz). Here we report microelectrode data recorded during 3 days (8 sequences performed in P1) and 11 days (14 sequences performed in P2). These differences across participants were due to the clinical context in which the experiment took place. Participants were tested individually and seated at 80 cm from the computer screen.</p><h2 id=\"s4-3\" class=\"heading-2\">Microwires localization in the individual anatomy</h2><p>The exact position of each contact from the micro-macro electrode relative to the individual brain anatomy was determined in each participant’s brain by coregistrating the post-operative CT-scan with a T1-weighted MRI of the patient. The microwires coordinates were estimated at approximately 4 mm from the tip of the macroelectrode. In addition, the location of microwires relative to fMRI-defined face-selective regions was determined by having all participants perform an fMRI face localizer a few months after the SEEG procedure, using an fMRI version of the frequency-tagging paradigm providing high SNR and reliability (<a href=\"#c7\">Gao et al., 2018</a>). After fMRI scanning, estimated microelectrode coordinates were rendered into the T1-weighted MRI co-registered and normalized to ACPC space with the functional Z-score map, using <em>MRIcroGL</em> for visualization. The location of the microelectrodes was also defined in relation to the boundaries of the cytoarchitectonic areas FG2/FG4 and FG1/FG3 (<a href=\"#c22\">Rosenke et al., 2017</a>).</p><h2 id=\"s4-4\" class=\"heading-2\">Stimuli</h2><p>Stimuli were selected from a large pool of 200 to 218 non-face object images and 45 to 48 face images (as in e.g., <a href=\"#c12\">Jonas et al., 2016</a>), presented in grayscale or color sequences. Each image contained an unsegmented object or face near the center, varying significantly in size, viewpoint, lighting conditions, and background (<a href=\"#fig1\">Fig. 1</a>). Images were equalized for mean pixel luminance and contrast, but low-level visual cues associated with the two categories (faces and objects) remained highly variable, naturally minimizing the contribution of low-level visual cues to the face-selective neural responses (<a href=\"#c23\">Rossion et al., 2015</a>).</p><h2 id=\"s4-5\" class=\"heading-2\">Face localizer paradigms</h2><p>A well-validated Fast Periodic Visual Stimulation (FPVS) face localizer paradigm was performed to define face-selective neural activity. Highly variable natural images of faces were embedded periodically within a rapid 6 Hz stream of object images. In the fMRI version (from <a href=\"#c7\">Gao et al., 2018</a>; also, <a href=\"#c14\">Laurent et al., 2023</a>), mini-face blocks (“bursts”) were presented for 2.167 s every 9 s to account for the sluggishness of the BOLD response (i.e., F = 1/9 = 0.111 Hz). Each mini-block consisted of a set of seven face images alternated with six non-face object images to avoid category adaptation and maximize the contrast between faces and objects (<a href=\"#fig1\">Fig. 1A</a>). Each fMRI sequence lasted 405 s and contained 44 cycles of face bursts (including a 4.5 s baseline at both the beginning and end of each sequence, respectively). During intracerebral recordings, highly variable natural images of faces were inserted periodically every fifth image (i.e., face-selective frequency at 1.2 Hz = 6/5 Hz) as usually performed (<a href=\"#fig1\">Fig. 1B</a>; <a href=\"#c23\">Rossion et al., 2015</a>; <a href=\"#c12\">Jonas et al., 2016</a>). A stimulation sequence lasted 70 s, including 66 s of stimulation at full contrast flanked by 2 s of fade-in and fade-out, with gradual increases and decreases in contrast, respectively. All images were presented with a sinusoidal stimulation contrast to provide a smooth transition between successive images. Participants were unaware of the periodicity of the faces. During both fMRI and intracerebral recordings, participants stared at a small black cross presented at the center of the stimuli and detected rare brief nonperiodic color changes (70-10 times per sequence for fMRI/iEEG respectively, for 500 ms) of the fixation cross (black to red). The experiments were conducted using Matlab for P1 and Java 8 for P2.</p><h2 id=\"s4-6\" class=\"heading-2\">Spike sorting</h2><p>Spike detection and clustering were carried out using an automatic algorithm, based on a Bayesian approach (<a href=\"#c15\">Le Cam et al., 2023</a>). The clusters were visually reviewed and classified into single-units (SU) and multi-units (MU) based on their spike shape, variance, inter-spike interval distribution, and the presence of a refractory period. Of all the sessions held by the two participants, 299 SU and 62 MU were identified. Across all independent sessions (i.e., recorded on different half-days), 206 SU and 39 MU were retained for analyses. Signal processing and frequency-domain analyses were similar to previous SEEG studies (<a href=\"#c12\">Jonas et al., 2016</a>; <a href=\"#c9\">Hagen et al., 2020</a>). An average of 2 units per contact were isolated.</p><h2 id=\"s4-7\" class=\"heading-2\">Intracerebral recordings analyses</h2><p>Analyses were performed using the free software <em>Letswave 6,</em> running on MATLAB R2022a. A Fast Fourier Transform (FFT) was applied to the iEEG recordings, and the amplitude spectrum was cut into 1 Hz segments centered on the face-selective frequency and its three additional harmonics (i.e., 1.2 Hz, 2.4 Hz, 3.6 Hz, and 4.8 Hz), as well as on the base stimulation frequency and its harmonics (i.e., 6 Hz, 12 Hz, and 24 Hz). The amplitude of these FFT segments was summed and transformed into a Z-score. Z-scores were computed as the difference between the amplitude at the target frequency bin and the mean amplitude of 20 surrounding bins (10 on each side) divided by the standard deviation of amplitudes in the corresponding 20 bins. SNR spectra were also calculated as the ratio between the amplitude at each frequency bin and the average of the corresponding 20 surrounding bins (11 on each side, excluding the 2 bins directly adjacent to the bin of interest). A cluster (SU or MU) was considered as showing a significant response for faces and classified as “face-selective” if the Z-score at the target frequency bin exceeded 1.64 (i.e., <em>p</em> &lt; 0.05 one-tailed). In addition, face-selectivity was characterized at a more conservative threshold (i.e., Z &gt; 2.32, <em>p</em> &lt; 0.01). To isolate face-selective responses from responses to non-face objects in the time domain (as in <a href=\"#fig2\">Fig. 2C, F</a>), an FFT notch filter (filter width = 0.05 Hz) was then applied on the 70 s single or multi-units time-series to remove the general visual response at 6 Hz and two additional harmonics (i.e., 12 and 18 Hz). To account for the sinusoidal modulation of contrast, the face onset time was shifted forward by 33 ms (~1/5 of a 6 Hz cycle duration). This delay was estimated by comparing SEEG responses to sequences presented with sinewave or squarewave (i.e., abrupt) contrast modulation of visual stimulation. The onset of face-selective response was delayed by 30–35 ms for sinusoidal visual stimulation, which corresponds to 4 screen refresh frames (33 ms) and 35% of the full contrast. The spike trains of each identified cluster were then segmented into 1-s segments around face onset, and the resulting epochs were temporally smoothed (20 ms time-window) and averaged. The net average spike rate was calculated by subtracting each sequence’s mean baseline spike rate in a [-0.166–0 s] time-window relative to face onset. Finally, the latency was computed as the time point at which net firing crossed the baseline +/- 2.58 s.d. value (i.e., <em>p</em> &lt; 0.01, two-tailed percentile bootstrap) for at least 30 ms. as described in <a href=\"#c11\">Jacques et al., 2022</a>.</p><h2 id=\"s4-8\" class=\"heading-2\">FMRI acquisition</h2><p>The two participants were scanned at the CHRU-Nancy, with a 3T Siemens Magnetom Prisma system (Siemens Medical System, Erlangen, Germany) with a 64-channel head-neck coil. Anatomical images were collected using a high-resolution T1-weighted magnetization-prepared gradient-echo image (MP-RAGE) sequence (192 sagittal slices, TR = 2300 ms, TE = 2.6 ms; flip angle (FA) = 9°, field of view (FOV) = 256 × 256). Functional images were collected with a T2*-weighted simultaneous multi-slice echo planar imaging (SMS EPI) sequence (TR = 1500 ms, TE = 30 ms, FA = 72°, FOV= 240×240 mm<sup>2</sup>, voxel size = 2.5 mm isotropic, matrix size = 96×96 for sequences done in 2019 or matrix size = 80x80 for sequences done in 2022, interleaved), which acquired 44 oblique-axial slices covering the entire temporal and occipital lobes. The total duration of each sequence (run) for P1 (tested in 2019) was 333 s including 9 s of dummy scans (222 TRs). The total duration of each run for P2 (tested in 2022) was 405 s including 9 s of dummy scans (270 TRs). Images were back-projected onto a projection screen by an MRI-compatible LCD projector. The participants observed the sequences through a mirror placed within the FR head coil. The images subtended a viewing angle of 8° × 8° (33.4 cm × 33.4 cm) at a viewing distance of 240 cm. Three fMRI sequences were performed for each patient, who were scanned 6–8 weeks after the microelectrode recordings.</p><h2 id=\"s4-9\" class=\"heading-2\">FMRI analyses</h2><p>As in <a href=\"#c14\">Laurent et al. (2023)</a>, the volumes of each run were first rigidly realigned with each other, and a mean functional image of the runs was computed for co-registration with the anatomical image, using <em>SPM12</em>. The volumes were also spatially smoothed with a Gaussian kernel of 2 mm (FWHM; i.e., full width at half maximum). The functional runs were averaged across runs in the volumetric space. Then, a Fourier analysis was performed using the FFT function in Matlab without windowing. The FFT was applied on the entire BOLD response time-course and the amplitude spectrum was directly derived from the Fourier transform coefficients. Amplitudes at the face stimulation frequency (i.e., at F = 0.111 Hz) were converted into Z-scores, using the mean and standard deviation of the amplitude at neighboring frequencies (see <a href=\"#c7\">Gao et al., 2018</a> for details). The relative activations and deactivations of the neural responses at the face stimulation frequency were defined by the phase of the BOLD response. For each individual, the histogram (20 bins) of phase values of all the voxels with a Z-score &gt; 3.1 and with a positive phase value was calculated. The phase value of the histogram bin that has the largest number was used as the center phase (φ) to define all the voxels with their phase values within φ ± π/2 as activations (+ sign) and voxels with their phase values outside of this window as deactivations (− sign). These signs were then applied to Z-score maps to obtain the final response map.</p></section><section id=\"acknowledgements\"><h1 class=\"heading-1\">Acknowledgements</h1><p>We thank the two participants for their involvement in the study. This research was supported by the ERC Adg HumanFace 101055175 awarded to Bruno Rossion and a PhD fellowship from the Université de Lorraine to Marie-Alphée Laurent.</p></section>"
}
