{
  "id": "96573",
  "doi": "10.1101/2024.02.18.580922",
  "version": 3,
  "status": "reviewed",
  "authorLine": "Itai Bloch, David Troupin ... Nir Sapir",
  "title": "Combining radio-telemetry and radar measurements to test optimal foraging in an aerial insectivore bird",
  "published": "2024-06-24T14:00:00Z",
  "reviewedDate": "2024-06-24T14:00:00Z",
  "versionDate": "2025-01-15T14:00:00Z",
  "statusDate": "2025-01-15T14:00:00Z",
  "stage": "published",
  "subjects": [
    {
      "id": "ecology",
      "name": "Ecology"
    }
  ],
  "elifeAssessment": {
    "title": "eLife Assessment",
    "content": [
      {
        "type": "paragraph",
        "text": "This important study enhances our understanding of the foraging behaviour of aerial insectivorous birds. Using solid methodology, the authors have collected extensive data on bird movements and prey availability, which in turn provide support for the main claim of the study. The work will be of broad interest to behavioural ecologists."
      }
    ],
    "id": "sa3",
    "doi": "10.7554/eLife.96573.3.sa3",
    "significance": [
      "important"
    ],
    "strength": [
      "solid"
    ]
  },
  "indexContent": "Itai Bloch, David Troupin, Sivan Toledo, Ran Nathan, Nir Sapir <section id=\"introduction\"><h1 id=\"s1\" class=\"heading-1\">Introduction</h1><p>Optimal foraging theory predicts how foragers should adjust their movement and behavior based on the costs and benefits of finding and consuming food <sup><a href=\"#c1\">1</a>–<a href=\"#c5\">5</a></sup>. Empirical studies have tested optimal foraging predictions in terrestrial and marine environments <sup><a href=\"#c6\">6</a>–<a href=\"#c10\">10</a></sup>, yet, to the best of our knowledge, no study has thus far utilized advanced tracking tools to empirically examine optimal foraging predictions of foragers in the highly dynamic aerial habitat <sup><a href=\"#c11\">11</a></sup>. Understanding optimal foraging in aerial habitats is essential for comprehending complex interactions and adaptations in this dynamic environment. We combine aerial insect abundance data collected using the BirdScan-MR1 radar <sup><a href=\"#c12\">12</a>–<a href=\"#c15\">15</a></sup> with measurements of the movement of insectivore birds using the automated and accurate ATLAS (Advanced Tracking and Localization of Animals in Real-Life Systems) biotelemetry system <sup><a href=\"#c16\">16</a></sup>. This study examines whether the Little Swift (<em>Apus affinis</em>), a monomorphic, small insectivore (12 cm, 25 g) that breeds in small colonies and often forages in groups <sup><a href=\"#c17\">17</a>–<a href=\"#c20\">20</a></sup>, optimizes its foraging behavior in response to variations in insect density in the airspace, within the framework of optimal central-place foraging. We note that in a preliminary study, we found no discernible differences in foraging characteristics between males and females <sup><a href=\"#c21\">21</a></sup>.</p><p>Aerial insectivores feed on insects <sup><a href=\"#c22\">22</a>–<a href=\"#c24\">24</a></sup> that have recently been reported to be in decline in different ecosystems and regions of the world <sup><a href=\"#c22\">22</a>,<a href=\"#c23\">23</a>,<a href=\"#c25\">25</a>–<a href=\"#c27\">27</a></sup>. Among aerial foragers, swifts are highly adapted to life on the wing due to their high flight capabilities, allowing them to undertake different activities in the air and stay airborne for long periods <sup><a href=\"#c28\">28</a>–<a href=\"#c34\">34</a></sup>. Nevertheless, during the breeding season, birds return to their central-place breeding colony and provide food to their young throughout the day. Consequently, they may adjust their foraging in relation to different environmental conditions to maximize the net energy obtained during foraging <sup><a href=\"#c4\">4</a>,<a href=\"#c35\">35</a>,<a href=\"#c36\">36</a></sup>. According to the theory of central-place foraging, traveling to a distant destination is an expensive investment in terms of time and energy compared to traveling to a nearby destination <sup><a href=\"#c37\">37</a>,<a href=\"#c38\">38</a></sup>. Therefore, animals are expected to prefer reducing the time and distance of travel to the food patch and thus will travel farther only when their prey is not sufficiently available near the central place. We thus hypothesize that, in times of abundant food, birds will optimize energy conservation by foraging closer to the colony <sup><a href=\"#c37\">37</a>,<a href=\"#c39\">39</a></sup>. Consequently, we anticipate a reduction in both the average daily air flight distance (hereafter – average distance) (Prediction 1) and the maximum daily air flight distance (hereafter – maximum distance) (Prediction 2) from the breeding colony under conditions of increased food abundance. This will also result in shorter overall daily flight route length (hereafter - daily route) (Prediction 3) and overall daily foraging flight duration (hereafter – foraging duration) (Prediction 4). Since breeding swifts may maximize food provisioning to the young, the visitation rate could also be tailored to the abundance of insects <sup><a href=\"#c2\">2</a>,<a href=\"#c3\">3</a>,<a href=\"#c37\">37</a></sup> such that higher food density will facilitate a higher rate of visits at the nest <sup><a href=\"#c2\">2</a>,<a href=\"#c6\">6</a></sup> (Prediction 5). Furthermore, a bird’s flight speed, when feeding its young, is expected to vary with food abundance, and this rarely tested prediction suggests an increase in flight speed with greater food abundance <sup><a href=\"#c40\">40</a>,<a href=\"#c41\">41</a></sup> (Prediction 6). The timing of morning emergence from the colony and evening return to the colony is affected by a number of factors <sup><a href=\"#c42\">42</a>–<a href=\"#c47\">47</a></sup>. These include predation risks that vary throughout the daily cycle and the optimization of foraging time in relation to food abundance. We hypothesize that the time of arrival at the colony for the night roost and the time of departure from the colony in the morning will be affected by the abundance of flying insects. We specifically predict that swifts will arrive at the colony earlier for roosting when food abundance is sufficiently high to provide enough food for their own and their young’s needs (Prediction 7). If insect abundance is correlated in time such that birds may be able to predict insect abundance based on that of the previous day, We expect the swifts’ departure time to be delayed when the abundance of insects on the previous day is higher (Prediction 8), as there is no need to maximize the foraging duration if food is abundant and this could reduce predation risk by avian predators that are active early in the morning <sup><a href=\"#c48\">48</a>,<a href=\"#c49\">49</a></sup>. Consequently, the predicted swifts’ emergence times are expected to correlate with the roosting time from the previous night (Prediction 9a). Yet, if no between-day correlation in insect abundance exists, morning departure timing will not be related to insect abundance of the previous day and the two measures will not be correlated. (Prediction 9b). For social foraging animals, local enhancement can provide several advantages, including increased energy intake <sup><a href=\"#c50\">50</a>–<a href=\"#c52\">52</a></sup>, higher fitness <sup><a href=\"#c53\">53</a></sup>, improved food detection <sup><a href=\"#c54\">54</a>,<a href=\"#c55\">55</a></sup>, and avoidance of predators <sup><a href=\"#c53\">53</a>,<a href=\"#c56\">56</a></sup>. However, an enlarged group size could exacerbate inter-individual competition and may lead to diminished foraging efficiency <sup><a href=\"#c53\">53</a>,<a href=\"#c57\">57</a></sup>. Conversely, increased food abundance ensures adequate sustenance for more group members, thereby alleviating competition. We posit that higher insect abundance would lead to a greater density of foraging individuals, reducing the distance between them during foraging. (Prediction 10).</p><p>To test these predictions, we studied how Little Swifts adjust their aerial foraging behavior to varying insect abundances in the airspace. Using radar and biotelemetry data, we reveal bird response to food abundance in relation to foraging distances, timing, foraging duration, and speed, as well as the frequency of colony visits and the distance between individuals. Our findings shed light on how aerial foragers may optimize their movement and behavior in response to highly dynamic environmental conditions.</p><h1 id=\"s2\" class=\"heading-1\">Methods</h1><p>Little Swifts breed in Israel between March and September, during which they complete two breeding cycles. In the swifts’ breeding colony, dozens of pairs inhabit interconnected nests crafted from feathers and stems. Each nest features a narrow entrance designed to deter predators and obscure visibility inside. This setup presents challenges in accurately assessing nesting conditions and determining the age of chicks within the nests. Both partners incubate alternately, and during the night, they both stay in the nest. The incubation period lasts 18-22 days, and fledging occurs 35-40 days after hatching. Both parents participate in the feeding of the young <sup><a href=\"#c18\">18</a>,<a href=\"#c19\">19</a></sup>. We studied swifts in a breeding colony located in the center of the Hula Valley in northeastern Israel (33.05°N / 35.59°E). The valley consists of a mosaic of agricultural land with various crops, mainly deciduous tree plantations and open field crops, as well as wetlands and urbanized areas. Our field observations suggest that there are about 30-40 nesting pairs in the colony.</p><h2 id=\"s2a\" class=\"heading-2\">Swift movement data collection</h2><p>During March-May of 2019 and 2021, employing a 9 m mist net outside the breeding colony, we captured Little Swifts during their early morning departure after the night stay. Our bird trapping activities were conducted under permits (2019-42174 and 2021-42762) of the Israel Nature and Parks Authority. Captured swifts were measured and ringed with a standard aluminum ring to allow individual identification. We equipped 32 swifts with ATLAS transmitters weighing 1-1.15 g, less than 5% of the body mass of each individual.</p><p>The ATLAS system is a reverse GPS-like system that operates using time-difference-of-arrival of radio waves to base stations (antennas), recording the horizontal locations of tagged animals within the system’s coverage area at high frequency (the tags transmitted every 8 s) and spatial accuracy (∼ 10 m). The system includes antennas deployed throughout the Hula Valley and the surrounding area (<a href=\"#fig1\">Fig 1</a>), facilitating the calculation of the spatial position of the radio transmitters that emit a unique ID signal for each transmitter. The transmitters were affixed to the swifts using a backpack harness positioned between the back feathers, secured with Perma-Type Surgical Cement (Perma-Type Company Inc., Plainville, CT, USA). This adhesive naturally dries and allows the harness to fall off after several weeks <sup><a href=\"#c58\">58</a></sup>. Except for one tag that stopped transmitting immediately after release, the tags operated for periods of 0.3 - 39.8 days (X=13.4 ±10.4 days).</p><div class=\"figure-container\"><figure class=\"figure\" id=\"fig1\"><label class=\"figure__label\">Fig 1.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/96573%2Fv3%2Fcontent%2F580922v3_fig1.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/96573%2Fv3%2Fcontent%2F580922v3_fig1.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">The research system.</h4><p><strong>A</strong> - Map of the Hula Valley, Israel, and the surrounding area. The red star represents the location of the Little Swifts’ breeding colony. The blue star depicts the location of the radar. White markings indicate the locations of the ATLAS system’s antennas. <strong>B</strong> – The BirdScan-MR1 radar. <strong>C</strong> - The location of the research system in northeastern Israel within the Middle East, is indicated by a red star. <strong>D</strong> - A Little Swift with an ATLAS tag.</p></figcaption></figure></div><p>We analyzed a total of 841,342 localizations during days in which we obtained both bird movement data from the ATLAS system and insect abundance data from the radar (see below). The data were collected over a total of 31 days (19 days in 2019 and 12 days in 2021). Because swifts are active during the daytime, we used only ATLAS data from the main activity hours of the swifts during the day, from sunrise to sunset <sup><a href=\"#c59\">59</a></sup> (personal observations and movement data obtained from the ATLAS system).</p><p>We applied several filters to reduce inaccuracies in the movement tracks as a result of localization errors <sup><a href=\"#c60\">60</a></sup>. Since there is no accurate information about the maximum flight speed of Little Swifts, we relied on the maximum flight speed of the Common Swift <sup><a href=\"#c32\">32</a></sup> to filter out tracks with a flight speed that exceeded 30 m/s (9.6% of the raw data). We additionally utilized the standard error of the localization (StdLoc) to assess position quality, identifying outliers (1.5 times the interquartile range) of StdLoc <sup><a href=\"#c61\">61</a></sup>. Setting an upper limit at 30.1 m, we filtered out positions with low accuracy, amounting to 10.7% of the data. Additionally, we applied a minimum threshold of 4 <sup><a href=\"#c62\">62</a></sup> for the Number of ATLAS Base Stations (NBS) receiving a tag’s signals during each transmission to filter out localizations with low confidence of accuracy (4.0% of the data; range of NBS after filtering: 4-14, X̅=6.6 ±1.9 NBS). We then excluded tracks in which consecutive locations were more than 500 m away from each other (0.7% of the data), likely representing an error in the automatic calculation of the tag’s position. The filtering process removed a total of 24.5% of the raw data. To ensure the overall dataset represented the movement of all birds without being influenced by the unusual behavior of a few, we excluded data from days with fewer than four active tags (range of number of tags after filtering: 4-10, mean±SD = 6.9±1.5 tags per day). This threshold eliminated days with a small number of tagged birds recorded (24.8% of the data). As a result, a total of 49.4% of the original raw data was excluded to maintain a high level of reliability and accuracy; analysis was based on 415,420 positions, with a mean of 1,491 ± 899 locations per tag per day.</p><h2 id=\"s2b\" class=\"heading-2\">Movement analysis</h2><p>To examine bird movement (<a href=\"#fig2\">Fig 2</a>) and behavior, we calculated the average and maximum distance from the breeding colony. To determine the average daily route and duration of foraging, we analyzed data from 15 days with a minimum of 10 hours of consistent tag activity, excluding cases of tag malfunction or battery issues. There was no tag reception when the swifts entered the building that housed their breeding colony, allowing easy determination of when they visited the colony. To standertize the effect of day length on the foraging duration, we calculated and subtracted the day length from the total daily foraging time (Day duration - Daily foraging duration = Net foraging duration). The resulting data represent the foraging duration in relation to sunrise and sunset, independent of day length. To characterize the rate of visitation to the breeding colony, we defined visits as events in which birds stayed in the colony for at least 60 seconds. The time of arrival to the breeding colony for night roosting was calculated as minutes after sunset, within a 60-minute window around sunset, and the same was done for the morning departure time, but in relation to sunrise. We calculated the average departure and arrival time of all active tags for each day.</p><div class=\"figure-container\"><figure class=\"figure\" id=\"fig2\"><label class=\"figure__label\">Fig 2.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/96573%2Fv3%2Fcontent%2F580922v3_fig2.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/96573%2Fv3%2Fcontent%2F580922v3_fig2.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Foraging range in relation to insect abundance.</h4><p>Differences in the movement routes of two individuals (marked in light blue and orange) on two consecutive days that were characterized by large differences in MoTR. <strong>A</strong> – 09.04.2019 (average MoTR=1904.2 insects km<sup>-1</sup> hr<sup>-1</sup>). <strong>B</strong> – 10.04.2019 (average MoTR=983.5 insects km<sup>-1</sup> hr<sup>-1</sup>).</p></figcaption></figure></div><p>We omitted days when the night time arrival to the colony was missing (e.g., days when the battery ran out during the day) or days when the morning departure time from the colony was missing. Consequently, we were left with 23 days of arrival data, 20 days of departure data, and 20 days of departure in which data existed regarding the abundance of insects (below) on the previous day. To compute the average distance between individuals, we calculated the average position every 5 min for each bird and omitted cases where we had simultaneous location data of less than 4 individuals. We then calculated the daily average of the distance between individuals.</p><h2 id=\"s2c\" class=\"heading-2\">Radar measurements of insect abundance</h2><p>Studies have shown that environmental variables like temperature and wind significantly influence the spatial abundance of insects across different crop areas <sup><a href=\"#c63\">63</a>,<a href=\"#c64\">64</a></sup>. To estimate the abundance of insects aloft, we used the daily average MoTR of aerial insects recorded by the BirdScan-MR1 radar <sup><a href=\"#c15\">15</a></sup> (Swiss-birdradar, Winterthur, Switzerland) located in the Hula Valley (33.06°N / 35.35°E), 6.5 km north of the Little Swifts’ breeding colony. The radar is capable of detecting flying animals, including songbirds, waterbirds, bird flocks, large single birds, and insects, by classifying them according to the patterns of the echo <sup><a href=\"#c12\">12</a>,<a href=\"#c65\">65</a></sup>. The Radar Cross Section (RCS) quantifies the reflectivity of a target, serving as a proxy for size by representing the cross-sectional area of a sphere with identical reflectivity to water, whose diameter equals the target’s body length <sup><a href=\"#c66\">66</a></sup>. Recent findings indicate that the BirdScan MR1 radar can detect insects with an RCS as low as 3 mm² <sup><a href=\"#c67\">67</a></sup>, with decreasing detection probability at increasing altitudes. The detection threshold, defined by the STC setting, was 93 dBm, and the transmit power was 25 kW <sup><a href=\"#c67\">67</a></sup>. These capabilities make the radar suitable for locating the primary prey of swifts, which typically range in size from 1 to 16 mm <sup><a href=\"#c17\">17</a></sup>. In addition, the radar automatically calculates the height, speed, and direction of movement of the object. The radar has an upward-pointing antenna that picks up objects passing within a 90-120° vertical cone over it. Insects are recorded by the radar from a height of about 50 m above ground level up to a height of about 700 m above the ground. We calculated the daily averaged MoTR from 5 am to 8 pm local time as a standard measure of insect abundance rates. This was done by counting insects per hour across a 1 km cross-section and averaging these counts over a single day, allowing for comparisons of aerial movement between different days <sup><a href=\"#c13\">13</a></sup>. We matched the insect data obtained from the radar with the swift movement data obtained from the ATLAS system.</p><h2 id=\"s2d\" class=\"heading-2\">Statistical analysis</h2><p>Using the ‘stats’ package in R <sup><a href=\"#c68\">68</a></sup>, we applied Generalized Linear Models (GLMs) and Spearman correlations to explore the effects of the MoTR (continuous independent variable) on the movement and behavior parameters of the swifts during the breeding season. If the GLM, with more than one explanatory variable, had a ΔAIC&lt;2 relative to other models, we employed the MuMIn <sup><a href=\"#c69\">69</a></sup> package to generate an average model. Specifically, we investigated how the distance between individuals is influenced by both the distance of birds from the colony and MoTR. Accounting for the expected increase in individual distance when flying farther from the breeding colony due to a larger air volume occupied by the moving birds, these factors were integrated into our GLM analysis. The same approach was applied in modeling the frequency of visits to the colony. To distinguish the effects of breeding colony distance and insect abundance on the distance between individuals, our GLM incorporated both variables, ensuring a comprehensive understanding of the impact of distance from the colony (<a href=\"#figa1\">Appendix - figure 1</a>). In the model testing which factors affected the time of arrival at the colony, the frequency of visits was highly correlated with MoTR and was therefore removed from the model at an initial stage. The departure time from the colony and the length of the daily route did not significantly affect the arrival time and were left out of the model at a later stage. Consequently, the final model included only MoTR as an explanatory factor for colony arrival time. We additionally tested if the time of departure from the breeding colony after the overnight stay was related to three explanatory variables, MoTR, MoTR on the previous day, and the arrival time to the colony for the overnight stay on the previous day. We used the fitdistrplus package <sup><a href=\"#c70\">70</a></sup> to identify the appropriate distribution for each GLM. We used R (version 4.1.2, R Development Core Team) <sup><a href=\"#c68\">68</a></sup> for all the statistical analyses. Data reported are average ± S.D. unless noted otherwise and the analyses were two-tailed with a critical α=0.05.</p><h1 id=\"s3\" class=\"heading-1\">Results</h1><p>The MoTR (1207.7 ± 566.7 insects km<sup>-<a href=\"#c1\">1</a></sup> hr<sup>-1</sup>) varied substantially between different days during the swifts’ breeding season, with a minimum of 164.4 and a maximum of 2518.9 insects km<sup>-1</sup> hr<sup>-1</sup> (n=31 days; <a href=\"#fig3\">Fig 3a</a>). No seasonal trend was found in MoTR (Spearman’s rank correlation between the ordinal date and the MoTR, ρ=-0.007, p=0.971, n=31 days; See <a href=\"#tbla1\">Appendix - Table 1</a>). We found a significant negative effect of the MoTR on the swifts’ average distance from the breeding colony (Prediction 1) (estimate&lt;-0.001, t=-5.27, p&lt;0.001, n=31 days, Gamma GLM; <a href=\"#fig3\">Fig 3b</a>). Similarly, a significant negative effect of MoTR was also found in relation to the birds’ maximum distance from the breeding colony (Prediction 2) (estimate=-1.818, t=-3.52, p=0.001, n=31 days, Gaussian GLM; <a href=\"#fig3\">Fig 3c</a>). We found no effect of MoTR on the daily route (Prediction 3) (estimate&lt;-0.001, t=-1.65, p=0.123, n=15 days, Gamma GLM) and on the duration of foraging (Prediction 4) (estimate=0.029, t=1.05, p=0.315, n=15 days, Gaussian GLM). The frequency of visits at the breeding colony (Prediction 5) (see the average model in <a href=\"#tbla2\">Appendix - Table 2</a>) was significantly and positively affected by MoTR (estimate=0.001, t=3.78, p&lt;0.001, n=31 days, Gamma GLM; <a href=\"#fig3\">Fig 3d</a>) and negatively affected by the distance of the birds from the breeding colony (estimate&lt;-0.001, t=2.03, p=0.043, n=31 days). We found that there was no effect of MoTR on the average flight speed (Prediction 6) (estimate&lt;-0.001, t=-1.33, p=0.193, n=31 days, Gaussian GLM). The time of arrival at the breeding colony for nighttime roosting was significantly and negatively affected by the MoTR (Prediction 7) (estimate=-0.011, t=-2.27, p=0.034, n=23 days, Gaussian GLM; (<a href=\"#figa2\">Appendix - figure 2</a>), such that birds arrived earlier to roost in days characterized by abundant insect prey. The departure time from the breeding colony following overnight roosting has resulted in a consistently observed duration of nighttime roosting (10.45 ± 0.68 hours). This duration showed no correlation with the preceding day’s MoTR (Prediction 8) (estimate=0.002, t=0.26, p=0.801, n=20, Gaussian GLM). Conversely, it was significantly and positively influenced by the evening arrival time to the colony on the prior day (Prediction 9a) (estimate=0.634, t=2.81, p=0.016, n=14 days, Gaussian GLM; <a href=\"#fig3\">Fig 3e</a>). Furthermore, the departure time from the roost exhibited no association with MoTR of the same day (Prediction 9b) (estimate=-0.005, t=-1.07, p=0.297, n=20, Gaussian GLM). MoTR significantly and negatively affected (estimate&lt;-0.001, t=-3.12, p=0.004, n=31 days, Gamma GLM) the distance between individuals (Prediction 10), while, as expected, the distance between individuals was significantly and positively correlated with the distance from the colony (estimate&lt;0.001, t=5.02, p&lt;0.001, n=31 days; <a href=\"#fig3\">Fig 3f</a>).</p><div class=\"figure-container\"><figure class=\"figure\" id=\"fig3\"><label class=\"figure__label\">Fig 3.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/96573%2Fv3%2Fcontent%2F580922v3_fig3.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/96573%2Fv3%2Fcontent%2F580922v3_fig3.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Insect Traffic Rate (MoTR) and its effects on the aerial foraging of Little Swifts.</h4><p><strong>A</strong> - Average daily insect abundance in relation to an ordinal date. Triangles represent days when data allowed examining swift movement in relation to MoTR. MoTR varied across days within the swifts’ breeding season by more than an order of magnitude. <strong>B</strong> - The effect of MoTR on the average flight distance from the breeding colony. <strong>C</strong> - The effect of MoTR on the maximal flight distance from the breeding colony. <strong>D</strong> - The effect of MoTR on the average daily frequency of visits at the breeding colony; inset: coefficient value and confidence intervals of the coefficient resulting from the model testing the effects of MoTR and distance from the breeding colony on the frequency of visits. <strong>E</strong> - The relationship between the time of departure from the breeding colony in the morning after the overnight stay and the time of arrival to the colony prior to the overnight stay the previous evening. <strong>F</strong> - The effect of MoTR on the daily average distance between foraging individuals; inset: coefficient value and confidence intervals of the coefficient resulting from the model testing the effects of MoTR and distance from the colony on the distance between individuals.</p></figcaption></figure></div><h1 id=\"s4\" class=\"heading-1\">Discussion</h1><h2 id=\"s4a\" class=\"heading-2\">Movement optimization during breeding</h2><p>Our study provides novel insights regarding the optimal foraging of aerial insectivores, by uniquely employing advanced tools to simultaneously track the movement and behavior of insectivore foragers and the dynamics of their insect prey aloft. We observed a reduction in average and maximum flight distance (Prediction 1 &amp; 2) from the breeding colony in relation to MoTR, indicating that swifts can identify insect prey abundance and accordingly modify their flight distance and avoid using distant foraging locations when sufficient prey is found near the breeding colony. These results indicate that a significant decrease in insect abundance may lead swifts to expend more energy foraging in distant areas from the breeding colony, potentially impacting parental flight efficiency. Providing food to the young is a critical and enduring activity in bird life, influencing physiology <sup><a href=\"#c71\">71</a>,<a href=\"#c72\">72</a></sup>, immunity <sup><a href=\"#c73\">73</a></sup>, and survival <sup><a href=\"#c72\">72</a>,<a href=\"#c74\">74</a></sup>. Consequently, a reduction in flying insect abundance forcing birds to forage farther from the colony could have broad implications for the reproduction, survival, and population ecology of insectivores. Nevertheless, we investigated the impact of MoTR on the total daily route and foraging duration (Prediction 3 &amp; 4). Our findings revealed no significant effects, suggesting that daily energy expenditure attributed to flight behavior does not exhibit a consistent pattern in response to the highly variable insect prey abundance and the associated shifts in swift flight behavior (higher proximity to the colony when prey is abundant).</p><p>While the theory of central-place foraging suggests that traveling to a distant destination is an expensive investment in terms of time and energy utilization compared to traveling to a nearby destination <sup><a href=\"#c37\">37</a>–<a href=\"#c39\">39</a></sup>, our findings indicate that the birds may optimize their feeding rate (Prediction 5) to the young by staying close to the colony when food is abundant. We found that the frequency of colony visits was positively affected by MoTR (<a href=\"#fig3\">Fig 3e</a>), indicating high provisioning rates when food was abundant, which supports an increase in the overall energy brought to the nestlings <sup><a href=\"#c75\">75</a></sup>. Thus, even when the birds foraged close to the colony under optimal conditions, the shorter traveling distance did not necessarily confer lower flight-related energetic expenditure because more return trips were made. Rather, it is the ability to provide more food to the young, by foraging close to the colony, that is being optimized, to benefit the reproductive output of the birds.</p><p>The availability of resources in a bird’s habitat may affect the length of its daily route <sup><a href=\"#c76\">76</a></sup>, while others show no significant correlation <sup><a href=\"#c77\">77</a></sup>. We found that the swifts maintained rather constant flight effort, regardless of the abundance of their prey. Similarly, foraging duration was also not related to MoTR. Further, our results suggest that food abundance had no significant impact on flight speed (Prediction 6). Consequently, our results support the idea that birds optimize food provisioning to the young during breeding, which could increase the birds’ reproductive success at the expense of foraging energetics considerations. Another property of food provisioning to the young that may affect energy intake is the size of the load but unfortunately, we have no information on whether the load size brought to the nest varied with insect abundance.</p><h2 id=\"s4b\" class=\"heading-2\">Behavior optimization during breeding</h2><p>Birds may adjust their foraging timing to optimize food intake <sup><a href=\"#c42\">42</a>–<a href=\"#c45\">45</a></sup>. Our findings reveal that when insect prey was abundant in the airspace, the swifts’ evening arrival time (Prediction 7) at the breeding colony was earlier than in days when insects were scarce. This result aligns with prior research on the predation risk-food availability trade-off, indicating that birds tend to avoid foraging during twilight hours due to elevated predation risk during this period<sup><a href=\"#c43\">43</a>,<a href=\"#c78\">78</a></sup>.</p><p>The availability of insects did not significantly influence the departure time (Prediction 8) from the colony after an overnight stay on both the same and previous days. Yet, the morning departure time was positively and significantly correlated with the time of arrival at the overnight roosting on the previous day. This result suggests a link between these specific behavioral features related to roosting timing. A possible explanation could be that birds arriving at the colony relatively early in the evening may be hungrier the following day, and this hunger may cause an earlier departure for foraging the following morning (Prediction 9a). Also, since these birds fed their young earlier, they may prefer to start foraging earlier the following morning, and thereby provide more food to their young in the morning to compensate for the early termination of feeding on the previous day (Prediction 9b). Further research is needed to establish the causes of this interesting relationship.</p><p>The influence of resource abundance on social foraging in aerial insectivorous birds remains a largely unexplored topic, despite its potential impact on bird fitness <sup><a href=\"#c53\">53</a></sup>, energy intake <sup><a href=\"#c50\">50</a>,<a href=\"#c53\">53</a>,<a href=\"#c57\">57</a></sup>, predator avoidance <sup><a href=\"#c53\">53</a>,<a href=\"#c56\">56</a></sup>, and food acquisition dynamics <sup><a href=\"#c54\">54</a>,<a href=\"#c55\">55</a></sup>. Our findings suggest that when food is abundant, the distance between foraging individuals (Prediction 10) is reduced, and this distance increases when food is scarce. A possible explanation for these findings is that when individuals forage at an increasing distance from the breeding colony (<a href=\"#fig2\">Fig 2</a>) they may be too far from each other to detect each other and forage together in patchily distributed insect-rich patches in the airspace. When foraging closer to each other, local enhancement of individuals may take place when an effective foraging area is discovered <sup><a href=\"#c52\">52</a>,<a href=\"#c79\">79</a></sup>. Thus, swifts likely benefit from the advantages of local enhancement during periods of abundant food <sup><a href=\"#c50\">50</a>–<a href=\"#c52\">52</a></sup>, but this enhancement might be limited when food is scarce.</p><h2 id=\"s4c\" class=\"heading-2\">Central-place foraging</h2><p>Many studies on central-place foraging examined foraging characteristics in relation to the distance and quality of the foraging patch <sup><a href=\"#c10\">10</a>,<a href=\"#c35\">35</a>,<a href=\"#c38\">38</a>,<a href=\"#c39\">39</a>,<a href=\"#c80\">80</a>–<a href=\"#c83\">83</a></sup>. Our research deals with the abundance of food in the aerial habitat, which is highly dynamic, as corroborated by our findings that insect abundance varied greatly, by more than an order of magnitude, between different days during the swifts’ breeding period. Although insect abundance aloft varies with time, it is not clear to what extent it varies in space as several studies suggested that insect bioflow is correlated over large spatial scales <sup><a href=\"#c64\">64</a>,<a href=\"#c84\">84</a>,<a href=\"#c85\">85</a></sup>. Hence, patches of high insect concentration might be transient and spatially variable; thus, further study is needed to characterize the spatial properties of insect bioflow. It is known that insect concentrations occur under specific meteorological conditions, for example on the edges of air fronts <sup><a href=\"#c86\">86</a></sup>, as well as near topographic features where the wind may subside <sup><a href=\"#c87\">87</a></sup>. We call for a better description of the spatial properties of insects in the aerial habitat, specifically the horizontal and vertical distribution of insects in the airspace and how it might be affected by different factors, including topography, coastlines and weather conditions. Our study, with its primary focus elsewhere, did not delve into this aspect. Nonetheless, the availability of today’s advanced technological tools attests to the feasibility of conducting such research.</p><h2 id=\"s4d\" class=\"heading-2\">Integrating advanced tracking systems for ecological research</h2><p>Due to its nature, aeroecological research is limited by the paucity of appropriate tools to track aerial animals and their dynamic environment in detail <sup><a href=\"#c88\">88</a>,<a href=\"#c89\">89</a></sup>. Several recent technological developments facilitated a better grasp of the aerial environment, allowing the examination of various aspects of aerial ecology that were impossible to test in the past or that were explored only with coarse resolution<sup><a href=\"#c90\">90</a></sup>. The combination of two advanced systems, namely ATLAS and the BirdScan-MR1 radar allows, for the first time, a detailed investigation of fundamental aspects of animal foraging in the airspace through the study of predator-prey interactions between Little Swifts and their insect prey. Recent progress in wildlife tracking technologies enables new insights into the movement patterns of animals, including their causes, consequences, and underlying mechanisms, facilitated by the integration of complementary tools <sup><a href=\"#c91\">91</a></sup>, as demonstrated here. Specifically, the unique combination of advanced technologies to expand the boundaries of aeroecological research can be expanded and further utilized for understanding how changes in the aerial habitat that are related to human activities may affect organisms that live in this unique and dynamic habitat <sup><a href=\"#c22\">22</a>,<a href=\"#c23\">23</a></sup>. These insights may play a crucial role in the conservation of aerial insectivores that are dramatically affected by human related alteration, including habitat degredation and the use of pesticides <sup><a href=\"#c92\">92</a>,<a href=\"#c93\">93</a></sup>.</p></section><section id=\"acknowledgements\"><h1 class=\"heading-1\">Acknowledgements</h1><p>We thank Yosef Kiat, Eve Miller, Ayla Rimon, Stav Shay, and Gev Galili for their help with the fieldwork and Yoni Vortman, Yoav Bartan, Yotam Orchan, and Anat Levi for logistical support.</p></section><section id=\"additional-information\"><h1 id=\"d1e1057\" class=\"heading-1\">Additional information</h1><h2 id=\"s5\" class=\"heading-2\">Author contributions</h2><p>Conceptualization, I.B., and N.S.; Methodology, I.B., and N.S.; Formal Analysis, I.B, D.T. &amp; N.S.; Investigation, I.B. and N.S.; Writing – Original Draft, I.B.; Writing – Review &amp; Editing, N.S. and R.N.; Visualization, I.B. and D.T.; Funding Acquisition, N.S.; Resources, N.S., R.N. and S.T.</p><h2 id=\"s7\" class=\"heading-2\">Funding</h2><p>The study was supported by a grant from the KKL-JNF (Kanfei KKL, contract no. 60-05-675-18) and the Israel Science Foundation grants ISF-2333/17 and ISF-1653/22 (to N.S.), ISF-965/15 (to R.N. and S.T), and ISF-1919/19 (to S.T). The ATLAS system work was funded by the Minerva Foundation, the Minerva Center for Movement Ecology, the Adelina and Massimo Della Pergola Professor of Life Sciences to R.N.</p></section><section id=\"appendix\"><h1 id=\"app1\" class=\"heading-1\">Appendix</h1><h2 id=\"s8a\" class=\"heading-2\">Supporting figures and results</h2><div class=\"figure-container\"><figure class=\"figure\" id=\"tbla1\"><label class=\"figure__label\">Table 1</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/96573%2Fv3%2Fcontent%2F580922v3_tbla1.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/96573%2Fv3%2Fcontent%2F580922v3_tbla1.tif/full/max/0/default.jpg\" alt=\"\"/></picture><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/96573%2Fv3%2Fcontent%2F580922v3_tbla1a.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/96573%2Fv3%2Fcontent%2F580922v3_tbla1a.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Summary of the statistical analyses.</h4></figcaption></figure></div><div class=\"figure-container\"><figure class=\"figure\" id=\"tbla2\"><label class=\"figure__label\">Table S2</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/96573%2Fv3%2Fcontent%2F580922v3_tbla2.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/96573%2Fv3%2Fcontent%2F580922v3_tbla2.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Model selection table for independent variables explaining colony visit frequency (Models with delta AIC&lt;2).</h4></figcaption></figure></div><div class=\"figure-container\"><figure class=\"figure\" id=\"figa1\"><label class=\"figure__label\">Fig 1</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/96573%2Fv3%2Fcontent%2F580922v3_figa1.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/96573%2Fv3%2Fcontent%2F580922v3_figa1.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><p>An expected increase in the average distance between individuals with an increase in the distance from the breeding colony (black circle in the center of the figure).</p></figcaption></figure></div><div class=\"figure-container\"><figure class=\"figure\" id=\"figa2\"><label class=\"figure__label\">Fig 2</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/96573%2Fv3%2Fcontent%2F580922v3_figa2.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/96573%2Fv3%2Fcontent%2F580922v3_figa2.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><p>The effect of MoTR on the average night arrival time to the breeding colony.</p></figcaption></figure></div></section>"
}
