{
  "id": "97765",
  "doi": "10.1101/2024.03.08.584189",
  "version": 2,
  "status": "reviewed",
  "authorLine": "Luhe Li, Fangfang Hong ... Michael S Landy",
  "title": "Precision-based causal inference modulates audiovisual temporal recalibration",
  "published": "2024-06-24T14:00:00Z",
  "reviewedDate": "2024-06-24T14:00:00Z",
  "versionDate": "2025-01-15T14:00:00Z",
  "statusDate": "2025-01-15T14:00:00Z",
  "stage": "published",
  "subjects": [
    {
      "id": "neuroscience",
      "name": "Neuroscience"
    }
  ],
  "elifeAssessment": {
    "title": "eLife Assessment",
    "content": [
      {
        "type": "paragraph",
        "text": "In this valuable study, Li et al., set out to understand the mechanisms of audiovisual temporal recalibration - the brain's ability to adjust to the latency differences that emerge due to different (distance-dependent) transduction latencies of auditory and visual signals - through psychophysical measurements and modeling. The analysis and specification of a formal model for this process provide convincing evidence to supports a role for causal inference in recalibration."
      }
    ],
    "id": "sa4",
    "doi": "10.7554/eLife.97765.2.sa4",
    "significance": [
      "valuable"
    ],
    "strength": [
      "convincing"
    ]
  },
  "indexContent": "Luhe Li, Fangfang Hong, Stephanie Badde, Michael S Landy <section id=\"1-introduction\"><h1 id=\"s1\" class=\"heading-1\">1 Introduction</h1><p>Perception is not rigid but rather can adapt to the environment. In a multimodal environment, misalignment across the senses can occur because signals in different modalities may arrive with different physical and neural delays in the relevant brain areas (<a href=\"#c12\">Fain, 2019</a>; <a href=\"#c36\">Pöppel, 1988</a>; <a href=\"#c48\">Spence &amp; Squire, 2003</a>). Perceptual misalignment can also arise from changes in the perceptual system relative to the environment, such as when wearing a virtual reality headset or adapting to hearing aids. Cross-modal temporal recalibration serves as a critical mechanism to maintain perceptual synchrony despite changes in the perceptual systems and the environment (reviewed in <a href=\"#c26\">King, 2005</a>; <a href=\"#c56\">Vroomen and Keetels, 2010</a>). This phenomenon is exemplified in audiovisual temporal recalibration, where consistent exposure to audiovisual stimulus-onset asynchrony (SOA) shifts the point of subjective simultaneity between auditory and visual stimuli; as a result, stimuli perceived as temporally discrepant at first are gradually perceived as more synchronous (<a href=\"#c11\">Di Luca et al., 2009</a>; <a href=\"#c13\">Fujisaki et al., 2004</a>; <a href=\"#c16\">Hanson et al., 2008</a>; <a href=\"#c18\">Harrar &amp; Harris, 2008</a>; <a href=\"#c20\">Heron et al., 2007</a>; <a href=\"#c25\">Keetels &amp; Vroomen, 2007</a>; <a href=\"#c34\">Navarra et al., 2005</a>; <a href=\"#c37\">Roach et al., 2011</a>; <a href=\"#c50\">Tanaka et al., 2011</a>; <a href=\"#c53\">Vatakis et al., 2007</a>, <a href=\"#c54\">2008</a>; <a href=\"#c55\">Vroomen &amp; de Gelder, 2004</a>; <a href=\"#c56\">Vroomen &amp; Keetels, 2010</a>).</p><p>However, the mechanisms of cross-modal temporal recalibration remain unknown. The current models of audiovisual temporal recalibration either did not specify the recalibration process (<a href=\"#c11\">Di Luca et al., 2009</a>; <a href=\"#c33\">Navarra et al., 2009</a>; <a href=\"#c62\">Yarrow et al., 2015</a>), or cannot fully capture the characteristics of recalibration effects (<a href=\"#c37\">Roach et al., 2011</a>; <a href=\"#c45\">Sato &amp; Aihara, 2011</a>; <a href=\"#c62\">Yarrow et al., 2015</a>). Specifically, audiovisual temporal recalibration shows two distinct characteristics: the amount of recalibration is nonlinear and asymmetric as a function of the SOA participants are adapted to (adapter SOA). The amount of recalibration is not proportional to the adapter SOA, but instead plateaus at an SOA of approximately 100–300 ms (<a href=\"#c13\">Fujisaki et al., 2004</a>; <a href=\"#c55\">Vroomen &amp; de Gelder, 2004</a>). Recalibration can also be asymmetrical: the magnitude of recalibration differs when the visual stimulus leads during the exposure phase compared to when the auditory stimulus leads (<a href=\"#c13\">Fujisaki et al., 2004</a>; <a href=\"#c35\">O’Donohue et al., 2022</a>; <a href=\"#c51\">Van der Burg et al., 2013</a>). These observations can provide insights into the mechanisms of cross-modal temporal recalibration.</p><p>Here, we propose a causal-inference model to explain the mechanism of audiovisual temporal recalibration. Causal inference is the process in which the observer determines whether multisensory signals originate from a common source and should be integrated or kept separate (<a href=\"#c46\">Sato et al., 2007</a>; <a href=\"#c47\">Shams &amp; Beierholm, 2010</a>; <a href=\"#c58\">Wei &amp; Körding, 2009</a>). Bayesian models based on causal inference have been proposed to explain multisensory integration effects (<a href=\"#c27\">Körding et al., 2007</a>; <a href=\"#c46\">Sato et al., 2007</a>), and these models have been empirically validated in studies of spatial audiovisual and visual-tactile integration (<a href=\"#c6\">Badde, Navarro, &amp; Landy, 2020</a>; <a href=\"#c7\">Beierholm et al., 2009</a>; <a href=\"#c40\">Rohe &amp; Noppeney, 2015</a>; <a href=\"#c59\">Wozny et al., 2010</a>). In the temporal domain, some studies have successfully used causal inference to model the integration of cross-modal relative timing, accurately predicting simultaneity judgments in audiovisual speech (<a href=\"#c30\">Magnotti et al., 2013</a>) and more complex scenarios involving one auditory and two visual stimuli (<a href=\"#c44\">Sato, 2021</a>). In the context of cross-modal recalibration, causal inference is expected to play a role based on the intuition that recalibration should be reduced when the multisensory signals are not perceived as causally related (<a href=\"#c13\">Fujisaki et al., 2004</a>; <a href=\"#c24\">Hsiao et al., 2022</a>; <a href=\"#c55\">Vroomen &amp; de Gelder, 2004</a>). Supporting this, causal-inference models successfully predicted cross-modal spatial recalibration of visual-auditory (<a href=\"#c22\">Hong, 2023</a>; <a href=\"#c23\">Hong et al., 2021</a>; <a href=\"#c46\">Sato et al., 2007</a>) and visuo-tactile (<a href=\"#c6\">Badde, Navarro, &amp; Landy, 2020</a>) signals. Building on this framework, here we propose a causal-inference model for cross-modal temporal recalibration that derives the multisensory percept based on inferences about the shared origin of the signals and updates the cross-modal temporal biases such that subsequent measurements are shifted toward the percept.</p><p>The first aim of this study is to test whether performing causal inference is necessary to explain the nonlinearity of audiovisual temporal recalibration across different adapter SOAs. To this aim, we compared the causal-inference model with two alternatives: an asynchrony-contingent model and an asynchrony-correction model. The asynchrony-contingent model scales the amount of recalibration by the likelihood that the sensory measurement of SOA was caused by a synchronous audiovisual stimulus pair. The model predicts a nonlinear recalibration effect across adapter SOAs without requiring observers to perform full Bayesian inference. The asynchrony-correction model assumes that recalibration only occurs when an asynchronous onset of the cross-modal stimuli is registered, followed by the update of the cross-modal temporal bias to compensate for this SOA measurement. This account is based on the intuitive rationale that repeated measurements of asynchrony can prompt the perceptual system to restore coherence. In contrast, this model predicts minimal recalibration when the adapter SOA falls within the range of measured asynchronies that can arise with simultaneously presented stimuli due to sensory noise. This model serves as the baseline for model comparison.</p><p>The second aim was to examine factors that had the potential to drive the asymmetry of recalibration across visual-leading and auditory-leading adapter SOAs. It has been suggested that the asymmetry may be explained by physical and neural latency differences between signals (<a href=\"#c35\">O’Donohue et al., 2022</a>; <a href=\"#c51\">Van der Burg et al., 2013</a>). These latency differences can vary significantly based on the physical distance between the stimulus and the sensors, as well as the neural transmission time required for the signal to reach the relevant sensory region (<a href=\"#c6\">Badde, Navarro, &amp; Landy, 2020</a>; <a href=\"#c21\">Hirsh &amp; Sherrick, 1961</a>; <a href=\"#c26\">King, 2005</a>). While these latency differences can explain the audiovisual temporal bias observed in most humans, they would affect recalibration to different adapter SOAs equally, making it unlikely for any asymmetry to arise. In contrast to latency differences, sensory uncertainty has been shown to affect the degree of cross-modal recalibration in a complex fashion (<a href=\"#c6\">Badde, Navarro, &amp; Landy, 2020</a>; <a href=\"#c23\">Hong et al., 2021</a>; <a href=\"#c52\">van Beers et al., 2002</a>). We hypothesized that the difference across modalities in the variability of the arrival times, the time it takes visual and auditory signals to arrive in the relevant brain areas, plays a critical role in the asymmetry of cross-modal temporal recalibration.</p><p>To examine the mechanism underlying audiovisual temporal recalibration, we manipulated the adapter SOA cross sessions, introducing asynchronies up to 0.7 s of either auditory or visual lead. Before and after the exposure phase in each session, we measured participants’ perception of audiovisual relative timing using a ternary temporal-order-judgement (TOJ) task. To preview the empirical results, we confirmed the nonlinearity of the recalibration effect: recalibration magnitude increased linearly for short adapter SOAs, but then reached an asymptote or even decreased with increasing adapter SOAs. Furthermore, participants showed idiosyncratic asymmetries of the recalibration effect across modalities; for most participants, the amount of recalibration was larger when the auditory stimulus led than when it lagged, but the opposite was found for other participants. To scrutinize the factors that might drive the nonlinearity and asymmetry of temporal recalibration, we fitted six models to the data. These models based the amount of recalibration either on perceptual causal-inference processes, a heuristic evaluation of the common cause of the audiovisual stimuli, or a fixed criterion for the need to correct asynchrony. For each of these three models we implemented either modality-specific or modality-independent precision of the arrival times. The model comparison revealed that the assumptions of Bayesian causal inference combined with modality-specific precision are essential to accurately capture the nonlinearity and idiosyncratic asymmetry of temporal recalibration.</p><h1 id=\"s2\" class=\"heading-1\">2 Results</h1><h2 id=\"s2a\" class=\"heading-2\">2.1 Behavioral results</h2><p>We adopted a classical three-phase recalibration paradigm in which participants completed a pre-test, an exposure phase, and a post-test in each session. In pre- and post-tests, we measured participants’ perception of audiovisual relative timing using a ternary TOJ task: participants reported the perceived order (“visual first,” “auditory first,” or “simultaneous”) of audiovisual stimulus pairs with varying SOA (range: from -0.5 to 0.5 s with 15 levels; <a href=\"#fig1\">Figure 1A</a>). In the exposure phase, we induced temporal recalibration by having participants perform a control task, the oddball-detection task. Specifically, participants were exposed to a series of audiovisual stimuli with a consistent SOA (250 trials; <a href=\"#fig1\">Figure 1B</a>). To ensure that participants were attentive to the stimuli, we inserted oddball stimuli with greater intensity in either one or both modalities (5% of the total trials independently sampled for each modality). Participants were instructed to press a key corresponding to the auditory, visual, or both oddballs whenever an oddball stimulus appeared. The high <em>d</em>′ of oddball-detection performance (auditory <em>d</em>′ = 3.34±0.54, visual <em>d</em>′ = 2.44±0.72) indicates that participants paid attention to both modalities. The post-test was almost identical to the pre-test, except that before every temporal-order-judgment trial, there were three top-up oddball-detection trials to maintain the recalibration effect. In total, participants completed nine sessions on separate days. The adapter SOA (range: -0.7 to 0.7 s) was fixed within a session, but varied randomly across sessions and participants.</p><div class=\"figure-container\"><figure class=\"figure\" id=\"fig1\"><label class=\"figure__label\">Figure 1:</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_fig1.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_fig1.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><p>Task timing. (A) Temporal-order-judgment task administered in the pre- and post-tests. In each trial, participants made a temporal-order judgment in response to an audiovisual stimulus pair with a varying stimulus-onset asynchrony (SOA). Negative values: auditory lead; positive values: visual lead. The contrast of the visual stimulus has been increased for this illustration. (B) Oddball-detection task performed in the exposure phase and top-up trials during the post-exposure test phase. Participants were repeatedly presented with an audiovisual stimulus pair with a SOA that was fixed within each session but varied across sessions. Occasionally, the intensity of either one or both of the stimuli was increased. Participants were instructed to press a key corresponding to the auditory, visual, or both oddballs whenever an oddball stimulus appeared.</p></figcaption></figure></div><p>We compared the temporal-order judgments between the pre- and post-tests to examine the amount of audiovisual temporal recalibration induced by the audiovisual stimuli during the exposure phase. Specifically, we fitted the data from the pre- and post-tests jointly assuming different points of subjective simultaneity (PSS) between the two tests while assuming the same shape for the psychometric functions that is determined by the relative arrival-latencies, their precision, and fixed response criteria (<a href=\"#fig2\">Figure 2A</a>; see Supplement Section 1 for the formalization of the atheoretical model and an alternative model assuming a shift in the response criteria due to recalibration). The PSS is the physical SOA that corresponds to the maximum probability of reporting simultaneity (<a href=\"#c49\">Sternberg &amp; Knoll, 1973</a>). The amount of audiovisual temporal recalibration was defined as the difference between the two PSS’s. At the group level, we observed a nonlinear pattern of recalibration as a function of the adapter SOA: the amount of recalibration in the direction of the adapter SOA first increased but then plateaued with increasing magnitude of the adapter SOA, the SOA of the pairs presented during the exposure phase (<a href=\"#fig2\">Figure 2B</a>). Additionally, we observed an asymmetry in the amount of recalibration between auditory-leading and visual-leading adapter SOAs, with auditory-leading adapter SOAs inducing a greater amount of recalibration (<a href=\"#fig2\">Figure 2B</a>; see Supplement Figure S2A for individual participants’ data). To quantify this asymmetry for each participant, we calculated an asymmetry index, defined as the sum of the recalibration effects across all adapter SOAs (zero: no evidence for asymmetry; positive values: greater recalibration given visual-lead adapters; negative: greater recalibration given auditory-lead adapters). For each participant, we bootstrapped the temporal-order judgments to obtain a 95% confidence interval for the asymmetry index. Eight out of nine participants showed an asymmetry index significantly different from zero, with the majority showing greater recalibration for auditory-leading adapter SOAs, suggesting a general asymmetry in recalibration (Supplement Figure S2B).</p><div class=\"figure-container\"><figure class=\"figure\" id=\"fig2\"><label class=\"figure__label\">Figure 2:</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_fig2.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_fig2.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><p>Behavioral results. (A) The probability of reporting that the auditory stimulus came first (blue), the two arrived at the same time (green), or the visual stimulus came first (red) as a function of SOA for a representative participant in a single session. The adapter SOA was -0.3 s for this session. Curves: best-fitting psychometric functions estimated jointly using the data from the pre-test (dashed) and post-test (solid). Shaded areas: 95% bootstrapped confidence intervals. (B) Mean recalibration effects averaged across all participants as a function of adapter SOA. The recalibration effects are defined as the shifts in the point of subjective simultaneity (PSS) from the pre-to the post-test, where the PSS is the physical SOA at which the probability of reporting simultaneity is maximized. Error bars: ±SEM.</p></figcaption></figure></div><h2 id=\"s2b\" class=\"heading-2\">2.2 Modeling results</h2><p>In the following sections, we describe our models for cross-modal temporal recalibration by first laying out the general assumptions of these models, and then elaborating on the differences between them. Then, we compare the models’ ability to capture the observed data.</p><h3 id=\"s2b1\" class=\"heading-3\">2.2.1 General model assumptions</h3><p>We formulated six process models of cross-modal temporal recalibration (<a href=\"#fig3\">Figure 3</a>). These models share several assumptions about audiovisual temporal perception and recalibration that we selected based on a comparison of atheoretical, descriptive models of our data (Supplement Section 1). First, when an auditory and a visual signal are presented, the corresponding neural signals arrive in the relevant brain areas with a variable latency due to internal and external noise. We assume arrival times for the two modalities are independent and that the arrival latencies are exponentially distributed (<a href=\"#c14\">García-Pérez &amp; Alcalá-Quintana, 2012</a>) (<a href=\"#fig3\">Figure 3A</a>, left panel). Moreover, we assume a constant offset between auditory and visual arrival times, reflecting an audiovisual temporal bias. A simple derivation shows that the resulting measurement of SOA has a double-exponential distribution (<a href=\"#fig3\">Figure 3A</a>, right panel; see derivation in Supplement Section 3). The probability density function peaks at a SOA that is the physical SOA of the stimuli plus the participant’s audiovisual temporal bias. The slopes of the measurement distribution reflect the precision of the arrival times; the steeper the slope, the more precise the measured latency. When the precision differs between modalities, the measurement distribution of the SOA between the auditory and visual stimuli is asymmetrical (<a href=\"#fig3\">Figure 3B</a>).</p><div class=\"figure-container\"><figure class=\"figure\" id=\"fig3\"><label class=\"figure__label\">Figure 3:</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_fig3.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_fig3.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><p>Illustration of the six observer models of cross-modal temporal recalibration. (A) Left: Arrival-latency distributions for auditory (blue) and visual (red) sensory signals. When the precision of arrival latency is modality-independent, these two exponential distributions have identical shape. Right: The resulting symmetrical double-exponential measurement distribution of the SOA of the stimuli. (B) When the precision of the arrival latencies is modality-dependent, the arrival-latency distributions for auditory and visual signals have different shapes, and the resulting measurement distribution of the SOA is asymmetrical. (C) Bias update rules and predicted recalibration effects for the three contrasted recalibration models: The causal-inference model updates the audiovisual bias based on the difference between the estimated and measured SOA. The asynchrony-contingent model updates the audiovisual bias by a proportion of the measured SOA and modulates the update rate by the likelihood that the measured sensory signals originated from a simultaneous audiovisual pair. The asynchrony-correction model adjusts the audiovisual bias by a proportion of the measured SOA when this measurement exceeds fixed critera for simultaneity.</p></figcaption></figure></div><p>Second, these models define temporal recalibration as the accumulation of updates to the audiovisual temporal bias after each encounter with an SOA. The accumulated shift in the audiovisual bias at the end of the exposure phase is then carried over to the post-test phase and persists throughout. Lastly, the bias is assumed to be reset to the same initial value in the pre-test across all nine sessions, reflecting the stability of the audiovisual temporal bias over time (<a href=\"#c15\">Grabot &amp; van Wassenhove, 2017</a>).</p><h3 id=\"s2b2\" class=\"heading-3\">2.2.2 Models of cross-modal temporal recalibration</h3><p>The six models we tested differed in the mechanism governing the updates of the audiovisual bias during the exposure phase as well as the modality-specificity of the precision of arrival times.</p><p>We formulated a temporal variant of the spatial Bayesian causal-inference model of recalibration (<a href=\"#c6\">Badde, Navarro, &amp; Landy, 2020</a>; <a href=\"#c22\">Hong, 2023</a>; <a href=\"#c23\">Hong et al., 2021</a>; <a href=\"#c46\">Sato et al., 2007</a>) to describe the recalibration of the relative timing between cross-modal stimuli (<a href=\"#fig3\">Figure 3C</a>, left panel). In this model, when an observer is presented with an audiovisual stimulus pair during the exposure phase, they compute two intermediate estimates of the SOA between the stimuli, one for the common-cause scenario and the other for the separate-cause scenario. In the common-cause scenario, the estimated SOA of the stimuli is smaller than the measured SOA as it is combined with a prior distribution over SOA that reflects simultaneity. In the separate-causes scenario, the estimated SOA is approximately equal to the measured SOA. The two estimates are then averaged with each one weighted by the posterior probability of the corresponding causal scenario. The audiovisual bias is then updated to reduce the difference between the measured SOA and the combined estimate of the SOA. In other words, causal inference regulates the recalibration process by shifting the measured SOA to more closely match the percept, which in turn is computed based on the inferred causal structure. The asynchrony-contingent model assumes that the observer estimates the likelihood that the sensory signals originated from a simultaneous audiovisual pair and updates the audiovisual bias by a proportion of measured SOA scaled by this likelihood (<a href=\"#fig3\">Figure 3C</a>, middle panel). There is a key distinction between the likelihood of simultaneity and the likelihood of a common cause. The likelihood of a common cause considers the prior distribution of SOAs when signals originate from the same source, including nonzero probabilities for SOAs ≠ 0. In contrast, the likelihood of simultaneity exclusively considers the case when SOA = 0. Additionally, we assume that asynchrony-contingent observer computes the likelihood of simultaneity based on the knowledge of the double-exponential measurement distribution, instead of assuming a Gaussian measurement distribution as was done previously (<a href=\"#c31\">Maij et al., 2009</a>). The update rate of the audiovisual bias is proportional to this likelihood. For a stimulus pair with a large SOA, the average likelihood of the stimuli being physically simultaneous decreases, leading to reduced recalibration effects compared to stimulus pairs with smaller SOAs. Thus, this asynchrony-contingent model is capable of replicating the nonlinearity of recalibration across adapter SOAs without requiring the observer to perform full Bayesian inference.</p><p>The asynchrony-correction model assumes that the observer first compares the sensory measurement of SOA to their criteria for audiovisual simultaneity to decide whether to recalibrate in a given trial. If the measured SOA falls within the range perceived as simultaneous according to the fixed criteria, the observer might attribute a non-zero measurement of SOA to sensory noise and omit recalibration. On the other hand, if the measured SOA exceeds this range, the observer perceives the stimuli as asynchronous, and shifts the audiovisual bias by a proportion of the measurement of SOA (<a href=\"#fig3\">Figure 3C</a>, right panel). This model serves as a direct contrast to the causal-inference model, as it predicts an opposite pattern: a nonlinear but monotonic increase in temporal recalibration, with minimal recalibration when the measured SOA falls within the simultaneity range and increasing recalibration as the measured SOA moves further outside of this range.</p><p>We additionally assumed either modality-specific or modality-independent precision of the arrival times. Each choice suggests a different origin of the variability. Either the variability of the arrival times is limited by neural-latency noise in each sensory channel (<a href=\"#c61\">Yarrow et al., 2022</a>) and thus is modality-specific or the variability of arrival times results from the variability in a central timing mechanism (<a href=\"#c21\">Hirsh &amp; Sherrick, 1961</a>) and is thus modality-independent.</p><h3 id=\"s2b3\" class=\"heading-3\">2.2.3 Model fitting and model comparison</h3><p>We fitted six models to each participant’s data. Each model was constrained jointly by the temporal-order judgments from the pre- and post-tests of all nine sessions. To quantify model performance, we calculated model evidence, i.e., the likelihood of each model given the data marginalized over all possible parameters, which revealed that the causal-inference model had the strongest model evidence at the group level and best fit the data of most participants, followed by the asynchrony-contingent model and then the asynchrony-correction model. To quantify the differences between model performance, we performed a Bayesian model comparison by computing the Bayes factor for each model relative to the worst-performing model, the asynchrony-correction model with modality-independent arrival-latency precision (<a href=\"#fig4\">Figure 4A</a>, see Supplement Figure S3 for individual-level model comparison). Within each of these three model categories, the version incorporating modality-specific precision consistently outperformed the modality-independent version.</p><div class=\"figure-container\"><figure class=\"figure\" id=\"fig4\"><label class=\"figure__label\">Figure 4:</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_fig4.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_fig4.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><p>Model comparison and predictions. (A) Model comparison based on model evidence. Each bar represents the group-averaged log Bayes Factor of each model relative to the asynchrony-correction, modality-independent-precision model, which had the weakest model evidence. (B) Empirical data (points) and model predictions (lines and shaded regions) for the recalibration effect as a function of adapter SOA.</p></figcaption></figure></div><h3 id=\"s2b4\" class=\"heading-3\">2.2.4 Model prediction</h3><p>To inspect the quality of the model fit, for every model, we used the best-fitting parameter estimates for each participant to predict the group-average recalibration effect as a function of adapter SOA (<a href=\"#fig4\">Figure 4B</a>). The nonlinearity of audiovisual temporal recalibration across adapter SOAs was captured by both the asynchrony-contingent and causal-inference models. Nonetheless, the causal-inference model outperformed the asynchrony-contingent model by accurately predicting a non-zero average recalibration effect at adapter SOAs of 0.7 s and -0.7 s, where the asynchrony-contingent model predicted no recalibration. Additionally, incorporating modality-specific precision enabled both the asynchrony-contingent and causal-inference models to more accurately predict increased recalibration when the adapter SOA was auditory-leading. Overall, the model that relies on causal inference during the exposure phase and assumes modality-specific precision of arrival times most accurately captured both the nonlinearity and asymmetry of the recalibration effect. This model could also account for individual participants’ idiosyncratic asymmetry in temporal recalibration to auditory- and visual-leading adapter SOAs (see Supplement Figure S4 for predictions of individual participants’ recalibration effects of all models; see Figure S6 for predictions of individual participants’ TOJ responses using the causal-inference models with modality-specific precision).</p><h3 id=\"s2b5\" class=\"heading-3\">2.2.5 Model simulation</h3><p>Simulations with the causal-inference model revealed which factors of the modeled recalibration process determine the degree of nonlinearity and asymmetry of cross-modal temporal recalibration to different adapter SOAs. The prior belief that the auditory and visual stimuli share a common cause plays a crucial role in adjudicating the relative influence of the two causal scenarios (<a href=\"#fig5\">Figure 5A</a>). When the observer has a prior belief that audiovisual stimuli always originate from the same source, they recalibrate by a proportion of the perceived SOA no matter how large the measured SOA is, mirroring the behavior of the asynchrony-correction model when its criteria for simultaneity are such that no stimuli are treated as simultaneous. On the other hand, when the observer believes that the audiovisual stimuli always have separate causes, they treat the audiovisual stimuli as independent of each other and do not recalibrate. Estimates of the common-cause prior for our participants fall between the two extreme beliefs, resulting in the nonlinear pattern of recalibration that lies between the extremes of no recalibration and the proportional recalibration effects as a function of the adapter SOA (see Supplement Section 6.1 for parameter estimates for individual participants).</p><div class=\"figure-container\"><figure class=\"figure\" id=\"fig5\"><label class=\"figure__label\">Figure 5:</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_fig5.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_fig5.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><p>Simulation of temporal recalibration using the causal-inference model. (A) The influence of the observer’s prior assumption of a common cause: the stronger the prior, the larger the recalibration effects. (B) The influence of latency noise: recalibration effects increase with decreasing sensory precision (i.e., increasing latency noise captured by the exponential time constant) of both modalities. (C) The influence of auditory/visual latency noise: recalibration effects are asymmetric between auditory-leading and visual-leading adapter SOAs due to differences in the precision of auditory and visual arrival latencies. Left panel: Increasing auditory latency precision (i.e., reducing auditory latency noise) reduces recalibration in response to visual-leading adapter SOAs. Right panel: Increasing visual precision (i.e., reducing visual latency noise) reduces recalibration in response to auditory-leading adapter SOAs.</p></figcaption></figure></div><p>Simulations also identified key model elements of the causal-inference model that predict a non-zero recalibration effect even at large SOAs, a feature that distinguishes the causal-inference from the asynchrony-contingent model. This non-zero recalibration effect for large adapter SOAs can be replicated by either assuming a strong prior for a common cause (<a href=\"#fig5\">Figure 5A</a>) or by assuming low sensory precision of arrival times (<a href=\"#fig5\">Figure 5B</a>). Both relationships are intuitive: observers with a stronger prior belief in a common cause and ideal observers with lower sensory precision are more likely to assign a higher posterior probability to the common-cause scenario, leading to greater recalibration. A decrease of the spread of the prior distribution over SOA conditioned on a common cause increases the recalibration magnitude, but only over a small range of SOAs for which there is a higher probability of the common-cause scenario (Supplement Figure S8A), and thus cannot account for non-zero recalibration for large SOAs.</p><p>Differences in arrival-time precision between audition and vision result in an asymmetry of audiovisual temporal recalibration across adapter SOAs (<a href=\"#fig5\">Figure 5C</a>). The amount of recalibration is attenuated when the modality with the higher precision lags the less precise one during the exposure phase. When the more recent stimulus component in a cross-modal pair is more precise, the perceptual system is more likely to attribute the asynchrony to separate causes and thus recalibrate less. In addition, the fixed audiovisual bias does not affect asymmetry, but shifts the recalibration function laterally and determines the adapter SOA for which no recalibration occurs (Supplement Figure S8B).</p><h1 id=\"s3\" class=\"heading-1\">3 Discussion</h1><p>This study scrutinized the mechanism underlying audiovisual temporal recalibration. We measured the effects of exposure to audiovisual stimulus pairs with a constant temporal offset (adapter SOA) on audiovisual temporal-order perception across a wide range of adaptor SOAs. Recalibration effects changed nonlinearly with the magnitude of adapter SOAs and were asymmetric across auditory-leading and visual-leading adapter SOAs. We then compared the predictions of different observer models for the amount of recalibration as a function of adapter SOA. A Bayesian causal-inference model with modality-specific precision of the arrival latencies fit the observed data best. These findings suggest that human observers rely on causal-inference-based percepts to recalibrate cross-modal temporal perception. These results align closely with studies that have demonstrated the role of causal inference in audiovisual (<a href=\"#c23\">Hong et al., 2021</a>) and visual-tactile spatial recalibration (<a href=\"#c6\">Badde, Navarro, &amp; Landy, 2020</a>). Our results are also consistent with previous recalibration models that assumed a strong relation between perception and recalibration (<a href=\"#c44\">Sato, 2021</a>; <a href=\"#c46\">Sato et al., 2007</a>). Hence, we suggest that the same mechanisms underly cross-modal perception and recalibration across different sensory features.</p><p>The observed recalibration results could not be predicted by the asynchrony-contingent model that employed a heuristic approximation of the causal-inference process. Even though this model was capable of predicting a nonlinear relationship between the recalibration effect and the adapter SOA, it failed to capture a non-zero recalibration effect at large adapter SOAs shown by several of our participants. The reason for that is that this model uses the likelihood of a synchronous audiovisual stimulus pair given the measured SOA to modulate the update rate of audiovisual bias, which will be very small on average for large SOAs. Therefore, the model predicts little to no recalibration at large adaptor SOAs. In contrast, the causal-inference model can capture the non-zero recalibration effect because the common-cause scenario always influences the amount of recalibration even when the adapter SOA is too large to be perceived as synchronous. Simulation (<a href=\"#fig5\">Figure 5A, B</a>) shows that a strong prior belief in a common cause or less precision of arrival times can result in non-zero recalibration effects following exposure to clearly asynchronous stimulus pairs. Notably, even though it might at first seem counter-intuitive that cross-modal temporal recalibration can be elicited by clearly asynchronous streams of sensory information, many of us have experienced this effect during laggy, long video conferences.</p><p>The asynchrony-correction model assumes that observers recalibrate to restore temporal synchrony whenever the SOA measurement indicates a temporal discrepancy, but this model predicts recalibration effects across adapter SOAs that are contrary to our observations. This suggests that cross-modal temporal recalibration is not merely triggered by an asynchronous sensory measurement of SOA and an attempt to correct it. In contrast, the causal-inference model accurately captured the plateau of the recalibration effects as adapter SOA increased, because the probability that the auditory and visual stimuli have separate causes also increased. This resulted in a smaller discrepancy between the sensory measurement and the final percept of the SOA, leading to less recalibration.</p><p>We found that most of our participants exhibited larger recalibration effects in response to exposure to audiovisual stimuli with a consistent auditory lead compared to exposure to a visual lead. This result is consistent with a previous study that reported greater cumulative recalibration in response to audiovisual stimuli with an auditory-lead at the group level (<a href=\"#c35\">O’Donohue et al., 2022</a>). Our simulation results further suggested that this asymmetry in recalibration effects might be due to higher precision of auditory compared to visual arrival latencies. A few participants displayed the opposite pattern: stronger recalibration effects following exposure to visual-leading audiovisual stimuli. This is not surprising, as causal-inference models often reveal substantial individual differences in sensory noise (<a href=\"#c23\">Hong et al., 2021</a>; <a href=\"#c30\">Magnotti et al., 2013</a>). A recent EEG study further provided neural correlates for individual sensory noise by identifying correlations between neural-latency noise and behavioral sensory noise measured from simultaneity-judgment tasks for audiovisual, visuo-tactile, and audio-tactile pairs (<a href=\"#c61\">Yarrow et al., 2022</a>). Therefore, our model explains how individual differences in precision of arrival latency could contribute to the asymmetry in cross-modal temporal recalibration observed in previous studies. For example, <a href=\"#c13\">Fujisaki et al. (2004)</a> found a slightly larger recalibration in response to audiovisual stimuli with a visual lead compared to an auditory lead, while their pilot results with the same design but a wider range of adapter SOAs showed the opposite pattern.</p><p>In order to incorporate causal inference in our recalibration models, we modeled recalibration as a shift of audiovisual bias. Building on previous latency-shift models (<a href=\"#c11\">Di Luca et al., 2009</a>; <a href=\"#c33\">Navarra et al., 2009</a>), we specified a mechanism for how the audiovisual bias is updated during the exposure to an audiovisual SOA. Our model is not mutually exclusive with other models that implement recalibration as a shift of simultaneity criteria (Yarrow, Jahn, et al., 2011; <a href=\"#c62\">Yarrow et al., 2015</a>), or a change of sensitivity to discriminate SOA (<a href=\"#c43\">Roseboom et al., 2015</a>). A possible implementation of recalibration at the circuity level is given by models assuming that audiovisual offsets are encoded by populations of neurons tuned to different SOAs. In these models, recalibration is the consequence of selective gain reduction of neurons tuned to SOAs similar to the adapter SOA (<a href=\"#c9\">Cai et al., 2012</a>; <a href=\"#c37\">Roach et al., 2011</a>; <a href=\"#c62\">Yarrow et al., 2015</a>). Simulations show that this model can predict nonlinear recalibration effects as a function of adapter SOA depending on the number of neurons and the range of preferred SOAs (Supplementary Section S8). However, to capture the asymmetric recalibration effects depending on which modality leads, one needs to incorporate inhomogenous neuronal selectivity, i.e., unequal tuning curves, for auditory-leading and visual-leading SOAs.</p><p>Causal inference may effectively function as a credit-assignment mechanism to enhance perceptual accuracy during recalibration. In sensorimotor adaptation, humans correct motor errors that are more likely attributed to their own motor system rather than to the environment (<a href=\"#c8\">Berniker &amp; Kording, 2008</a>; <a href=\"#c58\">Wei &amp; Körding, 2009</a>). In visuomotor adaptation, substantial temporal recalibration occurs in response to exposure to movement-leading SOAs but less so to visual-leading SOAs (<a href=\"#c38\">Rohde &amp; Ernst, 2012</a>; <a href=\"#c39\">Rohde et al., 2014</a>), because only movement-leading SOAs can be interpreted as causally linked sensory feedback from a preceding movement.</p><p>Causal-inference-based recalibration can further solve the conundrum that humans, despite our ability for cross-modal temporal recalibration, show persistent temporal biases (<a href=\"#c15\">Grabot &amp; van Wassenhove, 2017</a>). These audiovisual and visual-tactile temporal biases appear to be shaped by early sensory experience (Badde, Ley, et al., 2020) and seem to be resistant to recalibration. The persistence of these biases contradicts recalibration models that reduce the measured cross-modal asynchrony. Instead, our causal-inference-based models of recalibration include an assumption that recalibration eliminates the discrepancy between measured and inferred asynchrony, both of which are influenced by cross-modal biases.</p><p>Previous studies have probed the role of causal inference for temporal recalibration and perception by experimentally varying task-irrelevant cues to a shared origin of the cross-modal stimuli, with mixed results. Earlier studies found no significant change in temporal recalibration when altering the sound presentation method (headphones versus a speaker) or switching the presentation ear (<a href=\"#c13\">Fujisaki et al., 2004</a>), nor did recalibration effects vary with the spatial alignment of the audiovisual stimulus pair (<a href=\"#c25\">Keetels &amp; Vroomen, 2007</a>). However, subsequent studies provide evidence that spatial grouping influences temporal recalibration, with the PSS shifting toward the temporal relationship suggested by spatially co-located stimuli (<a href=\"#c19\">Heron et al., 2012</a>; <a href=\"#c63\">Yarrow, Roseboom, &amp; Arnold, 2011</a>). Others found that spatial cues (<a href=\"#c19\">Heron et al., 2012</a>; <a href=\"#c64\">Yuan et al., 2012</a>) and featural content cues (<a href=\"#c41\">Roseboom &amp; Arnold, 2011</a>; <a href=\"#c42\">Roseboom et al., 2013</a>; <a href=\"#c64\">Yuan et al., 2012</a>) are both determinants of cross-modal temporal recalibration. The feature content cues can be natural stimuli, such as male or female audiovisual speech, or simple stimuli, such as high-pitch sounds paired with vertically oriented Gabor patches. Recent studies on audiovisual integration have extended causal-inference models to account for both the spatial position and temporal discrepancy of audiovisual signals (<a href=\"#c22\">Hong, 2023</a>; <a href=\"#c32\">McGovern et al., 2016</a>). These studies suggest that both temporal and spatial information are taken into account for causal inference. In contrast, perceived conflicts in task-irrelevant features of visual-haptic stimuli do not influence the integration of task-relevant features, suggesting that causal inference is feature-specific rather than pertaining to whole objects (<a href=\"#c4\">Badde et al., 2023</a>).</p><h1 id=\"s4\" class=\"heading-1\">4 Conclusion</h1><p>In sum, we found that both causal inference and modality-specific precision are essential for accurately modeling audiovisual temporal recalibration. Although cross-modal temporal recalibration is typically viewed as an early-stage, low-level perceptual process, our findings indicate that it is closely connected to higher cognitive functions.</p><h1 id=\"s5\" class=\"heading-1\">5 Methods</h1><h2 id=\"s5a\" class=\"heading-2\">5.1 Participants</h2><p>Ten students from New York University (three males; age: 24.4 ± 1.77; all right-handed) participated in the experiment. They all reported normal or corrected-to-normal vision. All participants provided informed written consent before the experiment and received $15/hr as monetary compensation. The study was conducted in accordance with the guidelines laid down in the Declaration of Helsinki and approved by the New York University institutional review board. One out of ten participants was identified as an outlier and therefore excluded from further data analysis (Supplement Figure S9).</p><h2 id=\"s5b\" class=\"heading-2\">5.2 Apparatus and stimuli</h2><p>Participants completed the experiments in a dark and semi sound-attenuated room. They were seated 1 m from an acoustically transparent, white screen (1.36 × 1.02 m, 68 × 52° visual angle) and placed their head on a chin rest. An LCD projector (Hitachi CP-X3010N, 1024 × 768 pixels, 60 Hz) was mounted above and behind participants to project visual stimuli on the screen. The visual and auditory stimulus durations were 33.33 ms. The visual stimulus was a high-contrast (36.1 cd<em>/</em>m<sup>2</sup>) Gaussian blob (SD: 3.6°) on a gray background (10.2 cd<em>/</em>m<sup>2</sup>) projected onto the screen. The auditory stimulus was a 500 Hz beep (50 dB SPL) without a temporal window due to its short duration, which was played by a loudspeaker located behind the center of the screen. Some visual and auditory stimuli were of higher intensity, the parameters of these stimuli were determined individually (see Intensity-discrimination task). We adjusted the timing of audiovisual stimulus presentation and verified the timing using an oscilloscope (PICOSCOPE 2204A).</p><h2 id=\"s5c\" class=\"heading-2\">5.3 Procedure</h2><p>The experiment consisted of nine sessions, which took place on nine separate days. In each session, participants completed a pre-test, an exposure, and a post-test phase in sequence. The adapter SOA was fixed within a session, but varied across sessions (±700, ±300, ±200, ±100, 0 ms). The order of the adapter SOA was randomized across participants, with sessions separated by at least one day. The intensities of the oddball stimuli were determined prior to the experiment for each participant using an intensity-discrimination task to equate the difficulty of detecting oddball stimuli between participants and across modalities.</p><h3 id=\"s5c1\" class=\"heading-3\">5.3.1 Pre-test phase</h3><p>Participants completed a ternary TOJ task during the pre-test phase. Each trial started a fixation cross (0.1–0.2 s, uniform distribution; <a href=\"#fig1\">Fig. 1A</a>), followed by a blank screen (0.4–0.6 s, uniform distribution). Then, an auditory and a visual stimulus (0.033 s) were presented with a variable SOA. There were a total of 15 possible test SOAs (±0.5 s and from -0.3 to 0.3 s in steps of 0.05 s), with positive values representing visual lead and negative values representing auditory lead. Following stimulus presentation there was another blank screen (0.4–0.6 s, uniform distribution), and then a response probe appeared on the screen. Participants indicated by button press whether the auditory stimulus occurred before or after the visual stimulus, or the two were simultaneous. There was no time limit for the response, and response feedback was not provided. The inter-trial interval (ITI) was 0.2–0.4 s (uniform distribution). Each test SOA was presented 20 times in pseudo-randomized order, resulting in 300 trials in total, divided into five blocks. Participants usually took around 15 minutes to finish the pre-test phase.</p><h3 id=\"s5c2\" class=\"heading-3\">5.3.2 Exposure phase</h3><p>Participants completed an oddball-detection task during the exposure phase. In each trial, participants were presented with an audiovisual stimulus pair with a fixed SOA (adapter SOA). In 10% of trials, the intensity of either the visual or the auditory component (or both) was greater than in the other trials. Participants were instructed to press the corresponding button as soon as possible to indicate whether there was an auditory oddball, a visual oddball, or both stimuli were oddballs. The task timing (<a href=\"#fig1\">Fig. 1B</a>) was almost identical to the ternary TOJ task, except that there was a response time limit of 1.4 s. Prior to the exposure phase, participants practiced the task for as long as needed to familiarize themselves with the task. During this practice, they were presented with bimodal stimuli with the same adapter SOA used in the exposure phase. There were a total of 250 trials, divided into five blocks. At the end of each block, we presented a performance summary with the hit rate and false alarm rate of each modality. Participants usually took 15 minutes to complete the exposure phase.</p><h3 id=\"s5c3\" class=\"heading-3\">5.3.3 Post-test phase</h3><p>Participants completed the ternary TOJ task as well as the oddball-detection task during the post-test phase. Specifically, each temporal-order judgment was preceded by three top-up (oddball-detection) trials. The adapter SOA in the top-up trials was the same as that in the exposure phase to prevent dissipation of temporal recalibration (<a href=\"#c28\">Machulla et al., 2012</a>). Both visual and auditory <em>d</em>′ remained consistent from the exposure to post-test phases, indicating similar performance in the top-up trials to performance during the exposure phase (Supplement Figure S10). To facilitate task switching, the ITI between the last top-up trial and the following TOJ trial was longer (with the additional time jittered around 1 s). Additionally, the fixation cross was displayed in red to signal the start of a TOJ trial. As in the pre-test phase, there were 300 TOJ trials (15 test SOAs <em>×</em> 20 repetitions) with the addition of 900 top-up trials, grouped into six blocks. At the end of each block, we provided a summary of the oddball-detection performance. Participants usually took around 1 hour to complete the post-test phase.</p><h3 id=\"s5c4\" class=\"heading-3\">5.3.4 Intensity-discrimination task</h3><p>This task was conducted to estimate the just-noticeable-difference (JND) in intensity for a standard visual stimulus with a luminance of 36.1 cd<em>/</em>m<sup>2</sup> and a standard auditory stimulus with a volume of 40 dB SPL. The task was two-interval, forced choice. The trial started with a fixation (0.1–0.2 s) and a blank screen (0.4–0.6 s). Participants were presented with a standard stimulus (0.033 s) in one randomly selected interval and a comparison stimulus (0.033 s) in the other interval, temporally separated by an inter-stimulus interval (0.6–0.8 s). They indicated which interval contained the brighter/louder stimulus without time constraint. Seven test stimulus levels (luminance range: 5%–195% relative to the standard visual stimulus intensity; volume range: 50%–150% relative to the standard auditory stimulus’ amplitude) were repeated 20 times, resulting in 140 trials for each task. We fit a cumulative Gaussian distribution function to these data and defined the oddball as an auditory or visual stimulus with an intensity judged as more intense than the standard 90% of the time. A higher probability than the standard JND of 75% was selected because the pilot studies showed that the harder oddball detection task became too demanding during the one-hour post-test.</p><h2 id=\"s5d\" class=\"heading-2\">5.4 Modeling</h2><p>In this section, we first outline general assumptions, shared across all candidate models, regarding sensory noise, measurements, and bias. Then, we formalize three process models of recalibration that differ in the implementation of recalibration. In each recalibration model, we also provide a formalization of the ternary TOJ task administered in the pre- and the post-test phases, data from which were used to constrain the model parameters. Finally, we describe how the models were fit to the data.</p><h3 id=\"s5d1\" class=\"heading-3\">5.4.1 General modal assumptions regarding sensory noise, measurements and bias</h3><p>When an audiovisual stimulus pair with a SOA, <em>s</em> = <em>t</em><sub><em>A</em></sub> <em>− t</em><sub><em>V</em></sub>, is presented, it triggers auditory and visual signals that are registered in the relevant region of cortex where audiovisual temporal-order comparisons are made. This leads to two internal measurements of the arrival time for each signal in an observer’s brain. These arrival times are subject to noise and thus vary across presentations of the same physical stimulus pair. As in previous work (<a href=\"#c14\">García-Pérez &amp; Alcalá-Quintana, 2012</a>), we model the probability distribution of the arrival time as shifted exponential distributions (<a href=\"#fig3\">Figure 3A</a>). The arrival time of the auditory signal relative to onset <em>t</em><sub><em>A</em></sub> is the sum of the fixed delay of internal signal, <em>β</em><sub><em>A</em></sub>, and an additional random delay that is exponentially distributed with time constant <em>τ</em><sub><em>A</em></sub>; analogous for the visual latency (with delay <em>β</em><sub><em>V</em></sub> and time constant <em>τ</em><sub><em>V</em></sub>).</p><p>The measured SOA of the audiovisual stimulus pair is modeled as the difference of the arrival times of the two stimuli. Thus, the sensory measurement of SOA, <em>m</em>, reflects the sum of three components: the physical SOA, <em>s</em>; a fixed latency that is the difference between the auditory and visual fixed delay, <em>β</em><sub>pre</sub> = <em>β</em><sub><em>A</em></sub> <em>− β</em><sub><em>V</em></sub>; and the difference between two exponentially distributed random delays. A negative value of <em>β</em><sub>pre</sub> indicates faster auditory processing. We assume that the audiovisual fixed latency corresponds to the observer’s default audiovisual temporal bias (Badde, Ley, et al., 2020; <a href=\"#c15\">Grabot &amp; van Wassenhove, 2017</a>). Thus, we assume that after leaving the experimental room, the default bias is restored and thus consistent across pre-tests.</p><p>We model the recalibration process as a shift of the audiovisual temporal bias at the end of every exposure trial <em>i, β</em><sub><em>i</em></sub> = <em>β</em><sub>pre</sub> +Δ<sub><em>β,i</em></sub>, where <em>β</em><sub><em>i</em></sub> is the current audiovisual bias, and Δ<sub><em>β,i</em></sub> is the cumulative shift of audiovisual temporal bias. After the 250 exposure trials the updated biases can be expresses as <em>β</em><sub>post</sub> = <em>β</em><sub>pre</sub> +Δ<sub><em>β</em>,250</sub>. We also assume that the amounts of auditory and visual latency noise, <em>τ</em><sub><em>A</em></sub> and <em>τ</em><sub><em>V</em></sub>, remain constant across phases and sessions.</p><p>Given that both latency distributions are shifted exponential distributions, the probability density function of the sensory measurements of SOA, <em>m</em>, given physical SOA, <em>s</em>, is a double-exponential function (see derivation in Supplement Section 3; <a href=\"#fig6\">Figure 6A</a>):\n</p><p><picture id=\"eqn1\"><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_eqn1.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_eqn1.gif/full/max/0/default.jpg\" alt=\"\"/></picture></p><div class=\"figure-container\"><figure class=\"figure\" id=\"fig6\"><label class=\"figure__label\">Figure 6:</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_fig6.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_fig6.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><p>Simulating responses of the TOJ task with a causal-inference perceptual process. (A) An example probability density for the measurement of a zero SOA. (B) The probability density of estimates resulting from a zero-SOA stimulus based on simulation using the causal-inference process. The symmetrical criteria around zero partition the distribution of estimated SOA into three regions, coded by different colors. The area under each segment of the estimate distribution corresponds to the probabilities of the three possible intended responses for a zero SOA. (C) The simulated psychometric function computed by repeatedly calculating the probabilities of the three response types across all test SOAs.</p></figcaption></figure></div><p>The probability density function of measured SOA peaks at the physical SOA of the stimuli plus the participant’s audiovisual temporal bias, <em>s</em><sub><em>i</em></sub> + <em>β</em><sub><em>i</em></sub>. The left and right spread of this measurement distribution depends on the amount of the latency noise for the visual, <em>τ</em><sub><em>V</em></sub>, and auditory, <em>τ</em><sub><em>A</em></sub>, signals. In models with modality-independent arrival-time precision, <em>τ</em><sub><em>A</em></sub> = <em>τ</em><sub><em>V</em></sub> and the measurement distribution is symmetrical. This symmetrical measurement distribution is often approximated by a Gaussian distribution to fit TOJ responses in previous temporal-recalibration studies (<a href=\"#c11\">Di Luca et al., 2009</a>; <a href=\"#c13\">Fujisaki et al., 2004</a>; <a href=\"#c17\">Harrar &amp; Harris, 2005</a>; <a href=\"#c25\">Keetels &amp; Vroomen, 2007</a>; <a href=\"#c34\">Navarra et al., 2005</a>; <a href=\"#c50\">Tanaka et al., 2011</a>; <a href=\"#c53\">Vatakis et al., 2007</a>, <a href=\"#c54\">2008</a>; <a href=\"#c57\">Vroomen et al., 2004</a>). Note that we assume the observer has perfect knowledge of the visual and auditory latency noise. Thus, the density of the measurement distribution corresponds to the likelihood function during the inference process when the observer only has the noisy measurement, <em>m</em>, and needs to infer the physical SOA, <em>s</em>.</p><h3 id=\"s5d2\" class=\"heading-3\">5.4.2 The causal-inference model</h3><h4 id=\"s5d2a\" class=\"heading-4\">Formalization of recalibration in the exposure phase</h4><p>The causal-inference model assumes that, at the end of every exposure trial <em>i</em>, a discrepancy between the measured SOA, <em>m</em><sub><em>i</em></sub>, and the final estimate of the stimulus SOA, <em>ŝ</em><sub><em>i</em></sub>, signals the need for recalibration. The cumulative shift of audiovisual temporal bias Δ<sub><em>β,i</em></sub> after exposure trial <em>i</em> is,\n</p><p><picture id=\"eqn2\"><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_eqn2.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_eqn2.gif/full/max/0/default.jpg\" alt=\"\"/></picture></p><p>\nwhere <em>α</em> is the learning rate.</p><p>The ideal observer infers intermediate location estimates for two causal scenarios: the auditory and visual stimuli can arise from a single cause (<em>C</em> = 1) or two independent causes (<em>C</em> = 2). The posterior distribution of the SOA, <em>s</em>, conditioned on each causal scenario is computed by multiplying the likelihood function (<a href=\"#eqn1\">Eq. 1</a>) with the corresponding prior over SOA. In the case of a common cause (<em>C</em> = 1), the prior distribution of the SOA between sound and light is a Gaussian distribution (<a href=\"#c30\">Magnotti et al., 2013</a>; <a href=\"#c32\">McGovern et al., 2016</a>), <picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_inline1.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" class=\"inline-image\" src=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_inline1.gif/full/max/0/default.jpg\" alt=\"\"/></picture>. To maintain consistency with previous studies, we used an unbiased prior which assigns the highest probability to a physically synchronous stimulus pair <em>s</em> = 0. Similarly, the prior distribution conditioned on separate causes (<em>C</em> = 2) is also a Gaussian distribution, <picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_inline2.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" class=\"inline-image\" src=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_inline2.gif/full/max/0/default.jpg\" alt=\"\"/></picture>, with a much larger spread compared to the common-cause scenario. The intermediate estimates <em>ŝ</em><sub><em>C</em>=1</sub> conditioned on the common-cause scenario and <em>ŝ</em><sub><em>C</em>=2</sub> conditioned on separate-cause scenario are the maximum-a-posteriori estimates of conditional posteriors, which are approximated numerically as there is no closed-form solution.</p><p>The final estimate of the stimulus SOA, <em>ŝ</em>, depends on the posterior probability of each causal scenario. According to Bayes Rule, the posterior probability that an audiovisual stimulus pair with the measured SOA, <em>m</em>, shares a common cause is\n</p><p><picture id=\"eqn3\"><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_eqn3.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_eqn3.gif/full/max/0/default.jpg\" alt=\"\"/></picture></p><p>\nThe likelihood of a common source/separate sources for a fixed SOA measurement was approximated by numerically integrating the scenario-specific protoposterior (i.e., the unnormalized posterior),\n</p><p><picture id=\"eqn4\"><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_eqn4.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_eqn4.gif/full/max/0/default.jpg\" alt=\"\"/></picture></p><p>\nThe posterior probability of a common cause additionally depends on the observer’s prior belief of a common cause for auditory and visual stimuli, <em>P</em> (<em>C</em> = 1) = <em>p</em><sub>common</sub>.</p><p>The final estimate of SOA was derived by model averaging, i.e., the average of the scenario-specific SOA estimates, <em>ŝ</em><sub><em>C</em>=1</sub> and <em>ŝ</em><sub><em>C</em>=2</sub> each weighted by the posterior probability of the corresponding causal scenario,\n</p><p><picture id=\"eqn5\"><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_eqn5.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_eqn5.gif/full/max/0/default.jpg\" alt=\"\"/></picture></p><h4 id=\"s5d2b\" class=\"heading-4\">Formalization of the ternary TOJ task with a causal-inference perceptual process</h4><p>In the ternary TOJ task administered in the pre- and post-test phases, the observer is presented with an audiovisual stimulus pair and has to decide whether the auditory stimulus was presented first, the visual stimulus was presented first, or both of them were presented at the same time. The observer makes this perceptual judgment by comparing the final estimate of the SOA, <em>ŝ</em>, to two internal criteria (<a href=\"#c10\">Cary et al., 2024</a>; <a href=\"#c14\">García-Pérez &amp; Alcalá-Quintana, 2012</a>). We assume that the observer has a symmetric pair of criteria, ±<em>c</em>, centered on the stimulus SOA corresponding to perceptual simultaneity (<em>ŝ</em> = 0). In addition, the observer may lapse or make an error when responding by a lapse rate, <em>λ</em>. The probabilities of reporting visual lead, Ψ<sub><em>V</em></sub>, auditory lead, Ψ<sub><em>A</em></sub>, or that the two stimuli were simultaneous, Ψ<sub><em>S</em></sub>, are thus\n</p><p><picture id=\"eqn6\"><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_eqn6.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_eqn6.gif/full/max/0/default.jpg\" alt=\"\"/></picture></p><p>\nThe probability distribution of causal-inference-based SOA estimates <em>P</em> (<em>ŝ</em>|<em>s</em>) has no closed form distribution function and thus was approximated using simulations, resulting in <picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_inline3.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" class=\"inline-image\" src=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_inline3.gif/full/max/0/default.jpg\" alt=\"\"/></picture>. <a href=\"#fig6\">Figure 6</a> illustrates the process of simulating the psychometric functions, using a zero test SOA as an example. First, we sampled 10,000 SOA measurements from the double-exponential probability distribution corresponding to the test SOA of zero (<a href=\"#fig6\">Figure 6A</a>). Second, for each sampled measurement, we simulated the process by which the observer carries out causal inference and by doing so produced an estimate of the stimulus SOA, while keeping the causal-inference model parameters fixed. This process resulted in a Monte-Carlo approximation of the probability density distribution of the causal-inference-based SOA estimates (<a href=\"#fig6\">Figure 6B</a>). Third, we calculated the probability of the three types of responses (<a href=\"#eqn6\">Eq. 6</a>) for this specific test SOA. This process was repeated for each test SOA to generate three psychometric functions (<a href=\"#fig6\">Figure 6C</a>).</p><h3 id=\"s5d3\" class=\"heading-3\">5.4.3 The asynchrony-contingent model</h3><p>In the asynchrony-contingent model, the observer measures the audiovisual SOA, <em>s</em>, by comparing the arrival latency of the auditory and visual signals. The observer uses the likelihood that the audiovisual stimuli occurred simultaneously <em>P</em> (<em>m</em>|<em>SOA</em> = 0) to update the temporal bias during recalibration, instead of performing causal inference. We again assume that the observer has perfect knowledge about the variability and fixed delays of the arrival times and thus assume the likelihood corresponds to the measurement distribution (<a href=\"#eqn1\">Eq. 1</a>). The observer uses this probability of simultaneity to scale the update rate of the audiovisual bias,\n</p><p><picture id=\"eqn7\"><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_eqn7.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_eqn7.gif/full/max/0/default.jpg\" alt=\"\"/></picture></p><p>\nWe assume the observer’s estimate of the stimulus SOA, <em>ŝ</em>, is identical to the measured SOA, <em>m</em>. Thus, from the experimenter’s perspective, the probability of the three different responses in the TOJ task can be obtained by replacing the SOA estimate, <em>ŝ</em>, with the SOA measurement, <em>m</em>, in <a href=\"#eqn6\">Eq. 6</a>). As we know the probability distribution of <em>m</em>, the psychometric functions have a closed form (<a href=\"#c14\">García-Pérez &amp; Alcalá-Quintana, 2012</a>).</p><h3 id=\"s5d4\" class=\"heading-3\">5.4.4 The asynchrony-correction model</h3><p>In the asynchrony-correction model, the observer begins by evaluating if the sensory measurement of SOA, <em>m</em>, falls outside the criterion range for reporting that the two stimuli were presented simultaneously ±<em>c</em>. If the measurement does exceed this criterion, the observer adjusts the audiovisual bias by shifting it against the measurement, i.e., shifting it so that the measured SOA of a pair would be closer to zero and is more likely to perceived as simultaneous. This adjustment is proportional to the sensory measurement of the SOA, <em>m</em>, at a fixed rate determined by the learning rate <em>α</em>. The update rule of the audiovisual bias in trial <em>i</em> is thus\n</p><p><picture id=\"eqn8\"><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_eqn8.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_eqn8.gif/full/max/0/default.jpg\" alt=\"\"/></picture></p><p>\nThe derivation of the psychometric functions is identical to the asynchrony-contingent model.</p><h3 id=\"s5d5\" class=\"heading-3\">5.4.5 Model fitting</h3><h4 id=\"s5d5a\" class=\"heading-4\">Model log-likelihood</h4><p>The model was fitted by optimizing the lower bound on the marginal log-likelihood. We fit the model to the ternary TOJ data collected during the pre- and post-test phases of all sessions together. We did not collect temporal-order judgments in the exposure phase. But, to model the post-test data, we need to estimate the distribution of shifts of audiovisual bias resulting from the exposure phase (Δ<sub><em>β</em>,250</sub>). We do this using Monte Carlo simulation of the 250 exposure trials to estimate the probability distribution of the cumulative shifts.</p><p>The set of model parameters Θ is listed in <a href=\"#tbl1\">Table 1</a>. There are <em>J</em> sessions, each including <em>K</em> trials in the pre-test phase and <em>K</em> trials in the post-test phase. We denote the full dataset of pre-test data as <em>X</em><sub>pre</sub> and for the post-test data as <em>X</em><sub>post</sub>. We fit the pre- and post-test data jointly by summing their log-likelihood, log <em>p</em>(<em>X</em>|<em>M</em>, Θ) = log <em>p</em>(<em>X</em><sub>pre</sub>|<em>M</em>, Θ) + log <em>p</em>(<em>X</em><sub>post</sub>|<em>M</em>, Θ).</p><div class=\"figure-container\"><figure class=\"figure\" id=\"tbl1\"><label class=\"figure__label\">Table 1:</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_tbl1.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_tbl1.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h5 class=\"heading-5\">Model parameters. Check marks signify that the parameter is used for determining the likelihood of the data from the temporal-order judgment task in the pre- and post-test phase and/or for the Monte Carlo simulation of recalibration in the exposure phase.</h5></figcaption></figure></div><p>In a given trial, the observer responded either auditory-first (A), visual-first (V), or simultaneous (S). We denote a single response using indicator variables that are equal to 1 if that was the response in that trial and 0 otherwise. These variables for trial <em>k</em> in session <em>j</em> are <picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_inline4.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" class=\"inline-image\" src=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_inline4.gif/full/max/0/default.jpg\" alt=\"\"/></picture> and <picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_inline5.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" class=\"inline-image\" src=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_inline5.gif/full/max/0/default.jpg\" alt=\"\"/></picture> for the pre-test trials, and <picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_inline6.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" class=\"inline-image\" src=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_inline6.gif/full/max/0/default.jpg\" alt=\"\"/></picture>, etc., for the post-test trials.</p><p>The log-likelihood of all pre-test responses <em>X</em><sub>pre</sub> given the model parameters is\n</p><p><picture id=\"eqn9\"><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_eqn9.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_eqn9.gif/full/max/0/default.jpg\" alt=\"\"/></picture></p><p>\nThe psychometric functions for the pre-test (e.g., Ψ<sub><em>A</em>,pre</sub>) are defined in <a href=\"#eqn6\">Eq. 6</a>, and are the same across all sessions as we assumed that the audiovisual bias <em>β</em><sub>pre</sub> was the same before recalibration in every session.</p><p>The log-likelihood of responses in the post-test depends on the audiovisual bias after recalibration <em>β</em><sub>post,<em>j</em></sub> = <em>β</em><sub>pre</sub> + Δ<sub><em>β</em>,250,<em>j</em></sub> for session <em>j</em>. To determine the log-likelihood of the post-test data requires us to integrate out the unknown value of the cumulative shift Δ<sub><em>β</em>,250,<em>j</em></sub>. We approximated this integral in two steps based on our previous work (<a href=\"#c23\">Hong et al., 2021</a>). First, we simulated the 250 exposure trials 1000 times for a given set of parameters Θ and session <em>j</em>. This resulted in 1,000 values of Δ<sub><em>β</em>,250,<em>j</em></sub>. The distribution of these values was well fit by a Gaussian whose parameters were determined by the empirical mean and standard deviation of the sample distribution, resulting in the distribution <picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_inline7.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" class=\"inline-image\" src=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_inline7.gif/full/max/0/default.jpg\" alt=\"\"/></picture>. Second, we approximated the integral of the log-likelihood of the data over possible values of Δ<sub><em>β</em>,250,<em>j</em></sub> by numerical integration. We discretized the approximated distribution <picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_inline8.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" class=\"inline-image\" src=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_inline8.gif/full/max/0/default.jpg\" alt=\"\"/></picture> into 100 equally spaced bins centered on values Δ<sub><em>β</em>,250,<em>j</em></sub>(<em>n</em>) (<em>n</em> = 1, · · ·, 100). The range of the bins was triple the range of the values from the Monte Carlo sample, so that the lower bound was <picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_inline9.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" class=\"inline-image\" src=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_inline9.gif/full/max/0/default.jpg\" alt=\"\"/></picture> and the upper bound was <picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_inline10.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" class=\"inline-image\" src=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_inline10.gif/full/max/0/default.jpg\" alt=\"\"/></picture>.</p><p>The log-likelihood of the post-test data was approximated as\n</p><p><picture id=\"eqn10\"><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_eqn10.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_eqn10.gif/full/max/0/default.jpg\" alt=\"\"/></picture></p><p>\nwhere\n</p><p><picture id=\"eqn11\"><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_eqn11.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/97765%2Fv2%2Fcontent%2F584189v2_eqn11.gif/full/max/0/default.jpg\" alt=\"\"/></picture></p><p>\nThe psychometric functions in the post-test (e.g., Ψ<sub><em>A</em>,post,<em>jn</em></sub>) differed across sessions and bins because the simulated audiovisual bias after the exposure phase <em>β</em><sub>post,<em>j</em></sub> depends on the adapter SOA fixed in session <em>j</em> and the simulation bin <em>n</em>.</p><h4 id=\"s5d5b\" class=\"heading-4\">Parameter estimation and model comparison</h4><p>We approximated the lower bounds to the model evidence (i.e., the marginal likelihood) of each model for each participant’s data using Variational Bayesian Monte Carlo (<a href=\"#c1\">Acerbi, 2018</a>, <a href=\"#c2\">2020</a>). We set the prior distribution of parameters based on the results of maximum likelihood estimation using Bayesian Adaptive Direct Search to ensure that the parameter ranges were plausible (<a href=\"#c3\">Acerbi &amp; Ma, 2017</a>). We repeated each search 20 times with a different and random starting point to address the possibility of reporting a local minimum. For each model, the fit with the maximum lower bounds of the model evidence across the repeated searches was chosen for the maximum model evidence and best parameter estimates.</p><p>We then conducted a Bayesian model comparison based on model evidence. The model with the strongest evidence was considered the best-fitting model (<a href=\"#c29\">MacKay, 2003</a>). To quantify the support of model selection, we computed the Bayes factor, the ratio of the model evidence between each model and the asynchrony-correction, modality-independent-precision model, which had the weakest model evidence. To compare any two models, one can simply calculate the difference in their log Bayes factors as both are relative to the same weakest model.</p><h4 id=\"s5d5c\" class=\"heading-4\">Model recovery and parameter recovery</h4><p>We conducted a model-recovery analysis for the six models and confirmed that they are identifiable (Supplement Section 11). In addition, we considered an alternative causal-inference model in which the bias update is proportional to the posterior probability of a common cause, instead of driven by the percept. A separate model recovery analysis on variations of the causal-inference model was unable to distinguish between them (Supplement Section 12). For the causal-inference, modality-specific-precision model, we also carried out a parameter recovery analysis and confirmed that all the parameters are recoverable (Supplement Section 13).</p></section><section id=\"data-and-code-availability\"><h1 id=\"s6a\" class=\"heading-1\">Data and code availability</h1><p>All data and code are available via the Open Science Framework (<a href=\"https://osf.io/8s7qv/\">https://osf.io/8s7qv/</a>).</p></section><section id=\"acknowledgements\"><h1 class=\"heading-1\">Acknowledgements</h1><p>We thank the NYU High-Performance Computing (NYU HPC) for providing computational resources and support. We thank the anonymous reviewers’ advice that helped us improve the manuscript.</p></section><section id=\"additional-information\"><h1 id=\"d1e1766\" class=\"heading-1\">Additional information</h1><h2 id=\"s7\" class=\"heading-2\">Funding</h2><p>This research was funded by NIH EY08266.</p></section>"
}
