{
  "id": "98522",
  "doi": "10.1101/2023.08.03.551752",
  "version": 2,
  "status": "reviewed",
  "authorLine": "Célian Bimbard, Flóra Takács ... Philip Coen",
  "title": "An adaptable, reusable, and light implant for chronic Neuropixels probes",
  "published": "2024-06-18T14:00:00Z",
  "reviewedDate": "2024-06-18T14:00:00Z",
  "versionDate": "2025-01-15T14:00:00Z",
  "statusDate": "2025-01-15T14:00:00Z",
  "stage": "published",
  "subjects": [
    {
      "id": "neuroscience",
      "name": "Neuroscience"
    }
  ],
  "elifeAssessment": {
    "title": "eLife Assessment",
    "content": [
      {
        "type": "paragraph",
        "text": "This valuable study presents the design of a new device for using high-density electrophysiological probes ('Neuropixels') in freely moving rodents. The evidence demonstrating the system's versatility and ability to record high-quality extracellular data in both mice and rats is compelling. This study will be of significant interest to neuroscientists performing chronic electrophysiological recordings."
      }
    ],
    "id": "sa4",
    "doi": "10.7554/eLife.98522.2.sa4",
    "significance": [
      "valuable"
    ],
    "strength": [
      "compelling"
    ]
  },
  "indexContent": "Célian Bimbard, Flóra Takács, Joana A Catarino, Julie MJ Fabre, Sukriti Gupta, Stephen C Lenzi, Maxwell D Melin, Nathanael O’Neill, Ivana Orsolic, Magdalena Robacha, James S Street, José Teixeira, Simon Townsend, Enny H van Beest, Arthur M Zhang, Anne K Churchland, Chunyu A Duan, Kenneth D Harris, Dimitri M Kullmann, Gabriele Lignani, Zachary F Mainen, Troy W Margrie, Nathalie L Rochefort, Andrew M Wikenheiser, Matteo Carandini, Philip Coen <section id=\"introduction\"><h1 id=\"s1\" class=\"heading-1\">Introduction</h1><p>Some fundamental cognitive processes develop across days (e.g. learning) and are best studied in naturalistic environments (e.g. navigation). To gain insights into these processes, it is necessary to record brain activity chronically and to be able to do so in freely moving animals. Chronic recordings in freely moving animals are possible with calcium imaging (<a href=\"#c12\">Ghosh et al., 2011</a>; <a href=\"#c37\">Zong et al., 2022</a>). However, accessing deep brain regions can require invasive surgery and fails to capture fast neural dynamics. Electrophysiology overcomes these issues: the temporal resolution is higher, deeper regions are readily accessible, and recordings can be made in freely moving animals. Substantial effort has thus been dedicated to developing devices for chronic electrophysiology recordings (<a href=\"#c3\">Berényi et al., 2014</a>; <a href=\"#c4\">Chung et al., 2017</a>, <a href=\"#c5\">2019</a>; <a href=\"#c9\">Ferguson et al., 2009</a>; <a href=\"#c10\">Ferreira-Fernandes et al., 2023</a>; <a href=\"#c22\">Newman et al., 2023</a>; <a href=\"#c23\">Okun et al., 2016</a>; <a href=\"#c27\">Schoonover et al., 2021</a>; <a href=\"#c28\">Shobe et al., 2015</a>). But these devices are typically non-recoverable, are too heavy for use in smaller animals like mice, or record relatively few neurons.</p><p>With Neuropixels probes, many hundreds of neurons can be recorded in a single insertion (<a href=\"#c18\">Jun et al., 2017</a>; <a href=\"#c30\">Steinmetz et al., 2021</a>). These probes allow experimenters to produce brain-wide maps of neural activity in head-restrained mice using acute recordings (<a href=\"#c2\">Allen et al., 2019</a>; International Brain <a href=\"#c16\">Laboratory et al., 2023</a>; <a href=\"#c31\">Steinmetz et al., 2019</a>; <a href=\"#c32\">Stringer et al., 2019</a>). To track neurons across days, and to use freely moving animals, the probes can be implanted chronically, with procedures that are permanent (<a href=\"#c18\">Jun et al., 2017</a>; <a href=\"#c30\">Steinmetz et al., 2021</a>) or recoverable (<a href=\"#c11\">Ghestem et al., 2023</a>; <a href=\"#c14\">Horan et al., 2024</a>; <a href=\"#c17\">Juavinett et al., 2019</a>; <a href=\"#c20\">Luo et al., 2020</a>; <a href=\"#c29\">Song et al., 2024</a>; <a href=\"#c30\">Steinmetz et al., 2021</a>; <a href=\"#c34\">van Daal et al., 2021</a>; <a href=\"#c35\">Vöröslakos et al., 2021</a>). Permanent implants are lightweight and stable, but their use at scale is not financially feasible. Conversely, recoverable implants can be reused, but solutions need to be cheaper, lighter, more flexible, and easier to implant and explant. In particular, the only published recoverable implants for Neuropixels 2.0 probes may be too heavy for use with typical mice, and cannot be adjusted for different implantation trajectories (<a href=\"#c30\">Steinmetz et al., 2021</a>; <a href=\"#c34\">van Daal et al., 2021</a>).</p><p>To address these issues, we developed the “Apollo implant” for the reversible chronic implantation of Neuropixels probes. The implant is named for its lunar module design: a recoverable payload module accommodates up to two Neuropixels probes and is reused across animals, and a docking module is permanently cemented to the skull during implantation. The design is open source and can be readily adjusted with editable parameters to change distance between probes, implantation depth, or angle of insertion.</p><p>Our eight independent laboratories have performed successful recordings with the Apollo implant in mice and rats, supporting the flexibility and simplicity of the design. The same Neuropixels probes have been reimplanted up to 6 times with no significant change in recording quality. Recordings were stable across weeks and sometimes months. This allows for recordings to cover the entirety of the probes (by recording from different sections across days), while minimizing set-up time, and could facilitate the tracking of neurons across days. The design has been independently printed, adjusted, and implanted across labs, and implanted subjects included freely behaving mice and rats and head-fixed mice, with Neuropixels 1.0, 2.0α (a pre-release version), and 2.0 probes.</p><h1 id=\"s2\" class=\"heading-1\">Results</h1><h2 id=\"s2a\" class=\"heading-2\">Flexible design</h2><p>The Apollo implant consists of two parts, the payload and the docking modules, inspired by previous designs (<a href=\"#c34\">van Daal et al., 2021</a>) (<a href=\"#fig1\">Figure 1</a>). Both parts can be 3D-printed in a variety of materials, although we typically used a combination of Nylon PA12 and Formlabs Rigid Resin. The Neuropixels 1.0, 2.0α and 2.0 implants weigh ∼1.7, 1.3, and 0.9 g (<a href=\"#tbl1\">Table 1</a>). Payload modules can accommodate up to 2 parallel probes, with the second probe adding a further 0.4, 0.2, and 0.2 g. The Apollo implant is therefore ∼40% lighter than the only published Neuropixels 2.0α solution, which recommends animals are at least 25 g (<a href=\"#c34\">van Daal et al., 2021</a>; <a href=\"#c30\">Steinmetz et al., 2021</a>). This allows for use in smaller animals (e.g. female and water-restricted mice). The electronics are protected by lids with slots to accommodate the flex cables when not connected to the headstage (<a href=\"#fig1\">Figure 1A</a>). To ensure the implant is maximally compact, flex cables can be folded into the cavity beneath the lids (<a href=\"#fig1\">Figure 1B</a>). This minimizes implant height (∼29, 21, and 17 mm for a Neuropixels 1.0, 2.0α and 2.0), reducing the moment of inertia above the head. The implant can be 3D-printed for ∼$10 (∼$3 for each disposable module).</p><div class=\"figure-container\"><figure class=\"figure\" id=\"fig1\"><label class=\"figure__label\">Figure 1.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/98522%2Fv2%2Fcontent%2F551752v4_fig1.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/98522%2Fv2%2Fcontent%2F551752v4_fig1.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">The Apollo implant and its flexible design.</h4><p><strong>(A)</strong> Exploded view of the implant, showing the two modules: the payload module, which accommodates up to two Neuropixels probes (protected by two lids), and the docking module. Zoom-in: scaled illustration of the tip of a 4-shank Neuropixels 2.0α probe. Each shank is 75 μm wide, with 250 μm center-center distance between shanks and 15/32 μm vertical/horizonal distance between electrode sites on each shank. <strong>(B)</strong> Assembled view of the implant, for 2.0α and 2.0 (top) and 1.0 (bottom) probes. <strong>(C)</strong> Illustration of implant flexibility. Compared with the standard model (left), the length of exposed probes (middle-left), spacing between probes (middle-right), and implantation angle (right) can all be adjusted with preset parameter changes in the software files (Supplementary Video 1). <strong>(D)</strong> Constructor for the assembly of the payload and docking modules. The docking holder slides along the posts of the constructor, and optimally aligns with the payload module being held by the payload holder. This effectively eliminates the risk of breaking the shanks when combining modules.</p></figcaption></figure></div><div class=\"figure-container\"><figure class=\"figure\" id=\"tbl1\"><label class=\"figure__label\">Table 1.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/98522%2Fv2%2Fcontent%2F551752v4_tbl1.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/98522%2Fv2%2Fcontent%2F551752v4_tbl1.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Implant weight depends on probe version and material.</h4><p>The weight for each implant version. We find these to vary with each print (∼5 %), and with different services (∼10-15 %). For consistency, these weights are calculated from part volume and the material density. The “Standard” implant comprises PA12-Lids and Rigid4000-Payload/Docking modules. This is the most common implant used by experimenters, but the PA12-only implant has been used to reduce weight further. The total weights do not include the cement (∼0.2 g) to fix the probes to the payload module.</p></figcaption></figure></div><p>The implant is flexible and recoverable, allowing for different configurations, and the same Neuropixels probe(s) to be used multiple times (<a href=\"#fig1\">Figure 1C</a>). Once the payload module is constructed, the distance between the two probes remains fixed. The docking module is connected to the payload module via small screws, which makes it easy to assemble, and disassemble upon explantation. Only the docking module is cemented to the animal’s skull, and it is covered with merlons to increase contact with the cement and therefore the stability of the implant. To facilitate different implantation depths and angles with the same payload module, both the length and base-angle of the docking module can be adjusted. The base of the implant thus remains parallel to the skull (<a href=\"#fig1\">Figure 1C</a>) which improves stability and reduces weight by minimizing implant-height and the quantity of cement required. All adjustments can be achieved by inexpert CAD users with preset parameters supplied in the editable files to change distance between probes (1.8 to 6.5 mm—beyond 6.5 mm, two implants can be used), implantation depth (2-6.5 mm), or angle of insertion (up to 20 degrees) (Supplementary Video 1). As the fully-editable files are provided, users can (and have) adjusted the implants to exceed these default boundaries, or create their own custom modifications which are also available online (see Methods).</p><p>To help combine the payload and docking modules, we designed a dedicated constructor (<a href=\"#fig1\">Figure 1D</a>). The docking holder, containing a new docking module, slides onto the constructor posts, and the payload holder, containing the payload module, is fixed to the end. The two modules are thus coaxial, and the docking module can slide into position and be secured to the payload module without risk of damaging the probes. The constructor comprises 3D-printed parts and Thorlabs 6 mm poles for a one-time cost of ∼$25.</p><h2 id=\"s2b\" class=\"heading-2\">Assembly and implantation</h2><p>A comprehensive protocol for assembly and implantation, including variations employed across labs, is provided in Methods. Payload modules are assembled with one or two Neuropixels probes. After probe-sharpening (see Methods, <a href=\"#figs1\">Supplementary Figure 1A</a>), an empty payload module was positioned on adhesive putty and coated with a thin layer of epoxy. The probe(s) can then be affixed and aligned to the payload module, either by eye or using graph paper, before covering the base and electronics with epoxy or dental cement (<a href=\"#fig2\">Figure 2A</a>). The flex cable was folded and inserted into the lid and lids were then glued to the payload module (<a href=\"#fig2\">Figure 2B</a>).</p><div class=\"figure-container\"><figure class=\"figure\" id=\"fig2\"><label class=\"figure__label\">Figure 2.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/98522%2Fv2%2Fcontent%2F551752v4_fig2.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/98522%2Fv2%2Fcontent%2F551752v4_fig2.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Assembly and Implantation</h4><p><strong>(A)</strong> Initial stage of payload assembly. The payload module is stabilized on Blue Tack while the first (top) and second (bottom, optional) probes are secured with epoxy. <strong>(B)</strong> Each flex cable is first folded into a cavity in the lid (top) before the lid is glued in place (bottom). <strong>(C)</strong> The completed payload module fixed in its holder before being attached to the constructor. <strong>(D)</strong> The combination of payload and docking modules in the constructor. Inset: after the screws have been added to combine the modules. <strong>(E)</strong> Before (left) and after (right) residual gaps were filled with Kwik-Cast. <strong>(F)</strong> Example of dual craniotomies performed with a drill (top – premotor cortex and striatum) or biopsy punch (bottom – bilateral superior colliculus). <strong>(G)</strong> Dual 4-shank probes at the initial stage of insertion into craniotomies performed with drill (top) or biopsy punch (bottom). <strong>(H)</strong> Finalized implant in anaesthetized animal, after the docking module has been cemented to the skull.</p></figcaption></figure></div><p>The payload module (new or previously used) was combined with a new docking module for each experiment. Docking modules were adjusted to match experimental requirements (e.g. insertion depth, angle, etc.) The docking module was secured in its holder and slid onto the arms of the constructor. The payload module was secured in its holder and attached to the end of the constructor (<a href=\"#fig2\">Figure 2C-D</a>). The docking module holder was then slid along the constructor arms, and the two modules were secured with screws (<a href=\"#fig2\">Figure 2D</a>). Before each experiment, any gaps in the assembled implant were filled (<a href=\"#fig2\">Figure 2E</a>). Prior to each implantation, probes were typically coated with fluorescent dye for post-experiment trajectory tracking (<a href=\"#figs1\">Supplementary Figure 1B</a>).</p><p>Craniotomies were performed on the same day as the implantation, but this could be any time after assembly (<a href=\"#fig2\">Figure 2F</a>). The implant was held using the 3D-printed payload holder and positioned using a micromanipulator. The 8 shanks (in the case of a dual 4-shank implant) are positioned at the surface of the brain (<a href=\"#fig2\">Figure 2G</a>). Care is taken to avoid large blood vessels, and the implant can be rotated and repositioned. If the vessel is not completely avoidable, the shanks can be positioned on each side of the blood vessel. Probes were inserted to the desired depth at a slow speed (3-5 µm/s). Finally, to complete the implantation, the docking module was cemented to the skull (<a href=\"#fig2\">Figure 2H</a>).</p><h2 id=\"s2c\" class=\"heading-2\">Explantation</h2><p>Explantations were performed with a payload holder attached to a micromanipulator. The holder was aligned to the payload module, slid into place, and secured with a screw. The screws between the payload and the docking modules were then removed, and the payload module extracted (<a href=\"#figs1\">Supplementary Figure 1C</a>). Probes were cleaned with a tergazyme-solution, occasionally followed by a silicone cleaning solvent if Dural-Gel stuck to the probe. The payload module was combined with a new docking module for subsequent experiments.</p><p>Across laboratories, 97% of probes were recovered without any broken shanks (61/63 explanted probes, Supplementary Table 1). In only two cases were probes damaged, and in one of those cases the skull integrity was compromised by infection (a rare occurrence) and the probe was likely broken before explantation. On 6 further occasions, probes stopped working due to connection errors (typically revealed by a “shift register” error in SpikeGLX). The recovery rate is therefore 86% when including all connection errors. However, as this type of error is also observed with acute probe use, and there was no observable damage to the chronic probes, these failures may reflect long-term wear rather than any issue with the implant. Consistent with this, probes that failed with this error had typically been used for several months (Supplementary Table 1). Outside of the originating laboratory (UCL), 95% of probes (19/20) were recovered without any broken shanks (90% when including all connection errors) demonstrating the ease with which new users adopt this design.</p><h2 id=\"s2d\" class=\"heading-2\">Stability</h2><p>We tested the stability of the Apollo implant with Neuropixels 1.0, 2.0α, and 2.0 probes (<a href=\"#fig3\">Figure 3</a>). We implanted 48 mice using 4-shank Neuropixels 2.0α implants (20 mice with a single-probe implant and 13 mice with a dual implant), single-probe Neuropixels 2.0 implants (7 mice) and Neuropixels 1.0 implants (7 mice with a single probe implant and one mouse with a dual), as well as 3 rats with a single Neuropixels 1.0 implant (Supplementary Table 1). In many cases, the same implants were reused (up to 6 times) and remained fully functional across different animals (Supplementary Table 1). Recordings were performed over a period of days to months. The probes were typically inserted 5-6 mm inside the brain, traversing multiple brain regions (<a href=\"#fig3\">Figure 3A,B</a>). Because only 384 of the 5120 channels, termed a “bank” of channels, can be recorded simultaneously on each 4-shank 2.0 probe, multiple recording sessions were often used to cover all recording sites located in the brain for. Compared with acute recordings, this strategy dramatically reduces experimental set-up time and complexity, and is especially beneficial for whole brain approaches. The raw signal quality did not seem to change across days (<a href=\"#fig3\">Figure 3C,D</a>), allowing us to identify single spikes reliably for months. The spiking patterns on each probe were similar across days (<a href=\"#fig3\">Figure 3E,F</a>), suggesting that the same populations of neurons were being tracked.</p><div class=\"figure-container\"><figure class=\"figure\" id=\"fig3\"><label class=\"figure__label\">Figure 3.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/98522%2Fv2%2Fcontent%2F551752v4_fig3.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/98522%2Fv2%2Fcontent%2F551752v4_fig3.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Dual implant providing months of recordings.</h4><p><strong>(A,B)</strong> Insertion trajectories of two simultaneously implanted 4- shank Neuropixels 2.0α probes, with respect to brain anatomy (Allen Mouse Brain Atlas, (<a href=\"#c36\">Wang et al., 2020</a>)). <strong>(C,D)</strong> Raw signal (bandpass filtered between 400Hz and 9kHz) across 6 channels, on day 16 and 88 post-implantation. <strong>(E,F)</strong> Number of spikes per second versus depth along the probe (y-axis) and days from implantation (x-axis) for the same implantation shown in A-D. The total number of spikes per second (across all detected units) is binned across depths for each day (20 µm bins). This mouse was recorded while head-fixed.</p></figcaption></figure></div><p>The number of recorded neurons was reasonably stable across weeks (<a href=\"#fig4\">Figure 4</a>, <a href=\"#figs3\">Supplementary Figure 3</a>-<a href=\"#figs5\">5</a>). For each session, we quantified the number of well-isolated single units for each individual channel bank (<a href=\"#fig4\">Figure 4A</a>). Units were selected based on stringent criteria including amplitude, percentage of missing spikes, and refractory period violations (<a href=\"#c8\">Fabre et al., 2023</a>; <a href=\"#c33\">van Beest et al., 2024</a>). The number of single units for each probe is the sum of units across all banks within the brain (<a href=\"#fig4\">Figure 4A</a>). Unit numbers could remain stable for more than 50 days, and we observed comparable stability in most of mice (<a href=\"#fig4\">Figure 4B</a>). As previously described (<a href=\"#c20\">Luo et al., 2020</a>), we often observed an initial fast decrease in the number of units, but this was not systematic. Indeed, in some animals, unit-number increased slowly across days until reaching a peak (<a href=\"#fig4\">Figure 4</a>). The mean decrease in unit count per day was ∼3% (median 2%), within the range previously observed for chronic Neuropixels implants (<a href=\"#c30\">Steinmetz et al., 2021</a>). Although implants with more rapid unit loss were not suited for long-term recordings, others remained stable for months. Across all banks, the average number of recorded neurons on each bank was 85 ± 6 during the first 10 days (n = 59 probes, mean ± s.e.m.), 65 ± 7 during days 10-50 (n = 50 probes), 54 ± 15 during days 50-100 (n = 6 probes) and 44 ± 25 beyond (n = 2 probes) (<a href=\"#figs4\">Supplementary Figure 4</a>). The initial number of units did not depend on the number of times the probe was reimplanted (p &gt; 0.25, <a href=\"#fig4\">Figure 4C</a>) or the insertion coordinates of the probe (p &gt; 0.94, <a href=\"#fig4\">Figure 4D</a>). The rate of unit loss was also independent of these two variables (p &gt; 0.29 and p &gt; 0.31 for probe reuse and AP position, <a href=\"#fig4\">Figure 4E,F</a>). However, implant quality was more variable in posterior brain regions, with instances of rapidly decreasing neuron counts, as previously described (<a href=\"#c20\">Luo et al., 2020</a>). Stability was qualitatively similar across different laboratories (<a href=\"#figs3\">Supplementary Figure 3</a>). Surgical optimizations are ongoing, and protecting the craniotomy with silicon may significantly increase recording stability (<a href=\"#figs5\">Supplementary Figure 5</a>, (<a href=\"#c21\">Melin et al., 2024</a>)).</p><div class=\"figure-container\"><figure class=\"figure\" id=\"fig4\"><label class=\"figure__label\">Figure 4.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/98522%2Fv2%2Fcontent%2F551752v4_fig4.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/98522%2Fv2%2Fcontent%2F551752v4_fig4.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Recording stability and implant reuse.</h4><p><strong>(A)</strong> Total number of recorded units across days for individual channel banks (thin lines), and across each probe (thick lines), for the same implantation as in <a href=\"#fig3\">Figure 3</a>. Lines: logarithmic fits. <strong>(B)</strong> Logarithmic fits across all implantations where a full survey of the probe was regularly performed (purple, implantation from <a href=\"#fig3\">Figure 3</a>). Full probe surveys were performed only in the primary lab (head-fixed conditions). <strong>(C)</strong> Unit count versus number of implantations. Connected dots represent single probes, reused up to 6 times. No criteria were used to select probes for re-use, and this decision was based solely on probe availability and experimental need. Slopes were quantified on individual banks and averaged for each probe before applying a linear mixed-effects model (thick line). <strong>(D)</strong> Unit count versus antero-posterior position of the insertion, relative to bregma. <strong>(E-F)</strong> Same as C-D but for the slope of the unit count decay. <strong>(G-L)</strong> Same as (A-F) but for the RMS value of the raw signal. For C-F and I-L, all mice are used and shown (head-fixed and freely moving conditions). Rats were excluded because their insertion coordinates cannot be matched with the mice, but their individual results are shown in <a href=\"#figs3\">Supplementary Figure 3</a>.</p></figcaption></figure></div><p>The overall quality of the signal remained high throughout days and probe reuses. We quantified the overall noise present in the recordings by computing the root-mean-square (RMS) value of the raw signal (<a href=\"#fig4\">Figure 4G- L</a>). The RMS values were stable across days, across all mice (<a href=\"#fig4\">Figure 4G,H</a>). Both the average RMS value and its changes over time were independent of the number of times the probe had been used (<a href=\"#fig4\">Figure 4I,K</a>). We observed a significant effect of AP position on the RMS value, but not on its changes over time (<a href=\"#fig4\">Figure 4J,L</a>). Similarly, the median unit amplitude was stable and unaffected by probe reuse (<a href=\"#figs2\">Supplementary Figure 2</a>).</p><p>Individual neurons could be tracked across days and months (<a href=\"#fig5\">Figure 5</a>). We used the tracking software UnitMatch to track the same units across days, based on their waveforms (<a href=\"#c33\">van Beest et al., 2024</a>). In a mouse recorded for ∼100 days, a significant fraction of units could be tracked for months (<a href=\"#fig5\">Figure 5A,B</a>). Tracked neurons had stable waveforms over days, as expected from the matching procedure, but also stable inter-spike intervals histograms (ISIH) (<a href=\"#fig5\">Figure 5C,D</a>). These ISIHs were not used to match neurons across days, and their stability therefore strongly suggests the same units were tracked over months. The proportion of units tracked between two recordings decreased as a function of time between the recordings (<a href=\"#fig5\">Figure 5E</a>). For two recordings on the same day, ∼50% of neurons were matched, suggesting an upper limit in neuron-tracking with the method we used, likely due to variability in neural activity or conservative choices in software parameters. The proportion of tracked neurons typically decreased to ∼10% after 32 days, but the rate of decay varied across recordings: with some cases where 20% of neurons were tracked for 64 days, and others dropping to 0% after a week. In all cases, tracked units had consistent ISIHs, as measured by the area under the receiver operating characteristic Curve (AUC)—comparing the similarity of ISIHs for tracked vs. different units (<a href=\"#fig5\">Figure 5F</a>). This indicates the tracking algorithm remains accurate for large intervals between recordings.</p><div class=\"figure-container\"><figure class=\"figure\" id=\"fig5\"><label class=\"figure__label\">Figure 5.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/98522%2Fv2%2Fcontent%2F551752v4_fig5.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/98522%2Fv2%2Fcontent%2F551752v4_fig5.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Neurons recorded across days and months.</h4><p><strong>(A)</strong> Unit presence across all recordings (left). Only the units present in at least one of the first 3 days are shown for ease of visualization. Units are ordered by the number of recordings in which their presence was detected (right). <strong>(B)</strong> Spatial layout of the population of neurons tracked across days. In this example, the recording sites were spanning 2 shanks of a 4-shank 2.0α probe (green rectangle in <a href=\"#fig3\">Figure 3E</a>). <strong>(C)</strong> Average waveforms of 4 example tracked units, computed for 7 days across a 13-week period. <strong>(D)</strong> As in C, but showing the Inter-spike interval (ISI) histogram of each unit on each day. <strong>(E)</strong> Probability of tracking a unit as a function of days between recordings, for individual mice (<em>gray</em>), including example from <strong>A-D</strong> (<em>purple</em>), or the average across all mice (<em>black</em>, mean±s.e.m across datasets). <strong>(F)</strong> The average AUC values when comparing the ISI histogram correlations of tracked versus non-tracked neurons. Colors same as <strong>E</strong>.</p></figcaption></figure></div><h2 id=\"s2e\" class=\"heading-2\">Freely behaving animals</h2><p>To test whether the Apollo implant could be used in more naturalistic conditions, we recorded from freely behaving mice and rats in various configurations (<a href=\"#fig6\">Figure 6</a>). First, to minimize the weight, we recorded from 2 freely-moving mice using either a dual Neuropixels 2.0α implant or a Neuropixels 1.0 implant, with the headstage suspended by its connection cable (<a href=\"#fig6\">Figure 6A,B</a>). The mice explored their home cage and exhibited normal behaviors, such as grooming, running, and sleeping, suggesting that the implant did not impair basic movements. The recordings yielded high-quality, well-isolated single units for weeks (<a href=\"#fig6\">Figure 6C</a>, <a href=\"#figs3\">Supplementary Figure 3</a>). The distributions of the RMS values (<a href=\"#fig6\">Figure 6D</a>) and spike amplitudes (<a href=\"#fig6\">Figure 6E</a>) were similar to the head-fixed conditions, suggesting an equivalent quality of recording despite differences in conditions, and labs. It can also be more convenient to secure the position of the headstage in each recording, or permanently attach the headstage to the implant. We thus designed a headstage holder, which we tested with Neuropixels 1.0 (<a href=\"#fig6\">Figure 6F-J</a>). To further reduce the weight on the mouse, we also designed a 1-probe version of the implant for Neuropixels 2.0, with a minimal headstage holder (<a href=\"#fig6\">Figure 6K-O</a>), inserted at an angle (16 or 25 degrees), at the back of the brain. In rats (<a href=\"#fig6\">Figure 6P-T</a>), the implant was inserted in the center of a 3- D casing, that afforded extra protection, and neural data was recorded wirelessly using SpikeGadgets.</p><div class=\"figure-container\"><figure class=\"figure\" id=\"fig6\"><label class=\"figure__label\">Figure 6.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/98522%2Fv2%2Fcontent%2F551752v4_fig6.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/98522%2Fv2%2Fcontent%2F551752v4_fig6.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Use in freely behaving animals.</h4><p><strong>(A)</strong> Neuropixels 1.0 and 2.0α were used with freely-moving mice. The headstage was suspended by the wire above the implant. <strong>(B)</strong> Animal freely-moving with the 1.0 version of the implant, with headstage attached. <strong>(C)</strong> Raw signal (bandpass filtered between 400Hz and 9kHz) across multiple channels of increasing depth, on two days post-implantation. <strong>(D)</strong> Mean distribution of the RMS value across channels, averaged across all recordings in head-fixed mice (black, n = 2 mice) and freely-moving (cyan, n = 35 mice) <strong>(E)</strong> Same as (D), but for the distribution of the units’ amplitude. <strong>(F)</strong> As in (A), but with an additional headstage holder for Neuropixels 1.0 (n = 4 mice). <strong>(G-J)</strong> As in (B-E) but for recordings with the headstage holder from D. <strong>(K)</strong> Miniature, 1-probe implant for Neuropixels 2.0, with a headstage holder (n = 8 mice with both 2.0 and 2.0α probes). <strong>(L-O)</strong> As in (B-E) but using the modified design from (G). <strong>(P)</strong> Configuration for rats, with a casing to protect the implant (SpikeGadgets – without the lid, n = 3 rats). The final configuration comprises the wireless recording system. <strong>(Q-T)</strong> As in (B-E) but with the apparatus from (P), recorded in rats. Not that the reference head-fixed data is from mice.</p></figcaption></figure></div><p>Mouse performance in the task remained stable after implantation (<a href=\"#fig7\">Figure 7</a>). To quantify the effect of implantation on behavior, we compared the performance of mice on a complex behavioral task before and after implantation with a Neuropixels 1.0 probe—the heaviest version of the Apollo Implant (<a href=\"#tbl1\">Table 1</a>). This implant was modified to allow the headstage to be permanently attached from the first recording session (see Methods). Mice were placed in a large octagonal arena (80 cm diameter). On each trial, mice were required to respond to visual stimuli projected onto the floor of the chamber and perform a nose poke in one of the ports located around the perimeter of the chamber. Thus, during a typical session of ∼100 trials, mice typically traversed tens of meters (<a href=\"#fig7\">Figure 7A</a>). We compared mouse hit rate, trial number, and reaction times in sessions before implantation (when the mouse moved entirely freely) and after implantation (when the mouse was tethered). After implantation, mice continued to perform trials and fully-explore the chamber (<a href=\"#fig7\">Figure 7B</a>). We observed an initial reduction in hit rate and trial number, and an increase in reaction time immediately after implantation (<a href=\"#fig7\">Figure 7C-E</a>). The first two measures recovered within 5 sessions (<a href=\"#fig7\">Figure 7C-D</a>), but reaction times did not recover to pre-implantation levels, indicating that implantation may impact mobility in physically demanding tasks. Although we cannot disambiguate whether these changes are due to tethering, or the implant, it represents the maximal impact of the implantation, particularly as the heaviest Apollo implant was used. Therefore, the consistent hit rate and trial number, in a complex task requiring exploration in a large arena, demonstrates that the implant is well-suited to extended recordings from freely moving mice.</p><div class=\"figure-container\"><figure class=\"figure\" id=\"fig7\"><label class=\"figure__label\">Figure 7.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/98522%2Fv2%2Fcontent%2F551752v4_fig7.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/98522%2Fv2%2Fcontent%2F551752v4_fig7.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Effects of implantation on performance in a freely-moving task.</h4><p><strong>(A)</strong> Trajectories (grey) of single mouse in an example session prior to implantation. Blue and red dots indicate mouse position at the start and end of each trial. <strong>(B)</strong> As in (A), but for an example session post-implantation. <strong>(C)</strong> The hit rate (percentage of correctly completed choices) made by two mice (magenta and brown) in the 4 sessions immediately before implantation (Pre), immediately after implantation (Recovery) and the subsequent 4 sessions after this recovery period (Post). n = 2 mice, 4 sessions per mouse at each time period. <strong>(D)</strong> As in (C), but for the number of trials per session. <strong>(E)</strong> The probability of each reaction time for the same sessions in A-B, separated by mouse.</p></figcaption></figure></div><h1 id=\"s3\" class=\"heading-1\">Discussion</h1><p>To record large populations of neurons across days and during freely moving behaviors we developed the “Apollo implant”: a chronic implant for Neuropixels 1.0 and 2.0 probes. This solution is easily implanted and recovered, inexpensive, lightweight, flexible, and stable. We successfully tested the implant across multiple labs, setups (head-fixed or freely moving), and species (mice and rats), recording neural populations across weeks and even months.</p><p>The design of the Apollo implant builds upon past advances in chronic devices for Neuropixels probes (<a href=\"#c17\">Juavinett et al., 2019</a>; <a href=\"#c20\">Luo et al., 2020</a>; <a href=\"#c30\">Steinmetz et al., 2021</a>; <a href=\"#c34\">van Daal et al., 2021</a>; <a href=\"#c35\">Vöröslakos et al., 2021</a>) to improve on several aspects: weight, price, flexibility, and ease of use. The implant is optimized for animals that cannot carry heavy loads, like mice and especially female and water-controlled mice, which have lower body weight. Because the headstage is not permanently fixed to the implant, the animal carries less weight outside of recordings, and a single headstage can be used with multiple animals in sequence. However, the flexible design allows for the headstage to be permanently attached to an implant, which increases experimental ease at the expense of some additional implant-weight. The implant is strong enough to be carried by rats with the addition of a protective 3D outer casing (see Methods), but its use in stronger animals, like ferrets or primates, remains untested. For applications requiring even lighter implants, such as birds, printing materials can be selected to further reduce weight. The lightweight design enables animals to perform complex and demanding freely moving tasks, but also allows experimenters to implant female and water restricted mice while respecting animal welfare weight limitations.</p><p>The Apollo implant is more flexible than previously published solutions. A unique aspect of our modular design is that different docking modules can be used when reimplanting the same payload module, which enables a variety of recording configurations (brain regions, animals, and experimental setups) that would not have been possible with previous designs. The provided CAD files are fully editable and open source, allowing experienced users to modify the parts as needed. For inexpert users, the files are populated with predefined key dimensions that can be easily adjusted to accommodate changes in several features, including inter-probe distance, angle of implantation, and the length of exposed probes. This ensures the implant remains close to the skull for each experiment, minimizing surgical complications, implant weight (less bonding agent is needed), and moment of inertia (height is minimized). Indeed, even with the heavier Neuropixels 1.0 implants, freely-moving mice maintained consistent performance on a complex task after implantation.</p><p>Although adapting the design to other commercially available silicon probes is beyond the scope of this study, the flexible design paves the way for future adaptations by individual groups. Because of the low component-cost (∼$3 per docking module), testing custom modifications is also more cost-effective than with previous solutions. This combination of flexibility and affordability is exemplified by the modifications already used across the eight labs providing data for this manuscript.</p><p>With the Apollo implant, the number of recorded neurons exhibited good stability across days, regardless of the number of times the probe had been reimplanted. To provide a realistic estimate for the number of high-quality units that could be recorded across days, we used stringent quality metrics based on unit waveform and spiking properties. Predicting the stability of an implantation was difficult and did not seem to correlate strongly with the quality of surgery (e.g. a small bleed during craniotomy, or ease of probe insertion). We observed more variable stability at the back of the brain, especially in superior colliculus, possibly due to the mechanical constraints imposed during head movements.</p><p>The Apollo implant allows for the insertion of up to two parallel probes simultaneously. This can be advantageous: it simplifies surgeries by reducing insertion time and allows probes to be placed in close proximity. However, some users may need to insert multiple probes at different angles. In this case we are aware of two implant solutions in development that could be better suited, although to our knowledge these remain untested outside the authors’ own groups and have only been used in mice (<a href=\"#c1\">Aery Jones, 2023</a>; <a href=\"#c21\">Melin et al., 2024</a>).</p><p>We have demonstrated that neurons recorded with the Apollo implant can be effectively tracked across days, consistent with previous characterizations of chronic Neuropixels implants (<a href=\"#c30\">Steinmetz et al., 2021</a>; <a href=\"#c33\">van Beest et al., 2024</a>). Van Beest <em>et al</em> provides further evidence of neurons tracked with the Apollo implant, and a rigorous quantification of the number of neurons that one can expect to track with these methods. We expect the success of these methods to vary across model systems due to differences in waveform properties—for example, we observed qualitatively higher unit amplitudes in rats in this study. The ability to track neurons across these timescales promises to enhance our understanding of cognitive processes that evolve over long timescales, such as learning or aging.</p><p>Overall, the Apollo implant fills an important need to facilitate chronic electrophysiology with Neuropixels probes, particularly in small animals. The simplicity and flexibility of its design is exemplified by the 8 independent groups that have successfully used the implant and contributed data to this manuscript.</p></section><section id=\"author-contributions\"><h1 id=\"s4\" class=\"heading-1\">Author contributions</h1><div class=\"figure-container\"><figure class=\"figure\" id=\"utbl1\"><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/98522%2Fv2%2Fcontent%2F551752v4_utbl1.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/98522%2Fv2%2Fcontent%2F551752v4_utbl1.tif/full/max/0/default.jpg\" alt=\"\"/></picture></figure></div></section><section id=\"methods\"><h1 id=\"s5\" class=\"heading-1\">Methods</h1><p>Experimental procedures at UCL and University of Edinburgh were conducted according to the UK Animals Scientific Procedures Act (1986), the European Directives 86/609/EEC and 2010/63/EU on the protection of animals used for experimental purposes, and the Animal Welfare and Ethical Review Body (AWERB). Procedures were conducted under personal and project licenses released by the Home Office following appropriate ethics review.</p><p>Experimental procedures at UCLA conformed to the guidelines established by the National Institutes of Health and were approved by the Institutional Animal Care and Use Committee of the University of California, Los Angeles David Geffen School of Medicine.</p><p>Experimental procedures at Champalimaud were approved and performed in accordance with the Champalimaud Centre for the Unknown Ethics Committee guidelines and by the Portuguese Veterinary General Board (Direção-Geral de Veterinária, approval 0412/2022).</p><h2 id=\"s5a\" class=\"heading-2\">Implant design and materials</h2><p>All parts of the implant (except the constructor probes, Thorlabs) were designed using Autodesk Inventor Professional 2023 software, acquired free of charge through the renewable education plan. Parts were 3D- printed by external companies (primarily SGD 3D, <a href=\"https://sgd3d.co.uk/\">https://sgd3d.co.uk/</a>), or at the SWC FabLab. Stereolithography (SLA, using Rigid4000 resin, Formlabs) was typically used for the payload and docking modules, the docking holder, and the constructor head. Selective laser sintering (SLS, using Nylon PA12) was typically used for the payload module lids and payload holder. Brass threaded inserts were manually added to the payload module, payload holder, and docking holder using a soldering iron after printing. For parts (e.g. the payload and docking modules) where strength and inflexibility were advantageous, we used Rigid4000 resin, although this material is denser than Nylon PA12. With this combination, the Neuropixels 1.0, 2.0α and 2.0 implants weigh ∼1.7, 1.3, and 0.9 g. The weight of the implants can be further reduced to ∼1.5, 1.1, and 0.8 g if all parts are printed with Nylon PA12. The full-PA12 implants have been successfully used with 1.0 probes, but remains untested with the 2.0 versions. The miniaturized Neuropixels 2.0 implant with headstage holder weighed ∼0.6 g by itself or 1.1g with the probe epoxied and ground attached. All probes used, and any resulting issues/breakages are detailed in Supplementary Table 1. Damage resulting from historical procedural steps that are no-longer used (e.g. manually separating the shanks of a 4-shank probe with a needle, now achieved by de-ionized water or strong solvant) or carelessness during probe handling outside of mounting, implantation and explantation are not indicated in the table as they are independent of the implant itself.</p><p>In addition to the 3D-printed implant, the following materials are required (due to variable supply, up-to-date links are provided in the GitHub repository):</p><ul class=\"list-bullet\"><li><p>M1 Brass knurled inserts (eBay, Aliexpress): To be heat-inserted into the Payload.</p></li><li><p>M3 Brass knurled inserts (RS): To be heat-inserted into the PayloadHolder and DockingHolder.</p></li><li><p>M1 Screws (Accu): To lock modules together (4 per module).</p></li><li><p>M3 5mm screws (Accu): For connecting Payload Module holder to Thor Labs posts (3 total)</p></li><li><p>M3 10mm screws (Accu): For connecting Constructor Head to Thor Labs posts (3 total) and also for securing the Docking Module in its holder (2-4 depending on your preference)</p></li><li><p>M3 20mm screws (Accu): For tightening the payload module holder (one per holder)</p></li><li><p>Mini-series optical posts (Thor labs): 3 for the constructor, potentially more to hold the probes etc.</p></li></ul><h2 id=\"s5b\" class=\"heading-2\">Implant assembly, implantation, and explantation protocol</h2><p>What follows is the protocol used by the originating laboratory with some minor variants. This is the most thoroughly tested and recommended approach. Methods employed by each individual lab are detailed in a later section.</p><h3 id=\"s5b1\" class=\"heading-3\">1. Payload module assembly—Once per Apollo Implant</h3><p>The payload modules were assembled with either one or two shank Neuropixels probes. First, all parts were assembled by hand without the probes to ensure a good fit first before fixing the probes permanently to the holder.</p><ol class=\"list-order\"><li><p>The probes were sharpened individually using a microgrinder (Narishige EG-45), and an independent holder (<a href=\"#figs1\">Supplementary Figure 1A</a>). When using only one probe, sharpening can be performed at the end of the assembly, using the payload module holder.</p></li><li><p>The empty payload module was positioned on adhesive putty (Blu Tack) and coated with a thin layer of epoxy (Araldite or Gorilla) or dental cement (Superbond).</p></li><li><p>The probe was affixed and aligned to the payload module, either by eye or using graph paper, before covering the base and electronics with epoxy or dental cement (e.g. Loctite E-60NC HYSOL or Superbond, <a href=\"#fig2\">Figure 2A</a>).</p></li><li><p>In the case of a dual implant, the second probe was similarly affixed on the other side of the payload module (<a href=\"#fig2\">Figure 2B</a>). The relative position of each probe was adjusted by eye to achieve the required combination of depths.</p></li><li><p>The ground and reference were shorted by connecting them with a silver wire. Occasionally, this wire was then soldered to a socket connector to flexibly connect the ground to a bone screw.</p></li><li><p>For each probe, the flex cable was folded and inserted into the slot on the inside of the lid (<a href=\"#fig2\">Figure 2B</a>) before the lid was glued to the payload module with superglue (Loctite) or dental cement (SDI, Wave A1) (<a href=\"#fig2\">Figure 2A</a>).</p></li><li><p>Any residual openings were filled in with Kwik-Cast (WPI). When only one probe was used, the back side of the payload was sealed by a lid, with masking tape or a small drop of Kwik-Cast.</p></li></ol><h3 id=\"s5b2\" class=\"heading-3\">Combining payload and docking modules</h3><p>For each implantation, a new or previously used payload module was combined with a new docking module. The docking module could be varied between experiments to adjust for variables including insertion depth, angle, or headplate-compatibility.</p><ol class=\"list-order\"><li><p>The docking module was positioned in the docking module holder, secured with set screws (M3 10mm), and slid onto the arms of the constructor.</p></li><li><p>The payload module (with probes) was secured in a payload module holder by tightening the corresponding screw (M3 20 mm) and attached to the end of the constructor with screws (M3 10mm, <a href=\"#fig2\">Figure 2C</a>).</p></li><li><p>The docking module holder was slid along the constructor arms toward the payload module, and the two modules were combined with screws (M1 x 2mm, <a href=\"#fig2\">Figure 2D</a>).</p></li><li><p>Any open gaps were closed with Kwik-Cast (<a href=\"#fig2\">Figure 2E</a>).</p></li><li><p>Before most implantations, probes were coated with DiI (Vybrant V22888 or V22885, ThermoFisher) or DiD (Vybrant V22887, ThermoFisher) by either manually brushing each probe with a droplet of DiI or dipping them directly into the solution (<a href=\"#figs1\">Supplementary Figure 1B</a>).</p></li></ol><h3 id=\"s5b3\" class=\"heading-3\">Implantation</h3><p>Craniotomies were performed on the day of the implantation, under isoflurane (1–3% in O2) anesthesia, and after injection of appropriate analgesia and anti-inflammatory drugs (usually Colvasone and Carprofren). Headplate surgery was performed in most cases, either days before or on the same day. The eyes of the animal were protected throughout surgery using eye lubricant.</p><ol class=\"list-order\"><li><p>The skull was cleaned, scored (to improve cement adhesion), and levelled. One craniotomy per probe was then performed using a drill or a biopsy punch (<a href=\"#fig2\">Figure 2F</a>). Craniotomies were as small as possible (&lt;0.5mm for single shank, 1mm of length for 4 shanks), while still allowing for room to adjust probe placement (particularly important with dual, 4-shank probe implants).</p></li><li><p>The exposed brain was covered with Dural-Gel (Cambridge Neurotech) which was allowed to cure for 15-30 minutes. This step can be performed after probe insertion <em>if</em> the brain is suffused with saline throughout insertion.</p></li><li><p>(Optional) A skull screw was inserted into the skull for grounding during recordings.</p></li><li><p>The assembled implant—secured within a payload holder—was positioned using a micromanipulator (Sensapex). After positioning the probe shanks at the surface of the brain (<a href=\"#fig2\">Figure 2G</a>), avoiding blood vessels, probes were inserted at slow speed (3-5 µm/s).</p></li><li><p>Once the desired depth was reached (generally when the docking module touched the skull), the implant was sealed using cement (3M RelyX Unicem 2 Automix) (<a href=\"#fig2\">Figure 2H</a>). Occasionally, silicone gel or Kwik-Sil was on top of the Dural-Gel to improve stability. Preliminary data from one mouse where this was performed shows excellent stability (<a href=\"#figs5\">Supplementary Figure 5</a>).</p></li><li><p>(Optional) The skull screw was connected to the probe’s reference/ground wire and secured with a drop of cement. During head-fixed experiments, the animal’s headplate can be used for grounding, and combined with internal referencing provided by the Neuropixels, yielded low-noise recordings.</p></li><li><p>Probe function, and in some cases position in the brain, were confirmed by plugging the probes into the acquisition system and visually inspecting the signals.</p></li><li><p>The docking module, skull screw (optional), and skull were covered with Super-Bond polymer, taking care to ensure the payload module (and screws) were not cemented.</p></li><li><p>(Optional) In some cases, a headstage was combined with the implant. In this case, a cap/cover was fitted to the implant to protect and hold the headstage. A connection between the headstage and acquisition hardware was confirmed before removing the animal from anesthesia.</p></li><li><p>(Optional) In rats, a SpikeGadgets targeting cone shielding was assembled around the Apollo implant and affixed to the skull with self-curing orthodontic resin (Ortho-jet, Lang Dental). The probe flex cable was connected to the Spike Gadgets interface board and screws were placed to hold the interface board to the targeting cone assembly, completing the implantation.</p></li><li><p>At the end of the surgery, the animal was given analgesia (Metacam), and allowed to awaken on the heating mat before being placed in a heated recovery box and then returned to its home cage.</p></li></ol><h3 id=\"s5b4\" class=\"heading-3\">Explantation</h3><p>Explantations were performed under light isoflurane anesthesia (1–3% in O2).</p><ol class=\"list-order\"><li><p>With a micromanipulator, a payload holder was aligned to the payload module, slid into place, and secured with a screw. Ensure the animal’s head is well aligned to avoid any friction when retracting the probe.</p></li><li><p>The headstage (if present) was disconnected, and any residual silicon was removed. If a skull screw was used, the attached ground wire was unplugged or cut.</p></li><li><p>Saline was applied to the implant to soften any potential debris or tissue regrowth.</p></li><li><p>The screws between the payload and the docking modules were removed.</p></li><li><p>The payload module was retracted from the docking module using the micromanipulator. In cases where the implant was stiff, a needle or the tip of forceps was used to gently separate the two modules, to hold the docking module in place while the payload was retracted.</p></li><li><p>Once extracted, probes were sometimes contaminated with debris, like Dural-Gel or biological tissue (<a href=\"#figs1\">Supplementary Figure 1C</a>). Extensive cleaning with a Tergazyme solution (24h) followed by de-ionized water typically cleaned the probes. If this procedure proved insufficient, a 24h bath in a stronger detergent (DOWSIL DS-2025 Silicone cleaning solvent) removed the residual tissue. Neither process altered the signal quality.</p></li></ol><h2 id=\"s5c\" class=\"heading-2\">Lab-specific methods</h2><h3 id=\"s5c1\" class=\"heading-3\">Payload module assembly</h3><h4 id=\"s5c1a\" class=\"heading-4\">Carandini-Harris laboratory</h4><p><strong>Number / type of probes</strong>: one or two 4-shank Neuropixels 2.0α probes.</p><p><strong>Sharpening</strong>: Yes (Narishige EG-45)</p><p><strong>Shank alignment:</strong> By eye</p><p><strong>Grounding preparation</strong>: Silver wire to short the ground and reference, connected to headplate</p><p><strong>Headstage</strong>: Removable</p><h4 id=\"s5c1b\" class=\"heading-4\">Churchland laboratory</h4><p><strong>Number / type of probes</strong>: two Neuropixels 1.0 probes.</p><p><strong>Sharpening</strong>: Yes (Narishige EG-45).</p><p><strong>Shank alignment:</strong> We checked probe alignment in the holder without any cement or glue. Kapton tape was added to the backside of the probes and then alignment was rechecked to ensure a straight shank trajectory. After verifying proper alignment, the probes were affixed to the payload module, before covering the base and electronics with light curable dental cement (SDI, Wave A1).</p><p><strong>Grounding preparation</strong>: Silver wire to short the ground and reference, and soldered to a socket connector (Digikey, ED5164-15-ND) to allow for grounding with a bone screw. A bone screw tethered to its own socket connector was also prepared to allow for detachment of the grounding screw from the probes at the conclusion of the experiment.</p><p><strong>Headstage</strong>: Removable</p><h4 id=\"s5c1c\" class=\"heading-4\">Duan laboratory</h4><p><strong>Number / type of probes</strong>: one Neuropixels 1.0 probe.</p><p><strong>Sharpening</strong>: Yes (Narishige EG-45).</p><p><strong>Shank alignment:</strong> By eye</p><p><strong>Grounding preparation</strong>: Silver wire to short the ground and reference and soldered to a <strong>g</strong>rounding wire terminating in a gold socket.</p><p><strong>Headstage:</strong> Permanent, but recoverable. A Neuropixels 1.0 headstage was covered in epoxy resin. After allowing for the epoxy to fully cure, the headstage was attached to the 3D printed headstage-holder using set of screw-holes/threads on the holder.</p><h4 id=\"s5c1d\" class=\"heading-4\">Kullman/Lignani laboratories</h4><p><strong>Number / type of probes</strong>: one Neuropixels 1.0 probe.</p><p><strong>Sharpening</strong>: Yes (Narishige EG-45).</p><p><strong>Shank alignment:</strong> By eye</p><p><strong>Grounding preparation</strong>: Silver wire to short the ground and reference, and soldered to an additional silver wire, terminated with a male Mill-Max pin and insulated with Plastidip, for connecting to a skull ground screw during recordings.</p><p><strong>Headstage</strong>: Removable</p><h4 id=\"s5c1e\" class=\"heading-4\">Mainen laboratory</h4><p><strong>Number / type of probes</strong>: one Neuropixels 1.0 probe.</p><p><strong>Sharpening</strong>: Yes (Narishige EG-45).</p><p><strong>Shank alignment:</strong> Using graph paper</p><p><strong>Grounding preparation</strong>: Silver wire to short the ground and reference</p><p><strong>Headstage</strong>: Removable</p><h4 id=\"s5c1f\" class=\"heading-4\">Margrie laboratory</h4><p><strong>Number / type of probes</strong>: one 4-shank Neuropixels 2.0α or 2.0 probe.</p><p><strong>Sharpening</strong>: Unsharpened</p><p><strong>Shank alignment:</strong> By eye</p><p><strong>Grounding preparation</strong>: Silver wire to short the ground and reference</p><p><strong>Headstage</strong>: Removable</p><h4 id=\"s5c1g\" class=\"heading-4\">Rochefort laboratory</h4><p><strong>Number / type of probes</strong>: one Neuropixels 1.0 probe.</p><p><strong>Sharpening</strong>: Unsharpened</p><p><strong>Shank alignment:</strong> By eye</p><p><strong>Grounding preparation</strong>: Silver wire to short the ground and reference</p><p><strong>Headstage</strong>: Removable</p><p><strong>Note</strong>: To make the design compatible with existing headplates (<a href=\"#c24\">Osborne and Dudman, 2014</a>), the docking module surface was sliced before printing (44 deg angle).</p><h4 id=\"s5c1h\" class=\"heading-4\">Wikenheiser laboratory</h4><p><strong>Number / type of probes</strong>: one Neuropixels 1.0 probe.</p><p><strong>Sharpening</strong>: Unsharpened</p><p><strong>Shank alignment:</strong> Using graph paper</p><p><strong>Grounding preparation</strong>: Silver wire to short the ground and reference, and a male gold pin (AM systems catalog #520200) connected to a length of the same silver wire was soldered to a different ground pad on the flex cable. A stainless-steel ground screw (McMaster-Carr catalog #92470A015) was prepared by wrapping a length of silver wire several times below the screw head, affixing the wire to the screw with solder, and soldering the free end of the wire to a female gold pin compatible with the one affixed to the probe.</p><p><strong>Headstage</strong>: Removable (SpikeGagdets)</p><p><strong>Note</strong>: The point at which the probe emerged from the docking module was carefully coated with silicone gel (Dow-Corning 1597418).</p><h3 id=\"s5c2\" class=\"heading-3\">Implantation</h3><h4 id=\"s5c2a\" class=\"heading-4\">Carandini-Harris laboratory</h4><p><strong>Animals:</strong> Adult male and female mice C57BL\\6J</p><p><strong>Preparatory surgery timing</strong>: different day than implantation</p><p><strong>Preparatory surgery</strong>: A brief (approximately 1 h) initial surgery was performed to implant a titanium headplate (approximately 25 × 3 × 0.5 mm, 0.2 g). In brief, the dorsal surface of the skull was cleared of skin and periosteum. A thin layer of cyanoacrylate (VetBond, World Precision Instruments) was applied to the skull and allowed to dry. Thin layers of UV-curing optical glue (Norland Optical Adhesives #81, Norland Products) were applied and cured until the exposed skull was covered. This glue was completely removed during the implantation surgery. The head plate was attached to the skull over the interparietal bone with Super-Bond polymer (Super-Bond C&amp;B, Sun Medical). After recovery, mice were treated with carprofen for three days, then acclimated to handling and head-fixation.</p><p><strong>Craniotomy methods (size)</strong>: Biopsy punch or drill, then covered with Dural-Gel (1-1.5mm)</p><p><strong>Insertion speed (manipulator)</strong>: 3-5 µm/s (Sensapex)</p><p><strong>Implant cementing</strong>: Blue-light-curing cement (3M RelyX Unicem 2 Automix), then covered with Super-Bond. Only in GB012, the craniotomy was first covered with Kwik-Sil before being sealed.</p><p><strong>Treatment</strong>: Isoflurane anesthesia, carprofren and dexamethasone during implantation, then meloxicam or carprofren for 3 days</p><h4 id=\"s5c2b\" class=\"heading-4\">Churchland laboratory</h4><p><strong>Mice:</strong> Adult male mice C57BL\\6J</p><p><strong>Preparatory surgery timing</strong>: Just before implantation</p><p><strong>Preparatory surgery</strong>: In brief, the dorsal surface of the skull was cleared of skin and periosteum. A thin layer of cyanoacrylate (VetBond, World Precision Instruments) was applied to the edges of skull and allowed to dry. After ensuring the skull was properly aligned within the stereotax, craniotomy locations were marked by making a small etch in the skull with a dental drill. A titanium headbar was then affixed to the back of the skull with a small amount of glue (Zap-a-gap). The headbar and skull were then covered with Metabond, taking care to avoid covering the marked craniotomy locations. After the Metabond was dry, the craniotomies for the probes and grounding screw were drilled.</p><p><strong>Craniotomy methods (size):</strong> Drill, then covered with Dural-Gel</p><p><strong>Insertion speed (manipulator)</strong>: 5 µm/s (Neurostar).</p><p><strong>Implant cementing</strong>: sealed with Kwik-Sil and UV cement (SDI, Wave A1), then covered with Metabond</p><p><strong>Treatment</strong>: Isoflurane anesthesia, meloxicam and enrofloxacin during implantation, then meloxicam and enrofloxacin for 3 days.</p><h4 id=\"s5c2c\" class=\"heading-4\">Duan laboratory</h4><p><strong>Mice:</strong> Adult female mice C57BL\\6J</p><p><strong>Preparatory surgery timing</strong>: Just before implantation</p><p><strong>Preparatory surgery</strong>: In brief, the skull was exposed, cleaned, and aligned in preparation for the implantation. A small craniotomy was performed at the target site. A small well was made around the craniotomy using blue-light-curing dental cement (3M RelyX Unicem 2 Automix). The well was filled with Dural-Gel to set before the implantation. The skin was glued, and the exposed skull was fully covered using dental cement (Superbond, SUN medical). Another small craniotomy (0.5 mm) was performed at the cerebellum, and previously prepared golden pin terminating with a silver wire was inserted and cemented such that the pin was resting on top of the skull.</p><p><strong>Craniotomy methods (size):</strong> Drill, then covered with Dural-Gel (∼1mm)</p><p><strong>Insertion speed (manipulator)</strong>: For the first 100-200um the lowering speed was ∼10-20um/s, then reduced to 3-5 µm/s for a subsequent ∼4000um (S-IVM Mini, Scientifica, mounted on the stereotaxic manipulator arm).</p><p><strong>Implant cementing</strong>: Blue-light-curing dental cement (3M RelyX Unicem 2 Automix). The grounding wire socket was plugged into the implanted grounding pin and cured with Light-curing cement. The implant was wrapped with surgical tape (3M micropore).</p><p><strong>Treatment</strong>: Isoflurane anesthesia and meloxicam during implantation, then meloxicam for 3 days.</p><p><strong>Headstage attachment:</strong> after recovery, animals were briefly anaesthetized and the surgical tape from the implant was removed. The assembled headstage-holder was attached to the implant using the top set of screw-holes/threads of the payload module of the assembled implant. Implant was wrapped with surgical tape (3M micropore) leaving the headstage connector exposed. The connector was plugged with a matching plug (A79604-001, Omnetics) between the recordings.</p><h4 id=\"s5c2d\" class=\"heading-4\">Kullman/Lignani laboratories</h4><p><strong>Mice:</strong> Adult male mice C57BL\\6J</p><p><strong>Preparatory surgery timing</strong>: Just before implantation</p><p><strong>Preparatory surgery</strong>: In brief, the dorsal surface of the skull was cleared of skin and periosteum. A 0.7 mm burr hole was made on the left (contralateral) parietal skull plate and a skull screw (with 0.5mm silver wire, terminating at a female Mill-Max pin) was inserted. A thin layer of cyanoacrylate glue (MedBond, Animus Surgical, UK) was applied to the surface of the skull at the sutures to adhere the skull bones together and around the skin perimeter to adhere the surrounding skin to the skull.</p><p><strong>Craniotomy methods (size):</strong> biopsy punch (Integral) and bur (R&amp;S Diamond Bur Taper Conical End Super Fine, Z12), then covered with Dural-Gel (1.5mm)</p><p><strong>Insertion speed (manipulator)</strong>: 3-5 µm/s (Sensapex)</p><p><strong>Implant cementing</strong>: Blue-light-curing cement (3M RelyX Unicem 2 Automix), then covered with Super-Bond. Once the cement had fully dried, the gold contacts of the probe’s ZIF connector were protected with a small strip of parafilm, and another strip of parafilm was wrapped at the top of the implant.</p><p><strong>Treatment</strong>: Isoflurane anesthesia and buprenorphine during implantation, then meloxicam and amoxicillin</p><h4 id=\"s5c2e\" class=\"heading-4\">Mainen laboratory</h4><p><strong>Animals:</strong> Adult male mice C57BL\\6J</p><p><strong>Preparatory surgery timing</strong>: Just before implantation</p><p><strong>Preparatory surgery</strong>: In brief, the dorsal surface of the skull was cleared of skin and periosteum. Cyanoacrylate (Vetbond, 3M) was applied between the skull and the remaining scalp. After aligning the skull to the stereotaxic frame, craniotomy coordinates were marked using a lab pen (Nalgene). The skull, excluding the locations for craniotomies, was then covered in a thin layer of Superbond C&amp;B (SunMedical).</p><p><strong>Craniotomy methods (size):</strong> For the probes, biopsy punch, then covered with Dural-Gel. For the ground screw, drill.</p><p><strong>Insertion speed (manipulator)</strong>: 5 µm/s (Sensapex)</p><p><strong>Implant cementing</strong>: Blue-light-curing cement (3M RelyX Unicem 2 Automix), then covered with Super-Bond.</p><p><strong>Treatment</strong>: Carprofen during implantation, and if animals showed reduced motility on a daily basis.</p><h4 id=\"s5c2f\" class=\"heading-4\">Margrie laboratory</h4><p><strong>Animals:</strong> Adult male mice C57BL\\6J</p><p><strong>Preparatory surgery timing</strong>: Just before implantation</p><p><strong>Preparatory surgery</strong>: Mice were separated for at least 2 days prior to surgery. The mouse was secured on a stereotaxic frame (Angle Two, Leica Biosystems). After incision, the skull was roughened, and a small craniotomy was made away from the site of implantation and a ground pin inserted. The ground pin, prepared before surgery, consisted of a gold pin soldered to a short piece of silver wire (0.37mm diameter) that was inserted into the brain. Next a craniotomy was made, a small well was made around the craniotomy using blue-light-curing cement (3M RelyX Unicem 2 Automix). The dura was removed.</p><p><strong>Craniotomy methods (size):</strong> Drill, kept wet using saline, then covered with Dural-Gel only after probe insertion (1mm)</p><p><strong>Insertion speed (manipulator)</strong>: 3µm/s (Luigs and Neumann)</p><p><strong>Implant cementing</strong>: Blue-light-curing cement (3M RelyX Unicem 2 Automix), then covered with Super-Bond.</p><p><strong>Treatment</strong>: Isoflurane anesthesia during surgery. Meloxicam given shortly before surgery and 24 hours after surgery.</p><h4 id=\"s5c2g\" class=\"heading-4\">Rochefort laboratory</h4><p><strong>Animals:</strong> Adult male and female mice C57BL\\6J</p><p><strong>Preparatory surgery timing</strong>: At least 3 days before implantation</p><p><strong>Preparatory surgery</strong>: Headplates (3D-printed RIVETS headplate, 0.54 g, VeroClear resin, 3D Bureau) were implanted during an initial surgery. In brief, the dorsal surface of the skull was cleared of skin and periosteum. A thin layer of cyanoacrylate (VetBond, World Precision Instruments) was applied to the skull and allowed to dry. After ensuring the skull was properly aligned within the stereotax, craniotomy sites were marked by tattoo ink using a sterile pipette tip. Edges of the exposed skull and headplate were scored by a scalpel to improve adhesion, then the headplate was attached to the skull using cyanoacrylate (Super Glue Power Gel, Loctite) and dental cement (Paladur, Heraeus Kuzler). The skull was then covered by another layer of cyanoacrylate (Super Glue Liquid Precision, Loctite) and allowed to dry.</p><p><strong>Craniotomy methods (size):</strong> Cyanoacrylate on the skull was removed by a hand-held dental drill, and a small craniotomy was drilled, then covered with Dural-Gel (0.1mm)</p><p><strong>Insertion speed (manipulator)</strong>: 3 µm/s (Sensapex)</p><p><strong>Implant cementing</strong>: Blue-light-curing cement (3M RelyX Unicem 2 Automix) and dental cement (Paladur, Heraeus Kuzler).</p><p><strong>Treatment</strong>: Isoflurane anesthesia, buprenorphine, carprofen, and dexamethasone during implantation, then buprenorphine at 24 and 48 hours post-surgery.</p><h4 id=\"s5c2h\" class=\"heading-4\">Wikenheiser laboratory</h4><p><strong>Animals:</strong> Long-Evans male and female rats</p><p><strong>Preparatory surgery timing</strong>: Just before implantation</p><p><strong>Preparatory surgery</strong>: In brief, the skull was exposed, cleared of connective tissue and periosteum, and leveled. A 1.8 mm trephine (Fine Science catalog #18004-18) was used to lightly inscribe the implant coordinates, and burr holes were drilled to accommodate four stainless steel anchor screws (McMaster-Carr catalog #92470A015) and the grounding screw (placed above the cerebellum). The craniotomy was drilled using the trephine, exposing the dura mater which was removed using a 27-ga needle and fine forceps.</p><p><strong>Craniotomy methods (size):</strong> Trephine (1.8mm)</p><p><strong>Insertion speed (manipulator)</strong>: 1-3 µm/s</p><p><strong>Implant cementing</strong>: The base of the docking module was previously covered with silicon, then Metabond was applied to the docking module to affix it to the skull and the anchor screws, and the ground pins were connected. Next, the Spike Gadgets targeting cone shielding was assembled around the Apollo implant and affixed to the skull with self-curing orthodontic resin (Ortho-jet, Lang Dental). The probe flex cable was connected to the Spike Gadgets interface board and screws were placed to hold the interface board to the targeting cone assembly, completing the implantation.</p><p><strong>Treatment</strong>: Carprofen during implantation, then carprofen for 3 days after surgery, and cephalexin for 14 days after surgery.</p><h3 id=\"s5c3\" class=\"heading-3\">Data acquisition</h3><h4 id=\"s5c3a\" class=\"heading-4\">Carandini-Harris laboratory</h4><p><strong>Electrophysiology data acquisition</strong>: SpikeGLX (<a href=\"https://billkarsh.github.io/SpikeGLX/\">https://billkarsh.github.io/SpikeGLX/</a>, versions 20190724, 20201012, 20201103, and 2022101).</p><p><strong>Experimental context</strong>: During the experiments, mice were typically head-fixed and exposed to sensory stimuli (e.g., visual stimuli such as natural images) or engaged in an audiovisual task (<a href=\"#c6\">Coen et al., 2023</a>) or a visual go-no go task.</p><p><strong>Grounding</strong>: Headplate (interparietal bone). Internal (electrode tip) reference was sometimes used.</p><h4 id=\"s5c3b\" class=\"heading-4\">Churchland laboratory</h4><p><strong>Electrophysiology data acquisition</strong>: SpikeGLX (version 20201103)</p><p><strong>Experimental context</strong>: During the experiments, mice were head-fixed while performing the IBL task (International Brain <a href=\"#c15\">Laboratory et al., 2021</a>).</p><p><strong>Grounding:</strong> Bone screw</p><h4 id=\"s5c3c\" class=\"heading-4\">Duan laboratory</h4><p><strong>Electrophysiology data acquisition</strong>: SpikeGLX (version 20230411)</p><p><strong>Experimental context</strong>: Assisted rotary joint (Doric, AHRJ-OE_1×1_24_HDMI+4) was used to remove cable rotation throughout the recording session. During the recordings, water restricted mice were tethered and placed in a large (∼80 cm wide) octagonal arena (built in collaboration with NeuroGears Ltd) and were performing a behavioral task. Briefly, the floor of the arena was used as a projection surface to display the stimuli to the mice. At the bottom of each wall the nose-pokes were used to detect mouse responses and deliver water reward. At a random time after the trial onset, two stimuli were presented as a spatial cue on the floor, indicating which wall had an “active” nose poke with available water reward. To cue the relevant wall, each stimulus was in shape of a triangular “slice” on the arena floor, with the wide base along the width of the wall that had active pokes, narrowing down to a point at the center. The walls with active ports (2/8 walls) were randomized on trial-by-trial basis, and the distances mice had to take to reach the cued walls depended on their position at the trial onset. Mouse reaction times were measured as the elapsed time from the onset of the stimulus until the registration of the poke-response at a cued wall. Mouse performance (hit rate) was calculated as the percentage of trials mice poked to one of the cued walls within 30s. If the mouse did not poke within 30s, the trial was aborted and labelled as a miss trial. Sessions typically lasted 25-30 minutes (85-100 trials), or until mice began to miss responding to the cued walls.</p><p>Mouse position in the arena was recorded with a camera (50Hz, BFS-U3-16S2M-CS, Flir) and detected online by thresholding of mice against the arena floor, based on the region of interest, size, and intensity (Bonsai, Lopes et al., 2015). To increase detectability, IR light strips were added around the arena. Artefacts in tracking due to the tether were filtered out by removing frames with displacements larger than 73.35 cm and using a manual threshold based on the distribution of length of major axis of the tracked object.</p><p><strong>Grounding:</strong> Gold pin (cerebellum)</p><h4 id=\"s5c3d\" class=\"heading-4\">Kullman/Lignani laboratories</h4><p><strong>Electrophysiology data acquisition</strong>: SpikeGLX (versions 20190724 and 20230425)</p><p><strong>Experimental context</strong>: The animal was briefly anaesthetised (4% isoflurane) to connect the probe ground to the skull screw pin, the probe headstage at the ZIF connector, and the recording cable to the headstage at the Omnetics connector. In the first animal, a small loop (∼5 cm) of recording cable was fastened to the side of the implant using parafilm (<a href=\"#fig6\">Figure 6A</a>) to ensure forces exerted on the cable were transmitted to the body of the implant and not the fragile ZIF connector. In the second animal, a custom-made headstage holder (<a href=\"https://github.com/Coen-Lab/chronic-neuropixels/tree/main/XtraModifications/Mouse_FreelyMoving\">https://github.com/Coen-Lab/chronic-neuropixels/tree/main/XtraModifications/Mouse_FreelyMoving</a>) was 3D-printed to attach to the implant assembly and secured the headstage onto the implant while protecting the ZIF connector. The entirety of the recording cable was attached to a nylon cable using knots of nylon thread spaced at ∼ 30 cm intervals along the recording cable. The cable was slack relative to the nylon thread so that the animal could freely explore and rotate without introducing excessive tension and knotting into the cable (Aery Jones, 2023). The animal was allowed to recover and freely navigate its home cage (for implant 1; Techniplast GM500, 39×20 cm) or an experimental arena (for implant 2; Techniplast GR900, 40×35 cm), located inside a small Faraday container or on the floor of the recording room. During recording sessions, the experimenter rotated the cable to match the animal’s rotational movements, to propagate twists along the full length of the cable and reduce localized tangling and cable stress near the implant.</p><p><strong>Grounding:</strong> Bone screw (contralateral parietal skull plate)</p><h4 id=\"s5c3e\" class=\"heading-4\">Mainen laboratory</h4><p><strong>Electrophysiology data acquisition</strong>: SpikeGLX (version 20190413)</p><p><strong>Experimental context</strong>: The mouse was connected to acquisition hardware and placed in an open field (25 x 33 x 45.5 cm plastic box with a layer of bedding) enclosed in a faraday cage (54 x 41 x 70.5 cm) where it explored freely for 20-40 min. The open field was fitted with an infrared light and video camera (FLIR Chameleon3) to allow monitoring of the animal in the dark and a rotary joint was used to reduce mechanical forces on the recording cable.</p><p><strong>Grounding:</strong> Bone screw over the cerebellum</p><h4 id=\"s5c3f\" class=\"heading-4\">Margrie laboratory</h4><p><strong>Electrophysiology data acquisition</strong>: SpikeGLX (version 20230815)</p><p><strong>Experimental context</strong>: We used the same behavioral arena and protocols outlined in (<a href=\"#c19\">Lenzi et al., 2022</a>). Each mouse was transferred in their home cage to the experimental room and given at least 5 minutes to acclimatize to the room under low light conditions. The mouse was then briefly anesthetized and the probe cable was then connected, via a rotary joint to allow cable derotation during recording (Doric, AHRJ- OE_1×1_PT FC_24), and mice were allowed to explore their home cage to acclimatize to the attachment and recover from anesthesia. Mice were then transferred to the behavioral arena (50cm x 20cm x 28cm Perspex box) and the stimulus-presentation monitor (Dell E2210F Black (WSXGA+) 22” TN) was moved into place.</p><p><strong>Grounding:</strong> Gold pin near the site of implantation, with silver wire penetrating the brain.</p><h4 id=\"s5c3g\" class=\"heading-4\">Rochefort laboratory</h4><p><strong>Electrophysiology data acquisition</strong>: SpikeGLX (version 20230202)</p><p><strong>Experimental context</strong>: During the experiments, mice were head-fixed and exposed to visual stimuli, <em>i.e.</em>, drifting gratings and natural movies.</p><p><strong>Grounding:</strong> Internal (electrode tip) reference was used.</p><h4 id=\"s5c3h\" class=\"heading-4\">Wikenheiser laboratory</h4><p><strong>Electrophysiology data acquisition</strong>: Trodes (<a href=\"https://spikegadgets.com/trodes/\">https://spikegadgets.com/trodes/</a>, version 2-4-1)</p><p><strong>Experimental context</strong>: One rat (Wikenheiser001) explored a small square-shaped open-field arena (∼50 cm/side) and data was acquired using Trodes (Spike Gadgets). Wireless electrophysiological data was acquired from rats (Wikenheiser002 and Wikenheiser003) as they performed a behavioral task in a circular arena (80cm diameter) for 40-minutes.</p><p><strong>Grounding:</strong> Bone screw (cerebellum)</p><h2 id=\"s5d\" class=\"heading-2\">Data processing</h2><p>Sessions were automatically spike-sorted using pyKilosort (<a href=\"https://github.com/MouseLand/pykilosort\">https://github.com/MouseLand/pykilosort</a>, python port of Kilosort (<a href=\"#c26\">Pachitariu et al., 2016</a>) version 2.0) and automatically curated using Bombcell (<a href=\"#c8\">Fabre et al., 2023</a>). One mouse (GB012) was spike-sorted using Kilosort 4 (<a href=\"#c25\">Pachitariu et al., 2024</a>).</p><p>A variety of parameters were used to select high-quality units, based either on their waveform and their spiking properties.</p><p>The template waveform-based criteria were: (1) a maximum of 2 peaks and 1 trough, (2) a spatial decay slope below −3 µV.µm<sup>-1</sup>, defined as the slope of a linear fit (using the MATLAB <em>polyfit</em> function) between the maximum absolute amplitude of the peak channel and nearest 5 channels along the length of the probe (i.e., 75µm away for Neuropixels 2.0), (3) a duration between 0.1ms and 0.8ms (<a href=\"#c7\">Deligkaris et al., 2016</a>), (4) fluctuations during baseline not exceeding 30% of the peak amplitude. The raw waveform-based criteria, computed using at least 1000 randomly sampled spikes, were: (1) a minimum mean amplitude of 20 µV (Only 1% of units had amplitudes below 30 µV, and increasing this threshold to 50 µV did not affect the results), and (2) a minimum mean signal-to-noise ratio of 0.1, defined as the absolute maximum value divided by the baseline variance. Both somatic and non-somatic spikes (<a href=\"#c7\">Deligkaris et al., 2016</a>) were kept.</p><p>The spiking properties-based criteria were: (1) a minimum of 300 spikes, (2) less than 20% of spikes missing, estimated by fitting a Gaussian to the spike amplitude distribution with an additional cut-off parameter below which no spikes are present, (3) a maximum of 10% refractory period violations, using a previously published approach (<a href=\"#c13\">Hill et al., 2011</a>), defining the censored period as 0.1ms and estimating the refractory period using a window between 0.5 and 10ms, and (4) a minimum presence ratio of 0.2, defined as the fraction of 1-min bins with at least one spike.</p><h2 id=\"s5e\" class=\"heading-2\">Data analysis</h2><p>Raw traces (<a href=\"#fig3\">Figure 3C,D</a>, <a href=\"#fig6\">Figure 6C</a>) were obtained by bandpass filtering each channel from spikeGLX between 400 and 9000 Hz (using the MATLAB <em>bandpass</em> function) and subtracting the median across channels. The root-mean-square (RMS) value was computed on the processed signal, and the median across all channels was used to summarize each recording.</p><p>To obtain the total number of spikes per second at each depth along the probe (<a href=\"#fig3\">Figure 3E,F</a>), we summed spikes across all units present within each 20 µm depth bin.</p><p>In the case of 4-shank probes, we estimated the number of recorded units for a probe on a given day (<a href=\"#fig4\">Figure 4A,B</a>) by summing units from a complete set of independently recorded banks—a set of channel banks that tiled the entirety of the implanted probe—when available. Because each such set was recorded across at least two days, we used the closest recordings within a window of five days, centered on the day of interest. Days were excluded if it was not possible to form a complete set of banks within a five-day window.</p><p>To obtain <em>P</em> the percentage change in unit count <em>N<sub>d</sub></em> across days <em>d</em> (4C-F), we fit an exponential decay function to the number of units detected on each bank across days and extracted the decay parameter <em>τ</em>:\n</p><p><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/98522%2Fv2%2Fcontent%2F551752v4_ueqn1.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/98522%2Fv2%2Fcontent%2F551752v4_ueqn1.gif/full/max/0/default.jpg\" alt=\"\"/></picture></p><p><em>P</em> was defined as:\n</p><p><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/98522%2Fv2%2Fcontent%2F551752v4_ueqn2.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/98522%2Fv2%2Fcontent%2F551752v4_ueqn2.gif/full/max/0/default.jpg\" alt=\"\"/></picture></p><p><em>P</em> was averaged across all longitudinally recorded banks from each implantation to obtain a single value. Only banks with at least 3 recordings were included.</p><p>The median of the units’ amplitude and the median RMS values were fitted using a linear fit. Similarly, a single value for each implantation was obtained by taking the variable’s mean value across all banks.</p><p>To estimate the effect of repeated probe use, <em>U</em>, and antero-posterior and medio-lateral insertion coordinates (<em>Y</em> and <em>X</em>) on a variable of interest (e.g., the percentage change in unit count, or the RMS values) across days, we used a linear mixed effects model (using the MATLAB <em>fitlme</em> function):\n</p><p><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/98522%2Fv2%2Fcontent%2F551752v4_ueqn3.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/98522%2Fv2%2Fcontent%2F551752v4_ueqn3.gif/full/max/0/default.jpg\" alt=\"\"/></picture></p><p>\nHere, <em>P</em> is the response variable, <em>Y</em>, <em>X</em>, and <em>U</em> are fixed effect terms, and probeID (the probe identity) is the single grouping variable. We then assessed whether <em>Y</em>, <em>X</em>, or <em>U</em> had a significant effect on the response variable.</p><p>To track neurons across days (<a href=\"#fig5\">Figure 5</a>), we used UnitMatch, which uses only the neurons’ waveform (<a href=\"#c33\">van Beest et al., 2024</a>). We identified cell presence across days using the intermediate algorithms, which have been shown to maximize the probability of tracking neurons while preserving a low false-positive rate. We then identified the neurons that were tracked across 6 arbitrary days spanning the whole recording period. The inter-spike intervals were computed as the distribution of the times between consecutive spikes, binned on a logarithmic scale from 0 to 5 s. As in van Beest et al (2023), to compute the probability of a unit being tracked, we looked at each unit across all recordings and computed the probability of this unit being tracked in previous or subsequent recordings. These probabilities were then averaged across all the units from each animal, and averaged across animals.</p><p>To quantify the amount of information present in the distributions of the correlations of the fingerprints, we computed the ROC curve for different populations of pairs (from putative matched units or nonmatched units) across days. We then computed the area under the ROC curve (AUC) to quantify this difference between distributions. Only sessions with at least 20 matched units were considered. Units that had a match within recordings were excluded from this analysis. For each mouse, the AUCs were then averaged across recording locations.</p><p>To compute the distributions of RMS values and unit-amplitudes (<a href=\"#fig6\">Figure 6</a>), we computed these distributions first for single sessions (across channels and units respectively), and then computed the average distribution across sessions and animals.</p></section><section id=\"supplementary-figures\"><h1 id=\"s7\" class=\"heading-1\">Supplementary figures</h1><div class=\"figure-container\"><figure class=\"figure\" id=\"figs1\"><label class=\"figure__label\">Supplementary Figure 1.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/98522%2Fv2%2Fcontent%2F551752v4_figs1.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/98522%2Fv2%2Fcontent%2F551752v4_figs1.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Additional protocol steps.</h4><p>(A) Probes were sharpened before assembling the implant using a microgrinder (Narishige EG-45). (B) Before most implantations, probes were coated with a fluorescent marker (Vybrant V22888 or V22885, ThermoFisher) by dipping them directly into the solution. (C) Example of detritus that can adhere to the probe shanks during explantation. This should be cleaned before reusing the implant (see Methods).</p></figcaption></figure></div><div class=\"figure-container\"><figure class=\"figure\" id=\"figs2\"><label class=\"figure__label\">Supplementary Figure 2.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/98522%2Fv2%2Fcontent%2F551752v4_figs2.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/98522%2Fv2%2Fcontent%2F551752v4_figs2.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">The amplitude of the recorded neurons is stable across days and probe reuses.</h4><p><strong>(A)</strong> Median unit amplitude across days for individual channel banks (thin lines), and across each probe (thick lines), for the same implantation as in <a href=\"#fig3\">Figure 3</a>. Lines: logarithmic fits. <strong>(B)</strong> Logarithmic fits across all implantations where a full survey of the probe was regularly performed (purple, implantation from <a href=\"#fig4\">Figure 4</a>). <strong>(C)</strong> Median unit amplitude versus number of implantations. Connected dots represent single probes, reused up to 6 times. The slope is quantified with a linear mixed-effects model (thick line). <strong>(D)</strong> Median unit amplitude versus antero-posterior position of the insertion, relative to bregma. <strong>(E-F)</strong> Same as C-D but for the change in amplitude over days.</p></figcaption></figure></div><div class=\"figure-container\"><figure class=\"figure\" id=\"figs3\"><label class=\"figure__label\">Supplementary Figure 3.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/98522%2Fv2%2Fcontent%2F551752v4_figs3.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/98522%2Fv2%2Fcontent%2F551752v4_figs3.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">The amplitude of the recorded neurons is stable across days and probe reuses.</h4><p><strong>(A)</strong> Number of recorded units as a function of days from implantation, for all the secondary labs. Each color corresponds to a different lab, and each line is a different bank for a specific probe and animal. <strong>(B)</strong> RMS values as a function of days from implantation, for all the secondary labs. <strong>(C)</strong> Median unit amplitude as a function of days from implantation, for all the secondary labs. The high amplitude values (yellow) come from the recordings in rats. All secondary labs used this implant as part of their own study, explaining the diversity of length and types of protocols.</p></figcaption></figure></div><div class=\"figure-container\"><figure class=\"figure\" id=\"figs4\"><label class=\"figure__label\">Supplementary Figure 4.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/98522%2Fv2%2Fcontent%2F551752v4_figs4.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/98522%2Fv2%2Fcontent%2F551752v4_figs4.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Stability of unit count across days.</h4><p>Number of recorded units per bank as a function of days, averaged across all banks for each animal (<em>gray</em>) or averaged across animals (<em>black</em>).</p></figcaption></figure></div><div class=\"figure-container\"><figure class=\"figure\" id=\"figs5\"><label class=\"figure__label\">Supplementary Figure 5.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/98522%2Fv2%2Fcontent%2F551752v4_figs5.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/98522%2Fv2%2Fcontent%2F551752v4_figs5.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Recording stability on the mouse where the craniotomy was covered with silicon.</h4><p>As in <a href=\"#c21\">Melin et al. (2024)</a>, a drop of silicon (Kwik-Sil) was added to cover the craniotomy before closing the implant with cement. Although anecdotal, the stability of recorded units in this mouse was excellent, suggesting that silicon may improve implant stability.</p></figcaption></figure></div></section><section id=\"code--data-availability\"><h1 id=\"s6\" class=\"heading-1\">Code &amp; data availability</h1><p>The CAD files for the implant, and detailed instructions for implantation and construction are available at <a href=\"https://github.com/Coen-Lab/chronic-neuropixels\">https://github.com/Coen-Lab/chronic-neuropixels</a>.</p><p>Data is available at <a href=\"https://doi.org/10.6084/m9.figshare.27652932\">https://doi.org/10.6084/m9.figshare.27652932</a>. Note that due to space limits, raw data (including what is needed for tracking in <a href=\"#fig5\">fig 5</a>) is only available from the authors upon reasonable requests. Code to replicate the figures is available at <a href=\"https://github.com/Coen-Lab/chronic-neuropixels/tree/main/Paper-figures\">https://github.com/Coen-Lab/chronic-neuropixels/tree/main/Paper-figures</a>.</p></section><section id=\"acknowledgements\"><h1 class=\"heading-1\">Acknowledgements</h1><p>This work was supported by the Biological Sciences Research Council (BB/T016639/1 to MC and PC, BB/T007907/1 to NLR), Wellcome Trust (110120/185861, 205093, 204915, 219627, 212285, and 227065 to PC, MC, KDH, TWM &amp; CAD, DMK, and CB), the Simons Initiative for the Developing Brain (NLR), The Simons Collaboration on the Global Brain (AKC), the European Research Council under the European Union’s Horizon 2020 research and innovation program (694401 to KDH, 866386 to NLR), the European Molecular Biology Organization (ALTF 740-2019 to CB), the National Institutes of Health (U19NS123716, AKC and MM), the Medical Research Council (MR/V034758/1 to DMK and GL and MR/W006804/1 to AMZ), the GOSH/Spark Research Grant (V4422 to GL), the Gatsby Charitable Foundation (GAT3755 to TWM &amp; CAD), the UCLA Chancellor’s Animal Research Committee 3R’s grant (AW), Whitehall foundation research grant (2021-12-045 to AW), and UK Research and Innovation (EP/Y008804/1 to CAD). FT is supported by the Sainsbury Wellcome Centre PhD program, JMJF is supported by a Wellcome Trust PhD Studentship and AMZ is supported by the Precision Medicine PhD Program. MC holds the GlaxoSmithKline/Fight for Sight Chair in Visual Neuroscience.</p></section>"
}
