{
  "id": "99904",
  "doi": "10.1101/2024.06.13.598855",
  "version": 2,
  "pdf": "https://github.com/elifesciences/enhanced-preprints-data/raw/master/data/99904/v2/99904-v2.pdf",
  "status": "reviewed",
  "authorLine": "Iksoo Chang, Taegon Chung, Sangyeol Kim",
  "title": "Wavenumber-dependent transmission of subthreshold waves on electrical synapses network model of <em>Caenorhabditis elegans</em>",
  "published": "2024-10-08T14:00:00Z",
  "reviewedDate": "2024-10-08T14:00:00Z",
  "versionDate": "2024-12-03T14:00:00Z",
  "statusDate": "2024-12-03T14:00:00Z",
  "stage": "published",
  "subjects": [
    {
      "id": "neuroscience",
      "name": "Neuroscience"
    },
    {
      "id": "physics-living-systems",
      "name": "Physics of Living Systems"
    }
  ],
  "elifeAssessment": {
    "title": "eLife Assessment",
    "content": [
      {
        "type": "paragraph",
        "text": "This study presents numerical results on a framework for understanding the dynamics of subthreshold waves in a network of electrical synapses modeled on the connectome data of the C elegans nematode. The strength of the evidence presented in favor of interference effects being a major component in subthreshold wave dynamics is inadequate and the approach is flawed. Substantial methodological issues are present, including altering the original network structure of the connectome without a clear justification and providing little motivation for the choice of numerical parameters values that were used."
      }
    ],
    "id": "sa3",
    "doi": "10.7554/eLife.99904.2.sa3",
    "significance": [],
    "strength": [
      "inadequate"
    ]
  },
  "indexContent": "<p><strong>eLife Assessment</strong></p>\n<p>This study presents numerical results on a framework for understanding the dynamics of subthreshold waves in a network of electrical synapses modeled on the connectome data of the C elegans nematode. The strength of the evidence presented in favor of interference effects being a major component in subthreshold wave dynamics is inadequate and the approach is flawed. Substantial methodological issues are present, including altering the original network structure of the connectome without a clear justification and providing little motivation for the choice of numerical parameters values that were used.</p>\n\n    <p><strong>Reviewer #1 (Public review):</strong></p>\n<p>Summary:</p>\n<p>This work investigates numerically the propagation of subthreshold waves in a model neural network that is derived from the C. elegans connectome. Using a scattering formalism and tight-binding description of the network -- approximations which are commonplace in condensed matter physics -- this work attempts at showing the relevance of interference phenomena, such as wavenumber-dependent propagation, for the dynamics of subthreshold waves propagating in a network of electrical synapses.</p>\n<p>Strengths:</p>\n<p>The primary strength of the work is in trying to use theoretical tools from a far-away corner of fundamental physics to shed light on the properties of a real neural system.</p>\n<p>Weaknesses:</p>\n<p>The authors provide a good introduction and motivation for studying the propagation of subthreshold oscillations in the inferior olive nuclei. However, they chose to use the C elegans connectome for their study, and the implications of this work for C elegans neuroscience remain unclear by the end of the preprint. The authors should also give more evidence for the claim that their study may give a mechanism for synchronized rhythmic activity in the mammalian inferior olive nucleus, or refrain from making this conclusion. In the same vein, since the work emphasizes the dependence on the wavenumber for the propagation of subthreshold oscillations, they should make an attempt at estimating the wavenumber of subthreshold oscillations in C elegans if they were to exist and be observed. Next, the presence of two \"mobility edges\" in the transmission coefficient calculated in this work is unmistakably due to the discrete nature of the system, coming from the tight-binding approximation, and it is unclear to me if this approximation is justified in the current system. Similarly, it is possible that the wavenumber-dependent transmission observed depends strongly on the addition of a large number of virtual nodes (VNs) in the network, which the authors give little to no motivation for. As these nodes are not present in the C elegans connectome, the authors should explain the motivation for their inclusion in the model and should discuss their consequences on the transmission properties of the network. As it stands, I think the work would only have a very limited impact on the understanding of subthreshold oscillations in the rat or in C elegans. Indeed, the preprint falls short of relating its numerical results to any phenomena which could be observed in the lab.</p>\n,<p><strong>Reviewer #2 (Public review):</strong></p>\n<p>This manuscript addresses an interesting and important question: the basic mechanisms underlying subthreshold intrinsic oscillations in the inferior olive. Instead of a direct investigation of the questions, the authors decide to study subthreshold oscillations in the C-elegance, where the connectivity pattern is known but does not exhibit sub-threshold oscillations. Furthermore, instead of the common description of gap-junction coupling by resistors, the authors decide to represent the system as a tight-binding Anderson Hamiltonian.</p>\n<p>Weaknesses:</p>\n<p>The authors study an architecture of the C-elegance instead of that of the inferior olive of mammals because the architecture of C-elegance is known.</p>\n<p>No subthreshold oscillations were identified in the C-elegance.<br />\nInstead of representing electrical coupling via resistors that connect neurons, the authors use a quantum formalism and introduce the tight-binding Anderson Hamiltonian. Why?</p>\n<p>Equally spaced two virtual nodes were added between cells connected by a gap junction. Why?</p>\n<p>Comments on revised version:</p>\n<p>Last time, I recommended that the authors should represent electrical coupling via resistors that connect neurons instead of via the quantum formalism. The authors have not tested this direction.</p>\n\n    <p><strong>Author response:</strong></p>\n<p>The following is the authors’ response to the original reviews.</p>\n<blockquote>\n<p><strong>Joint Public Review:</strong></p>\n<p>(1) This work investigates numerically the propagation of subthreshold waves in a model neural network that is derived from the C. elegans connectome. Using a scattering formalism and tight-binding description of the network -- approximations which are commonplace in condensed matter physics -- this work attempts to show the relevance of interference phenomena, such as wavenumber-dependent propagation, for the dynamics of subthreshold waves propagating in a network of electrical synapses.</p>\n</blockquote>\n<blockquote>\n<p>(2) The primary strength of the work is in trying to use theoretical tools from a far-away corner of fundamental physics to shed light on the properties of a real neural system. While a system composed of neurons and synapses is classical in nature, there are occasions in which interference or localization effects are useful for understanding wave propagation in complex media [review, van Rossum &amp; Nieuwenhuizen, 1999]. However, it is expected that localization effects only have an impact in some parameter regimes and with low phase dissipation. The authors should have addressed the existence of this validity regime in detail prior to assuming that interference effects are important.</p>\n</blockquote>\n<p>The theoretical concept and tool used in this study are not situated in a far-away corner of fundamental physics but hold one of the central positions in condensed matter physics and statistical physics. In fact, the non-scientific statement about where the theoretical concept and tool employed by the researchers are positioned within the realm of fundamental physics is irrelevant. The fundamental physics governs the foundations of all natural phenomena, and thus it provides indispensable principles for interpreting not only neural systems but also all life phenomena. One such principle explored in our study is the interference and localization of waves.</p>\n<p>Specifically, in the third paragraph of the Introduction, we introduced that the interference effect of subthreshold oscillating waves, beyond being a theoretical possibility, is a phenomenon actually observed in neural tissue (Chiang and Durand, 2023; Gupta et al., 2016). Moreover, according to Devor and Yarom (2002), the propagation of subthreshold oscillations observed in the inferior olivary nucleus extended beyond a distance of 0.2 mm. Therefore, considering the propagation of subthreshold waves and the resulting interference in the connectome of <em>C. elegans</em>, which has a total body length of less than 1 mm, a diameter of about 0.08 mm, and most neurons distributed in the ring structure near its neck, provides sufficient validity for the initiation of theoretical and computational studies.</p>\n<p>The primary objective of our study is to investigate which regimes of signal transmission/localization and interference phenomena are valid within the network of electrical synapses in <em>C. elegans</em>, the only system for which the neural connectome structure is perfectly known. As the Reviewer rightly pointed out in the question, this is exactly the issue that the Reviewer is curious about. Therefore, the existence of this validity regime cannot be addressed prior to conducting the study but can only be identified as a result of performing the research. And we have conducted such a study.</p>\n<blockquote>\n<p>(3) An additional approximation that was made without adequate justification is the use of a tight-binding Hamiltonian. This can be a reasonable approximation, even for classical waves, in particular in the presence of high-quality-factor resonators, where most of the wave amplitude is concentrated on the nodes of the network, and nodes are coupled evanescently with each other. Neither of these conditions were verified for this study.</p>\n</blockquote>\n<p>The tight-binding Anderson Hamiltonian we used in this study originally consisted of the on-site energy at each node and the hopping matrix between nodes. When the on-site energy is relatively much more stable (i.e., has a large negative value) compared to the hopping matrix, most of the wave amplitude becomes concentrated on the nodes as the Reviewer mentioned. However, as is well-known from reference papers (Anderson, 1958; Chang et al., 1995; Meir et al., 1989; Shapir et al., 1982; Thomas and Nakanishi, 2016), in this study, we also removed the on-site energy to prevent the waves from being concentrated on the nodes. Therefore, the tight-binding Hamiltonian we used in this study ensures that waves propagate through edges in the network where the values of the hopping matrix exist.</p>\n<p>To assist the Reviewer in better understanding the model used in this study, we provide additional explanations as follows. In the manuscript, we have already provided detailed descriptions of the setup using the tight-binding Anderson Hamiltonian in the Method section under “Construction of our circuit model” and the explanation of Figure 1. In the model we used, the edges represented by solid lines are perfect conductors, while the dotted lines representing gap junctions act as potential barriers (Fig. 1B). Therefore, when electric signals propagate, we are dealing with the phenomenon where signals transmitted through the edges encounter potential barriers, causing scattering or attenuation. The model described by the Reviewer is indeed a commonly used model in condensed matter physics, but we did not use the exact model mentioned by the Reviewer. Instead, as is common in well-known reference papers, we modified it to suit our purposes. We hope this explanation helps the Reviewer gain a better understanding.</p>\n<blockquote>\n<p>(4) The motivation for this work is to understand the basic mechanisms underlying subthreshold intrinsic oscillations in the inferior olive, but detailed connectivity patterns in this brain area are not available. The connectome is known for C elegans, but sub-threshold oscillations have not been observed there, and the implications of this work for C elegans neuroscience remain unclear. The authors should also give more evidence for the claim that their study may give a mechanism for synchronized rhythmic activity in the mammalian inferior olive nucleus, or refrain from making this conclusion.</p>\n</blockquote>\n<p>We agree with the Reviewer's point. In this study, we do not provide additional analysis on the mammalian inferior olive nucleus beyond what is already known from previous research. What we intended to discuss in the Discussion section was to suggest that within our model, there is a “possibility” that a group of cells exchanging wave signals of a specific wavenumber with high transmittance may show synchronized rhythmic activity. Therefore, to avoid any misunderstanding for the reader, we have revised the corresponding sentence in the Discussion as follows.</p>\n<p>In the Discussion, “The plausible possibility according to our model study is that the constructive interference of subthreshold membrane potential waves with a specific wavenumber may generate the synchronized rhythmic activation.</p>\n<blockquote>\n<p>(5) In the same vein, since the work emphasizes the dependence on the wavenumber for the propagation of subthreshold oscillations, they should make an attempt at estimating the wavenumber of subthreshold oscillations in C elegans if they were to exist and be observed. Next, the presence of two \"mobility edges\" in the transmission coefficient calculated in this work is unmistakably due to the discrete nature of the system, coming from the tight-binding approximation, and it is unclear if this approximation is justified in the current system.</p>\n</blockquote>\n<p>In this study, we modeled the propagation of subthreshold waves on the electrical synapse network of <em>C. elegans</em>, but we did not explain the generation of subthreshold oscillations themselves. Here, we simply injected wave signals with various wavenumber values into the network using a hypothetical device called an \"Injector.\" As the Reviewer pointed out, estimating the wavenumbers of subthreshold oscillations that may exist or be observed in <em>C. elegans</em> would require a comprehensive investigation of the membrane potential dynamics occurring in the membranes of individual neurons. However, this is beyond the scope of this study and would require considerable effort to accomplish.</p>\n<p>As for the use of the tight-binding Hamiltonian, we have addressed that in our response to the third paragraph in the Joint Public Review above.</p>\n<blockquote>\n<p>(6) Similarly, it is possible that the wavenumber-dependent transmission observed depends strongly on the addition of a large number of virtual nodes (VNs) in the network, which the authors give little to no motivation for. As these nodes are not present in the C elegans connectome, the authors should explain the motivation for their inclusion in the model and should discuss their consequences on the transmission properties of the network.</p>\n</blockquote>\n<p>As mentioned in our response to the third paragraph in the Joint Public Review above, in our model, a node is simply a pathway for waves to pass through. Therefore, inserting virtual nodes between two neurons that are connected in the <em>C. elegans</em> connectome does not alter the actual connection structure. In other words, virtual nodes do not create new connections between cells that didn’t exist in the connectome. The virtual nodes we introduced are merely a way to divide the sections—axon, gap junction, dendrite—through which the wave passes when it is transmitted between two neurons. As we have already explained in Fig. 1B, the edge connected by two virtual nodes, represented by a dotted line, is motivated to depict the gap junction acting as a potential barrier. We hope this explanation helps the Reviewer better understand the model used in this study.</p>\n<blockquote>\n<p>(7) As it stands, the work would only have a very limited impact on the understanding of subthreshold oscillations in the rat or in C elegans. Indeed, the preprint falls short of relating its numerical results to any phenomena which could be observed in the lab.</p>\n</blockquote>\n<p>In this study, we proposed a minimalistic model built using the currently available but limited <em>C. elegans</em> connectome information. Specifically, our model is not a phenomenological one that adjusts parameters to accurately predict experimental measurements, but rather an attempt at a novel conceptual approach to theoretically possible scenarios. While the model may not be satisfactory enough to explain experimental phenomena at present, it is a theoretical/computational study that someone needs to undertake. We believe this is the path of scientific progress. Therefore, as the Reviewer has expressed concern, it is entirely understandable that reproducing the numerical results measured in actual experiments is difficult in this study. Nevertheless, we believe that this study makes a basic contribution to the conceptual understanding of subthreshold signal propagation in <em>C. elegans’</em> electric synapses.</p>\n<p>Rather than offering a stretched opinion, we maintain a positive hope that future researchers in this field will improve the model by incorporating more detailed and extensive biological data through follow-up studies, allowing us to get closer to describing real phenomena.</p>\n<blockquote>\n<p><strong>Recommendations for the authors:</strong></p>\n<p><strong>Reviewer #1 (Recommendations for the authors):</strong></p>\n<p>The word \"Sensory\" was misspelled in Figures 2, 4 and 5.</p>\n</blockquote>\n<p>We appreciate the feedback from Reviewer #1. We have corrected the mentioned typos in Figures 2, 4, and 5 of the revised manuscript.</p>\n\n    Iksoo Chang, Taegon Chung, Sangyeol Kim\n    <section id=\"introduction\"><h1 id=\"s1\" class=\"heading-1\">Introduction</h1><p>The ion current flowing through the gap junction between neurons changes the membrane potential of those neurons, which is called signal transmission by electrical synapses.(<a href=\"#c5\">Carew and Kandel, 1976</a>) Electrical synapses have characteristics such as simple structure, fast signal transmission, bidirectional communication (in most cases), and a wide operation range for voltage including the subthreshold region.(<a href=\"#c4\">Bennett, 1997</a>) Based on this, it has been reported that electrical synapses play various roles, such as excitation or inhibition of neurons, synchronization or desynchronization of neural activity, promotion or attenuation of rhythms, and improvement of signal-to-noise ratio, etc.(<a href=\"#c11\">Connors, 2017</a>) Here, rhythm refers to the periodic active pattern of neurons, and in particular, the rhythm in the subthreshold region helps neurons ignite the action potential simultaneously according to the cycle of the rhythm, and a typical example of this can be seen is the excitatory cells in inferior olivary nucleus.(<a href=\"#c2\">Bazzigaluppi et al., 2012</a>; <a href=\"#c3\">Benardo and Foster, 1986</a>; <a href=\"#c15\">Giocomo et al., 2007</a>; <a href=\"#c17\">Khosrovani et al., 2007</a>; <a href=\"#c24\">Long et al., 2002</a>) Spontaneous and robust subthreshold membrane potential oscillations were observed in the inferior olivary cells.(<a href=\"#c3\">Benardo and Foster, 1986</a>; <a href=\"#c10\">Chorev et al., 2007</a>; <a href=\"#c14\">Devor and Yarom, 2002</a>; <a href=\"#c19\">Lampl and Yarom, 1997</a>; <a href=\"#c23\">Llinas and Yarom, 1981</a>) The inferior olivary cells are intra-connected only by electrical synapses, and it was reported that the presence of electrical synapses is largely involved in the synchronization of subthreshold oscillations.(<a href=\"#c13\">De Zeeuw et al., 2003</a>; <a href=\"#c20\">Leznik and Llinás, 2005</a>; <a href=\"#c21\">Leznik et al., 2002</a>; <a href=\"#c22\">Llinás, 2014</a>; <a href=\"#c24\">Long et al., 2002</a>; <a href=\"#c30\">Turecek et al., 2016</a>) Although electrical synapses and subthreshold oscillations are functionally closely related, theoretical and computational exploration of this has been lacking. The occurrence of subthreshold oscillations and their role in neural networks have been explored through pioneering neuron models,(<a href=\"#c26\">Roach et al., 2018</a>; <a href=\"#c28\">Tchumatchenko and Clopath, 2014</a>; <a href=\"#c31\">V-Ghaffari et al., 2016</a>) but the establishment of an entire connectome between numerous neurons belonging to regions such as the inferior olivary nucleus remains a task to be solved in the future.</p><p>In the field of connectome, information on the indexing of all individual neurons, muscles, and organ cells present in the nematode <em>Caenorhabditis elegans (C. elegans)</em> and the entire connectivity between those cells by chemical and electrical synapses was recently updated.(<a href=\"#c12\">Cook et al., 2019</a>) This available connectome data of <em>C. elegans</em> identifies connectivity weights proportional to the structural size of each synapse, with 1,433 electrical synapses present among a total of 469 cells, including neurons, muscles, pharynx, and other organ cells. Some examples of synchronized activity of a small number of neurons through electrical synapses in <em>C. elegans</em> have been reported. During the gentle nose touch response, nose mechanoreceptor neurons connected to electrical synapses simultaneously increased in activity, thereby serving as a coincidence detector.(<a href=\"#c7\">Chatzigeorgiou and Schafer, 2011</a>) And a pair of GABAergic motor neurons controlling the bowel movement program repeated every 50 seconds used synchronized activity through electrical synapses at their axon terminal.(<a href=\"#c9\">Choi et al., 2021</a>) However, direct observation or indirect evidence of spontaneous subthreshold oscillations has NOT been confirmed in <em>C. elegans</em>. Nevertheless, a theoretical and computational model consideration of the signal transmission of subthreshold oscillations on the entire electrical synapse network among cells with various cell types could be a great challenge.</p><p>In general, the wave properties of membrane potential are well-known, such as constructive summation of the two excitatory postsynaptic potentials or deconstructive summation of the excitatory and inhibitory postsynaptic potentials. Likewise, it is experimentally confirmed that subthreshold oscillations have wave properties as fluctuations observed in membrane potential measurements and experience interference when propagated in the neural tissue space.(<a href=\"#c8\">Chiang and Durand, 2023</a>; <a href=\"#c16\">Gupta et al., 2016</a>) Therefore, interference should be considered important when subthreshold membrane potential waves propagate through the neural network and cross each other at one spatial point.</p><p>Here, we attempted to describe a situation in which wave signals, mimicking the subthreshold membrane potential waves, are propagated and interfered on a network that mimics the electrical synapse network of <em>C. elegans</em> (the cells become nodes, the electrical synapses become edges, and the subthreshold waves can flow in both directions on the edges). In the field of physics, the Anderson localization phenomenon has been well known, and it is a general wave phenomenon due to the wave interference between multiple scattering paths. Depending on the strength of the scattering of waves, the result of wave interference could be constructive or destructive, namely, waves could transmit or localize through the media, correspondingly. The theoretical and numerical method for describing the so-called Anderson localization problem usually employed the tight-binding Anderson Hamiltonian. A relevant model was developed to calculate the wave’s quantum percolation using the tight-binding Anderson Hamiltonian on a network lattice consisting of nodes and edges, where the interference by all possible propagation paths was considered when the quantum mechanical probability wave was propagated by experiencing the percolation disorder on the network lattice.(<a href=\"#c1\">Anderson, 1958</a>; <a href=\"#c6\">Chang et al., 1995</a>; <a href=\"#c25\">Meir et al., 1989</a>; <a href=\"#c27\">Shapir et al., 1982</a>; <a href=\"#c29\">Thomas and Nakanishi, 2016</a>) In this study, we benefited from this model, and by treating the probability wave as a general wave signal and replacing the network lattice with a synapse network model we are interested in. We could calculate the interference by all possible paths which were considered when the wave signals propagate in the synapse network.</p><p>By applying the theoretical concept and computational methodology introduced above and well established in the field of physics, we calculated the signal transmission coefficient between arbitrary two cells of the model connectome as a function of the wavenumber (the quantity of inverse of wavelength) of the wave signal. Based on the signal transmission coefficients for all cell-pairs estimated under various wavenumber conditions, we unraveled 1) the existence of a threshold wavenumber above which the signal transmission disappears, 2) regions of cell-pairs with wavenumber-dependent transmission map, 3) long-distance and regular patterned signal transmission, and 4) major hub cell-pair common across multiple wavenumbers. When comparing with the results for a situation that didn’t consider the wave interference, we revealed the role of the interference when subthreshold waves propagate on the <em>C. elegans’</em> electrical synapse network model. Although many aspects of the actual neural network and electrical synapses were simplified or omitted in our model study, our results provided the insight of the fundamental role of the electrical synapse network with subthreshold oscillations.</p><h1 id=\"s2\" class=\"heading-1\">Results</h1><h2 id=\"s2a\" class=\"heading-2\">Cell-pairs in the model connectome of <em>C. elegans</em> could belong to regions where the wave signal could be transmitted (or not transmitted) below (or above) a threshold wavenumber</h2><p>In our circuit model mimicking the anatomical gap junction network of <em>C. elegans</em> (details described in “Construction of our circuit model” part of Methods) (<a href=\"#fig1\">Fig. 1</a>), we calculated all the transmission coefficient <em>T</em><sub><em>ij</em></sub> of the wave signal for each of the 109,746 cell-pairs 〈<em>i</em>, <em>j</em>〉 between the total 469 cells (details described in “Calculation for the transmission coefficient” part of Methods). Here, the transmission coefficient was a function of energy E of the incoming wave, and the <em>E</em> value was a function of the wavenumber k of the wave signal. And according to the wavenumber, <em>E</em> value was set up to exist in the range [−10, 10], and we calculated all the <em>T</em><sub><em>ij</em></sub>(<em>E</em>) of the entire cell-pairs at <em>E</em> values of 801 points listed by equal intervals over the entire range (Δ<em>E</em> = 0.025).</p><div class=\"figure-container\"><figure class=\"figure\" id=\"fig1\"><label class=\"figure__label\">Figure 1.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_fig1.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_fig1.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Anatomical gap junction network and our circuit model.</h4><p><strong>(A)</strong> In the sample of the network diagram on the left, there are white-filled nodes stand for cells, and the edges of a solid line stand for the anatomical gap junction between them. The graph on the right is the distribution of 1,433 gap junction weights obtained from the connectome data of <em>C. elegans</em>. <strong>(B)</strong> In the sample of the network diagram on the left, equally spaced two virtual nodes were added between cells connected by a gap junction, and the virtual node is presented as a black-filled circle. The solid line stands for the connection between the cell and the virtual node that gave a weight of 1, and the dotted line stands for the connection between the two virtual nodes that gave our processed weight between 0 and 1. Our processed weights are calculated from the anatomical gap junction weights, and the graph on the right shows its distribution.</p></figcaption></figure></div><p>First, the average transmission coefficient of all cell-pairs 〈<em>i</em>, <em>j</em>〉 for each <em>E</em> value, 〈<em>T</em><sub><em>ij</em></sub>(<em>E</em>)〉<sub><em>All</em></sub> <sub><em>ij</em></sub> <sub><em>cell</em>−<em>pairs</em></sub>, was obtained and drawn as a function of E (<a href=\"#fig2\">Fig. 2A</a>). The 〈<em>T</em>(<em>E</em>)〉 graph showed an incomplete but quite symmetrical form based on <em>E</em> = 0. And on the real Y-axis scale, high 〈<em>T</em>(<em>E</em>)〉 values were broadly identified in these three ranges of the <em>E</em> values: [−1.575, −1.275], [−0.350, 0.350], and [1.275, 1.575], Also on the log Y-axis scale, several relatively high 〈<em>T</em>(<em>E</em>)〉 values were locally identified in the form of peaks in the remaining ranges of the <em>E</em> values. Meanwhile, on the log Y-axis scale, the signal transmission of all cell-pairs almost disappeared in the <em>E</em> value range at both ends. In the field of solid-state physics, a threshold energy value in which electrical conductivity disappears in the energy band is called a &quot;mobility edge&quot;. We were able to define a threshold wavenumber, namely a signal mobility edge, even in the transmission of the wave signal of our circuit model. For example, considering that 〈<em>T</em>(<em>E</em>)〉 = 10<sup>−7</sup> is a value that can be obtained when only one cell-pair out of all cell-pairs shows 1% transmission and all others are completely unable to transmit the wave, this 10<sup>−7</sup> value can be regarded as an extreme disappearance of signal transmission throughout the entire circuit. Thus, by taking this reference value, <em>E</em> = ±5.650 in our circuit model became a signal mobility edge. If the reference value is set more conservatively lower than now, the absolute value of E corresponding to the signal mobility edges will be larger than now.</p><div class=\"figure-container\"><figure class=\"figure\" id=\"fig2\"><label class=\"figure__label\">Figure 2.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_fig2.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_fig2.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Wavenumber-dependent transmission coefficient.</h4><p>Average transmission coefficient for all cell-pairs as a function of <em>E</em> values (<em>E</em> value is a function of the wavenumber of the subthreshold wave). <strong>(A)</strong> The upper panel shows the average transmission coefficient graph on the Y-axis of the real scale and the lower panel shows the same graph on the Y-axis of the log scale. The reference value (10<sup>-7</sup>) of the signal mobility edge is indicated in the lower panel as a dot-dash line. <strong>(B)</strong> The transmission coefficient of all cell-pairs at <em>E</em> = 0.225 is represented as a heatmap, which is the highest average transmission coefficient in our result. <strong>(C)</strong> The transmission coefficient of all cell-pairs at <em>E</em> = 5.650 is represented as a heatmap, which is one of the signal mobility edges. <strong>(B, C)</strong> In heatmap, the X and Y axes are arranged according to the index of 469 cells, and the index follows that of the original connectome data. Instead of displaying all cell names, only seven cell types were indicated.</p></figcaption></figure></div><p>Next, the transmission coefficient of all individual cell-pairs <em>T</em><sub><em>ij</em></sub>(<em>E</em> = 0.225) was represented as a heatmap at the <em>E</em> value (or the corresponding wavenumber) where the 〈<em>T</em>(<em>E</em> = 0.225)〉 value was the highest (<a href=\"#fig2\">Fig. 2B</a>). Here, we confirmed that not all cell-pairs transmit the wave signals with even transmission coefficients. Most of the strong transmissions were found in the cell-pairs of intra-body-wall muscles, and a small number of cells belonging to sensory neurons, motor neurons, and other organ cells also showed strong transmission in cell-pairs between them or to body-wall muscles. The rest of the cells except these cells were almost isolated separately without exchanging the wave signals with any cells even at this <em>E</em> value, which was the highest transmitted state on average.</p><p>In addition, the transmission coefficient of all individual cell-pairs <em>T</em><sub><em>ij</em></sub>(<em>E</em> = 5.650) was represented as a heatmap at the <em>E</em> value (or the corresponding wavenumber) which we defined as the signal mobility edge (<a href=\"#fig2\">Fig. 2C</a>). As expected, all cells were isolated separately without exchanging the wave signals with each other, and the entire circuit stop transmitting wave signals of this wavenumber.</p><h2 id=\"s2b\" class=\"heading-2\">Transmission map of subthreshold waves on the electrical synapse network model depended on values of wavenumber</h2><p>Between the two <em>E</em> values discussed above (<em>E</em> = 0.225 and <em>E</em> = 5.650), the average transmission coefficient of all cell-pairs, 〈<em>T</em>(<em>E</em>)〉, did not simply increase or decrease, but fluctuated along the <em>E</em> value (<a href=\"#fig2\">Fig. 2</a>). Therefore, it was expected that the composition of the cell-pairs, which showed strong transmission, also changes according to the <em>E</em> value. To efficiently investigate the changes in the composition of the cell-pairs, instead of inspecting the <em>T</em><sub><em>ij</em></sub>(<em>E</em>) heatmaps in all <em>E</em> values, we selected 31 specific <em>E</em> values and tried to analyze the composition of the cell-pairs only in these <em>E</em> values. We chose the specific <em>E</em> values on the following three criteria: (1) the 〈<em>T</em>(<em>E</em>)〉 value was the local maximum (the shape of a peak) in the 〈<em>T</em>(<em>E</em>)〉 graph, (2) the components of the <em>T</em><sub><em>ij</em></sub>(<em>E</em>) showed greater than 0.5 at least one cell-pair, (3) The <em>E</em> value was positive number (<a href=\"#figs1\">Fig. S1</a>). The reasons why we used these conditions are as follows (1) we assumed that the peak occurred in the 〈<em>T</em>(<em>E</em>)〉 graph due to the emergence of new cell-pairs with strong transmission, (2) we set the reference value for strong transmission to be 0.5 or higher, and (3) the <em>E</em> values where peak occurred in the 〈<em>T</em>(<em>E</em>)〉 graph showed left-right symmetry based on <em>E</em> = 0. (Additional explanations are in “Auxiliary paragraph 1” of Supplementary Materials.)</p><p>The transmission coefficients of all individual cell-pairs were represented as a heatmap at each <em>E</em> value (or the corresponding wavenumber) for the 31 specific <em>E</em> values we selected (Left panels in <a href=\"#fig3\">Fig. 3</a> and S2-9). To closely observe the composition of cell-pairs with strong transmission, only cells (<a href=\"#tbls1\">Table S1</a>-<a href=\"#tbls3\">3</a>) belonging to the cell-pairs with <em>T</em><sub><em>ij</em></sub>(<em>E</em>) &gt; 0.5 were selectively exhibited in these heatmaps, not for all 469 cells. To confirm the spatial status of the cell-pairs with strong transmission on the electrical synapse network model, a network diagram was prepared first. Since drawing all 469 cells as a network diagram was complicated and poorly visible, we presented nodes for only 173 cells that belonged to the cell-pairs with <em>T</em><sub><em>ij</em></sub>(<em>E</em>) &gt; 0.5 in the positive <em>E</em> values. Electrical synapses between cells were represented as edges, and the thickness of the edge proportional to our processed weights (<em>w</em><sub><em>ij</em></sub>) was used. (Additional explanations are in “Auxiliary paragraph 2” of Supplementary Materials.) On the prepared network diagram, we marked the cell-pairs with strong transmission that satisfies <em>T</em><sub><em>ij</em></sub> &gt; 0.5 (Right panels in <a href=\"#fig3\">Fig. 3</a> and S2-9).</p><div class=\"figure-container\"><figure class=\"figure\" id=\"fig3\"><label class=\"figure__label\">Figure 3.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_fig3.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_fig3.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Wavenumber-dependent transmission map.</h4><p>The cell-pairs with strong transmission (<em>T</em><sub><em>ij</em></sub>(<em>E</em>) &gt; 0.5) at <strong>(A)</strong> <em>E</em> = 0.225, <strong>(B)</strong> <em>E</em> = 0.800, <strong>(C)</strong> <em>E</em> = 1.450, and <strong>(D)</strong> <em>E</em> = 3.875 (or the corresponding wavenumbers) are shown, respectively. The left panels represent the transmission coefficient between cells belonging to the cell-pairs with strong transmission at each <em>E</em> value as a heatmap. Here, the X and Y axes are the cell index, and the cell name corresponding to the cell index can be found in <a href=\"#tbls1\">Table S1</a>-<a href=\"#tbls3\">3</a>. The right panels display the cell-pairs of strong transmission at each <em>E</em> value as red bidirectional arrows of the same thickness on the network diagram. In the network diagram, the cell name is written inside the circle that stands for each node (for the body-wall muscles, the cell name is abbreviated as follows; ex) dBWML1 → dL1), and the color of the node stands for the cell type (Red: Pharynx cells, Orange: Sensory neurons, Yellow: Inter neurons, Green: Motor neurons, Light blue: Body-wall muscles, Purple: Other end organs, Magenta: Sex-specific cells). Edges indicated by black solid lines stand for the electrical synapses among the cells, and the thickness of the edges is proportional to our processed weight. In the network diagram, only 173 cells that belonged to the cell-pair with strong transmission at least once in positive <em>E</em> values are represented, and the remaining cells and the electrical synapses by them are omitted from display. The virtual nodes of our circuit are also omitted from the display.</p></figcaption></figure></div><p>As expected above, the region of the cell-pairs with strong transmission changed depending on the value of <em>E</em> (or wavenumber), which we named &quot;Wavenumber-Dependent Transmission Map (WDTM) of subthreshold waves on the electrical synapse network model&quot;. However, it should be also noted that our WDTM was a result derived from a network where only electrical synapses were considered, not a general neural network where chemical and electrical synapses coexist.</p><p>We looked at the cell type of the cell-pairs that make up the 31 WDTMs (<a href=\"#fig3\">Fig. 3</a> and S2-9). In the two <em>E</em> value ranges of [0, 0.350] and [1.275, 1.575], the high 〈<em>T</em>(<em>E</em>)〉 value was broadly identified (<a href=\"#figs1\">Fig. S1</a>), and many cell-pairs of intra-body-wall muscles were observed in the corresponding WDTMs of these <em>E</em> values (<a href=\"#fig3\">Fig. 3A, 3C</a>, <a href=\"#fig2\">S2</a>, S3A-B, and S5). Since the body-wall muscles consist of four muscle strands: dorsal/ventral-left/right strands, the cell-pair of intra-body-wall muscles can be divided into two cases: a cell-pair of intra-strand and a cell-pair of inter-strand. Following this classification, the cell-pairs of both intra-strand and inter-strand were found in the WDTMs of the <em>E</em> value range of [0, 0.350] (<a href=\"#fig3\">Fig. 3A</a>, <a href=\"#figs2\">S2</a>, and <a href=\"#figs3\">S3A-B</a>), whereas only the cell-pairs of intra-strand were found in the WDTMs in the <em>E</em> value range of [1.275, 1.575] (<a href=\"#fig3\">Fig. 3C</a> and S5). On the other hand, in the remaining WDTMs, a small number of cell-pairs within cells with less than ten members were mostly found (<a href=\"#fig3\">Fig. 3B, 3D</a>, <a href=\"#figs3\">S3C-D</a>, <a href=\"#figs4\">S4</a>, and <a href=\"#figs6\">S6</a>-<a href=\"#figs9\">9</a>), and the WDTMs of the two largest cases were shown in <a href=\"#fig3\">Fig. 3B</a> and <a href=\"#fig3\">3D</a>. The composition of cell-pairs with various combinations of cell types (sensory/inter/motor neurons, body-wall/sex-specific muscles, pharynx, and other organ cells) was shown in these remaining WDTMs.</p><h2 id=\"s2c\" class=\"heading-2\">Cell-pairs in body-wall muscles on long-distance with regular patterned transmission were found in the WDTMs</h2><p>When looking at each WDTM on the network diagram, it shows various patterns spatially. In particular, in the case of the body-wall muscles, the cell-pairs of intra-strand existed, ranging from short-distance to the longer distance than the half of the full length of the strand (<a href=\"#fig3\">Fig. 3A</a> and <a href=\"#fig3\">3C</a>). Here, the &quot;Distance&quot; was meant by the length of the shortest path along the network between two cells of a cell-pair. If two cells are directly connected to an edge, the distance between the two cells is one. In the WDTMs of the <em>E</em> value range of [1.275, 1.575], cell-pairs with regular patterned transmission of the body-wall muscles were observed through the network diagram (<a href=\"#figs5\">Fig. S5</a>). Only the cell-pairs of intra-strand were found in these WDTMs, and the configuration of the distance of these cell-pairs was different for each WDTM (multiple of 3 at <em>E</em> = 1.350, multiple of 2 at <em>E</em> = 1.450, multiple of 7 at <em>E</em> = 1.500, and multiple of 4 at <em>E</em> = 1.575).</p><p>On the other hand, when the cell-pairs of inter-strand of the body-wall muscles appeared in the WDTMs as shown in <a href=\"#fig3\">Fig. 3A-B</a>, the head mesodermal cell (hmc) seemed to play an important role in building a bridge between them. This would be recognized from the network diagram itself of black edges without WDTM, and hmc was strongly connected near the neck of the body-wall muscles (seventh and eighth muscles) for all four strands. In the WDTM of <a href=\"#fig3\">Fig. 3A</a>, there were many cell-pairs of inter-strand between dorsal-right and ventral-left strands, and there were also many cell-pairs between the ventral-left strand and hmc, which directly revealed the role of hmc as a bridge between the two body-wall muscle strands. In the WDTM of <a href=\"#fig3\">Fig. 3B</a>, it was shown that the role of hmc was indirectly revealed as the cell-pairs of inter-strand, which existed only among the neck of four body-wall muscle strands.</p><p>Additionally, we reaffirmed the important role of hmc while confirming the distance characteristics of the cell-pairs with strong transmission. Under the conditions used when preparing the network diagram (the transmission coefficient <em>T</em><sub><em>ij</em></sub>(<em>E</em>) of a cell-pair was 0.5 or higher in the range of positive <em>E</em> values at least once), a total of 146 cell-pairs with strong transmission were identified excluding the cell-pairs of intra-body-wall muscles, and their distance was investigated (<a href=\"#tbls4\">Table S4</a>). (Additional explanations are in “Auxiliary paragraph 3” of Supplementary Materials.) Most of the cell-pairs in <a href=\"#tbls4\">Table S4</a> showed the kinds of short-distances 1 to 3, which consisted of various cell types. On the other hand, the cell-pairs with long-distances in <a href=\"#tbls4\">Table S4</a> ranging from 4 to 17 were mainly pairs between hmc and body-wall muscles. The strong transmission between hmc and the tail muscle, which corresponds to the longest distance, passes through the intra-strand connections from the neck to the tail of body-wall muscles.</p><p>A few cell-pairs of strong transmission with long-distance in <a href=\"#tbls4\">Table S4</a> turned out to be not those between hmc and the body-wall muscles. In there, one inter neuron (AVBR) and two motor neurons (AS11, VD04) formed a cell-pair with the body-wall muscles, respectively, and four sensory neurons (CEPDL, IL1R, IL1DR, OLQDL) formed cell-pairs between them.</p><h2 id=\"s2d\" class=\"heading-2\">Major hub cell-pairs with the strong transmission of signals for many wavenumbers exist</h2><p>We looked at cell-pairs frequently appearing in all 31 WDTMs in order to identify the major hub cell-pairs that is commonly used for various wavenumbers. First, for each cell-pair 〈<em>i</em>, <em>j</em>〉, we calculated the average appearance rate in all 31 WDTMs, 〈Θ[<em>T</em><sub><em>ij</em></sub>(<em>E</em>) − 0.5]〉<sub><em>E</em>∈{31</sub> <sub><em>selected</em></sub> <sub><em>E</em>}</sub>, and represented this as a heatmap (<a href=\"#fig4\">Fig. 4</a>). Where, the Θ[<em>x</em>] was a step function, which value was 1 if <em>x</em> ≥ 0 or 0 if <em>x</em> &lt; 0. Thus, the average appearance rate was 1 in the case of a cell-pair that appeared in all 31 WDTMs, and 1/31 ≈ 0.03 in the case of a cell-pair that appeared only once. In this study, we declared a cell-pair as a major hub cell-pair if the average appearance rate of a cell-pair was 3/31 ≈ 0.1 or higher. The major hub cell-pairs were the cell-pairs of intra-strand of the body-wall muscles (<a href=\"#fig4\">Fig. 4</a>). As seen in the network diagram, the edges of each strand of the body-wall muscles from the neck (seventh or eighth muscle) to the tail (twenty-third or twenty-fourth muscle) were simply connected in a line, unlike the messy edges among most neurons in the network (<a href=\"#fig3\">Fig. 3</a>). In general, the complexity of connections among most neurons increase with the number of transmissible paths of wave propagation, and the sum of phase changes coming from various path-length differences causes the deconstructive interference. Therefore, the simple (or regular) connections in each strand of the body-wall muscles from the neck to the tail reduced the number of transmissible paths of wave signals, which suppressed deconstructive interference and thus resulted in the strong transmission for various wavenumbers.</p><div class=\"figure-container\"><figure class=\"figure\" id=\"fig4\"><label class=\"figure__label\">Figure 4.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_fig4.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_fig4.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Average appearance rate as cell-pair with strong transmission in the WDTMs.</h4><p>The average appearance rate of all cell-pairs is represented as a heatmap. Here, the X and Y axes are arranged according to the index of 469 cells, and the index follows that of the original connectome data. Instead of displaying all cell names, only seven cell types were indicated. The highest rate is 7/31 ≈ 0.23, and four cell-pair groups showing rates of 3/31 ≈ 0.1 or higher are identified and numbered in the heatmap. (1) PVDL-PVDR pair, (2) hmc-vBWML6, hmc-vBWML7, and hmc-vBWML8 pairs, (3) CANL-CANR, CANL-exc_cell, and CANR-exc_cell pairs, (4) many cell-pairs of intra-strand of the body-wall muscles.</p></figcaption></figure></div><p>Also, the cell-pairs between hmc and the neck of the ventral-left strand of the body-wall muscles were also identified as major hub cell-pair (<a href=\"#fig4\">Fig. 4</a>). As seen in the network diagram, since the edges between hmc and the neck muscles were very strong compared to other edges (<a href=\"#fig3\">Fig. 3</a>), the relative contribution of wave signals coming from other cells could be almost ignored, and thus resulted in the strong transmission for various wavenumbers.</p><p>The cell-pairs among two sensory neurons (PVDL, PVDR) and three other organ cells (CANL, CANR, exc_cell) were also identified as major hub cell-pairs (<a href=\"#fig4\">Fig. 4</a>). The cell-pair between CANL and CANR was the most major hub cell-pair, with the highest average appearance rate of 7/31 ≈ 0.23. As seen in the network diagram, the three other organ cells were very strongly connected by the edges to each other, and the two sensory neurons were very strongly connected by the edges to both ALA inter neuron and hmc (<a href=\"#fig3\">Fig. 3</a>). Although there were cases where they were strongly connected by the edges to each other, such as between PVDL and CANL or between PVDR and CANR, they were not major hub cell-pair. Therefore, the strong edge shown on the network diagram was not a sufficient condition to implicate a major hub cell-pair.</p><h1 id=\"s3\" class=\"heading-1\">Discussion</h1><p>The fundamental aspect of this study is that the interference phenomena of the subthreshold oscillations propagating on a neuronal circuit was described by a theoretical and computational model study of the reference system <em>C. elegans</em> for which the structural anatomical connectome was completely known. We investigated the wavenumber-dependent transmission of the sinusoidal wave signals between all cell-pairs on the connectome model of <em>C. elegans</em> by considering the interference effect caused by multi-paths of signaling.</p><p>The results related to the wavenumber-dependent transmission map expanded the way we used to view signal transmission on electrical synapses. The difference in signal transmission with the presence or absence of interference effect on electrical synapses could be illustrated by considering the effective conductance between two nodes in the electric circuit with or without considering the interference effect (<a href=\"#fig5\">Fig. 5</a>). For a situation without considering the interference, we calculated the effective resistance and effective conductance for all cell-pairs by imitating a cell as a node and the electrical synapse as an electrical resistor connecting nodes as shown in <a href=\"#fig5\">Fig. 5A</a> (details in “Calculation for effective conductance” part of Methods). Several inter neurons and other organ cells showed high effective conductance, while pharynx, body-wall muscles from the neck to the tail, and sex-specific muscles showed very low effective conductance (<a href=\"#fig5\">Fig. 5B</a>). Since inter neurons have many complex connections among them, many electrical current paths exist between the two inter neurons, which act as parallel connections of multiple electrical resistors. This results in lower effective resistance (or higher effective conductance). However, for a situation with considering the interference, many transmissible forward and backward paths of the signal propagation rather caused the deconstructive interference, preventing the transmission of the signal. For each cell-pair 〈<em>i</em>, <em>j</em>〉, we calculated the average transmission coefficient for all <em>E</em> values and represented this as a heatmap (<a href=\"#fig5\">Fig. 5C-D</a>). Which clearly showed that most of the neurons could not exchange wave signals with each other except for very few neurons. Wave signals were effectively delivered only within a small number of very strongly connected cell groups (PVDL/R, CANL/R, exc_cell, hmc) or within a large number of very regularly connected cell groups (body-wall muscle strands from the neck to the tail).</p><div class=\"figure-container\"><figure class=\"figure\" id=\"fig5\"><label class=\"figure__label\">Figure 5.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_fig5.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_fig5.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Differences depending on whether the electrical synapse network model considers interference.</h4><p><strong>(A)</strong> In the electrical synapse network model without considering interference, when the electrical synapse is treated as an electrical resistor, the effective conductance (the reciprocal of the effective resistance) experienced by the external direct current power applied to an arbitrary cell-pair was calculated, and this value was represented as <strong>(B)</strong> a heatmap for all cell-pairs. <strong>(C)</strong> In our circuit considering interference of wave signals, the average transmission coefficient for all <em>E</em> values (or all wavenumbers) of an arbitrary cell-pair was calculated, and this value was represented as <strong>(D)</strong> a heatmap for all cell-pairs. <strong>(B, D)</strong> In heatmap, the X and Y axes are arranged according to the index of 469 cells, and the index follows that of the original connectome data. Instead of displaying all cell names, only seven cell types are indicated.</p></figcaption></figure></div><p>In this study, we used the structural anatomical information from <em>C. elegans’</em> electrical synapse network, but no synchronized rhythmic activity induced by subthreshold membrane potential oscillations has been reported for <em>C. elegans</em> so far. However, we aimed at investigating the signaling characteristics caused by the interference and to discover a feasible phenomenon related to the propagation of the subthreshold oscillations on a neuronal circuit of living nervous system. As to the synchronized rhythmic activation observed like in the mammalian inferior olive nucleus, we think that there might be an electrical synapse network in there that connect cells very strongly or very regularly. The plausible possibility according to our model study is that the constructive interference of subthreshold membrane potential waves with a specific wavenumber may generate the synchronized rhythmic activation. We hope that the results in our study would serve as the worthwhile framework and knowledge for designing the future experimental studies not only for inferior olive nucleus, <em>C. elegans</em> but also other living systems.</p><h1 id=\"s4\" class=\"heading-1\">Methods</h1><h2 id=\"s4a\" class=\"heading-2\">Construction of our circuit model</h2><p>We used the contents of the &quot;hermaphrodite gap jn symmetric&quot; tab in the &quot;SI 5 Connectome adjacency matrices, corrected July 2020.xlsx&quot; file of the <em>C. elegans</em> connectome dataset as data for the anatomical gap junction network.(<a href=\"#c12\">Cook et al., 2019</a>) The 469 cell names and the gap junction weight (<em>g</em><sub><em>ij</em></sub>) of all cell-pairs connected by gap junction were provided in the tab, and the weights had a value distribution from a minimum of 1 to a maximum of 401 (<a href=\"#fig1\">Fig. 1A</a>). The weights were proportional to the spatial size of the corresponding gap junction, which we hypothesized that the larger the weight, the stronger the connection between the cells and thus the better transmit the wave signal to the connected cell.</p><p>Our circuit model described <em>C. elegans’</em> anatomical gap junction network as follows (<a href=\"#fig1\">Fig. 1B</a>). First, each cell was treated as a node in our circuit. Each gap junction connected to a cell-pair was treated as an edge connecting two nodes in our circuit, and we inserted two virtual nodes (VNs) between those two nodes to be connected sequentially through VNs (Cell-VN-VN-Cell). Here, all edges inside our circuit were set to have the identical length <em>a</em>. The edge of Cell-to-VN (or VN-to-Cell) representing like axon or dendrite of neuron gave a weight of 1, and the edge of VN-to-VN representing a gap junction gave our processed weight (<em>w</em><sub><em>ij</em></sub> = min{1, <em>g</em><sub><em>ij</em></sub>⁄40}). Our processed weight (<em>w</em><sub><em>ij</em></sub>) was proportional to the anatomical gap junction weight (<em>g</em><sub><em>ij</em></sub>) and normalized as a value between 0 and 1 but was fixed to 1 if <em>g</em><sub><em>ij</em></sub> &gt; 40. In our circuit model, the weight of the edge meant the transmission coefficient of the signal transmitted through this edge, so if the weight was 1 corresponded to complete transmission, and 0 corresponded to complete reflection (or unavailable edge), respectively. And within our circuit, the characteristic of the signal being spontaneously attenuated, and disappearing was excluded. Therefore, when a signal incoming from the outside to a node in our circuit was reflected to the outside at the same node and simultaneously transmitted to the outside at another node, the sum of the transmission and reflection coefficients to the outside always remained at 1 without loss.</p><h2 id=\"s4b\" class=\"heading-2\">Calculation for the transmission coefficient</h2><p>We benefited from the method of calculating the transmission coefficient according to the energy E of the incoming wave when the electron probability wave incident on one point of the network lattice was detected on another point. This methodology, called the quantum percolation model, considered the propagation and interference of waves on the network lattice using the tight-binding Anderson Hamiltonian.(<a href=\"#c1\">Anderson, 1958</a>; <a href=\"#c6\">Chang et al., 1995</a>; <a href=\"#c25\">Meir et al., 1989</a>; <a href=\"#c27\">Shapir et al., 1982</a>; <a href=\"#c29\">Thomas and Nakanishi, 2016</a>) In our methodology, we replaced the classical wave signals of complex number expression representing subthreshold membrane potential waves instead of the electron probability wave and replaced the network lattice with our circuit describing the electrical synapse network model built above. Then, the transmission coefficient calculated by the quantum percolation model told how well the subthreshold waves were transmitted from one cell <em>i</em> to another cell <em>j</em> while undergoing interference by multiple propagation paths in the electrical synapse network model. Here, the electrical synapses act as wave scatters that interrupt the propagation of the subthreshold waves from cell <em>i</em> to cell <em>j</em>.</p><p>In the quantum percolation model, the tight-binding Anderson Hamiltonian was defined as follows,\n</p><p><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_ueqn1.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_ueqn1.gif/full/max/0/default.jpg\" alt=\"\"/></picture></p><p>Where the |<em>m</em>⟩ (also expressed as the <em>ψ</em><sub><em>m</em></sub>) is as the electron probability wave on the <em>m</em>-th node, and the ⟨<em>m</em>| means its complex conjugate <picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_inline1.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" class=\"inline-image\" src=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_inline1.gif/full/max/0/default.jpg\" alt=\"\"/></picture>. We used <em>ψ</em><sub><em>m</em></sub> as the classical wave signal observed on the <em>m</em>-th node, which of complex number expression made it easy to express the phase shift of the wave and calculate the interference. The amplitude of this classical wave signal on the <em>m</em>-th node was defined as the <picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_inline2.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" class=\"inline-image\" src=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_inline2.gif/full/max/0/default.jpg\" alt=\"\"/></picture> In the Hamiltonian, the <em>ε</em><sub><em>m</em></sub> is the on-site energy, and we regarded it as the resting membrane potential of the <em>m</em>-th cell and set it to 0, the identical value as the relative reference value of the resting membrane potential in all cells. The 〈<em>mn</em>〉 represents a pair of nearest-neighbor sites in the Hamiltonian, we replaced it with a node-pair connected by the edges in our circuit. The <em>V</em><sub><em>mn</em></sub> as a hopping matrix represents the entire structure of the network lattice in the Hamiltonian, which we implemented the structure of our circuit by setting it to <em>V</em><sub><em>mn</em></sub> = 1 for a node-pair between cell and VN, and <em>V</em><sub><em>mn</em></sub> = <em>w</em><sub><em>mn</em></sub> for that between two VNs. Since the total number of the cells was 469, and we inserted two VNs for every 1,433 electrical synapses, the newly constructed tight-binding Anderson Hamiltonian for our circuit was represented as a matrix of 3,335 by 3,335.</p><p>By solving the time-independent Schrödinger equation <picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_inline3.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" class=\"inline-image\" src=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_inline3.gif/full/max/0/default.jpg\" alt=\"\"/></picture> for the Hamiltonian of our circuit, we sought to obtain the reflection and transmission coefficients of the cell-pair between the IN-cell and the OUT-cell from the <em>ψ</em><sub><em>IN</em></sub> of the IN-cell where the wave signal from the outside was incident and reflect, and the <em>ψ</em><sub><em>OUT</em></sub> of the OUT-cell where the wave signal from our circuit transmitted to the outside. We defined <em>ψ</em><sub><em>IN</em></sub> and <em>ψ</em><sub><em>OUT</em></sub> as follows using complex numbers <em>r</em> and <em>t</em> with amplitudes and phases,\n</p><p><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_ueqn2.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_ueqn2.gif/full/max/0/default.jpg\" alt=\"\"/></picture></p><p>\nWhere the <em>ψ</em><sub><em>IN</em></sub> was the sum of 1 and <em>r</em> corresponding to the incoming wave and the reflective wave, respectively, and the <em>ψ</em><sub><em>OUT</em></sub> was <em>t</em> corresponding to the transmitted wave. The reason why the amplitude and the phase of the incoming wave on the IN-cell were 1 and 0, respectively was because we set that as a reference amplitude and a reference phase in our circuit. The amplitude of the wave reflected from the IN-cell to the outside became the reflection coefficient with <em>R</em> = <em>r</em><sup>∗</sup><em>r</em>, and the amplitude of the wave transmitted from the OUT-cell to the outside became the transmission coefficient with <em>T</em> = <em>t</em><sup>∗</sup><em>t</em>, and <em>T</em> + <em>R</em> = 1 had to be always satisfied, as mentioned above.</p><p>This methodology also assumed both an external injector and an external detector. The external injector injected the generated wave into the network lattice and received the reflective wave from the network lattice. The external detector received the transmitted wave from the network lattice. The waves on the external injector <em>ϕ</em><sub><em>Injector</em></sub> and the external detector <em>ϕ</em><sub><em>Detector</em></sub> were extended from the definitions of <em>ψ</em><sub><em>IN</em></sub> and <em>ψ</em><sub><em>OUT</em></sub> above, respectively, and determined as follows,\n</p><p><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_ueqn3.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_ueqn3.gif/full/max/0/default.jpg\" alt=\"\"/></picture></p><p>\nThe external injector and detector were set to be connected to the IN-cell and OUT-cell by a perfect conducting wire with a length of <em>a</em>, respectively. The wave outgoing to the external injector (detector) from the IN-cell (OUT-cell) was determined by multiplying the phase difference of <em>e</em><sup><em>ika</em></sup> to the wave on the IN-cell (OUT-cell), whereas the wave incoming to the IN-cell from the external injector was determined by multiplying the phase difference of <em>e</em><sup>−<em>ika</em></sup> to the wave on the IN-cell. Insert these terms into the time-independent Schrödinger equation for the Hamiltonian of our circuit, the following equation was derived describing the entire system consisting of our circuit and the external injector and detector,\n</p><p><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_ueqn4.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_ueqn4.gif/full/max/0/default.jpg\" alt=\"\"/></picture></p><p>\nWhere the <em>E</em> value on the right side representing the energy of the entire system was equivalent to the energy E of the incoming wave from the external injector.</p><p>In the quantum percolation model, the energy E of the incoming wave was defined as a tight-binding energy function as follows,\n</p><p><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_ueqn5.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_ueqn5.gif/full/max/0/default.jpg\" alt=\"\"/></picture></p><p>\nWhere <em>γ</em> meant the binding energy between the nearest-neighbor atoms in the tight-binding model, but we had to set it to an arbitrary value. In this study, it was set to <em>γ</em> = 5, and the decision process was described in the below section. Applying this energy function, the above equation for the entire system was expressed as the matrices as follows,\n</p><p><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_ueqn6.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_ueqn6.gif/full/max/0/default.jpg\" alt=\"\"/></picture></p><p>\nWhere <em>m</em> and <em>n</em> meant the 3,333 remaining nodes except two nodes for IN-cell and OUT-cell. For a wavenumber <em>k</em> in the range of [0, <em>π</em>/<em>a</em>] (or an <em>E</em> value in the range of [−2<em>γ</em>, 2<em>γ</em>]), all components of both the left-hand square-matrix and the right-hand column-vector were fully expressed as complex numbers, and then the <em>r</em> and <em>t</em> values in the left-hand column-vector were obtained by matrix multiplication of the inverse matrix of the left-hand square-matrix and the right-hand column-vector. From squared absolute the <em>r</em> and <em>t</em> values, the reflection and transmission coefficients of the cell-pair between IN-cell and OUT-cell at the <em>E</em> value (or the corresponding wavenumber <em>k</em>) were deduced, respectively.</p><h2 id=\"s4c\" class=\"heading-2\">Searching for optimal gamma</h2><p>To determine the appropriate <em>γ</em> of the above energy function, we preliminarily calculated the transmission coefficient for all cell-pairs between the 469 cells under all four conditions of <em>γ</em>, and compared the average transmission coefficient graph as a function of the <em>E</em> value 〈<em>T</em><sub><em>ij</em></sub>(<em>E</em>)〉<sub><em>All</em></sub> <sub><em>ij</em></sub> <sub><em>cell</em>−<em>pairs</em></sub> (<a href=\"#figs10\">Fig. S10</a>). Where four values of 1, 2.5, 5, and 10 were attempted for <em>γ</em>, and equally spaced a hundred values were used for the wavenumber <em>k</em> in the range of [0, <em>π</em>/<em>a</em>]. According to the above energy function, the minimum/maximum range of the <em>E</em> value differed as [−2<em>γ</em>, 2<em>γ</em>], and as <em>γ</em> was larger, the points of the 〈<em>T</em>(<em>E</em>)〉 graph were placed sparsely on the X-axis of the <em>E</em> value. In each of the 〈<em>T</em>(<em>E</em>)〉 graphs for these four conditions of <em>γ</em>, similarly high 〈<em>T</em>(<em>E</em>)〉 values occurred in the vicinity of <em>E</em> = 0, ±1.4. Based on this preliminarily estimation, we confirmed that the occurrence of high 〈<em>T</em>(<em>E</em>)〉 values appeared as a function of the <em>E</em> value regardless of <em>γ</em>. Therefore, we considered <em>γ</em> as just determining the minimum/maximum range of the <em>E</em> value.</p><p>The appropriate <em>γ</em> we wanted in this study was large enough to provide a wide <em>E</em> value range to check the signal mobility edge in the 〈<em>T</em>(<em>E</em>)〉 graph, and the appropriate <em>γ</em> had to be small so that the points in the 〈<em>T</em>(<em>E</em>)〉 graph did not become too sparse. It was the condition of <em>γ</em> = 5 that satisfied this demand out of the four conditions of <em>γ</em>. Because the condition of <em>γ</em> = 2.5 was not sufficient to confirm the signal mobility edge, and the condition of <em>γ</em> = 10 had too sparse points along the X-axis.</p><h2 id=\"s4d\" class=\"heading-2\">Error report on our calculation for the transmission coefficient</h2><p>In principle, the sum of transmission coefficient <em>T</em><sub><em>ij</em></sub>(<em>E</em>) and reflection coefficient <em>R</em><sub><em>ij</em></sub>(<em>E</em>) of any cell-pair at any <em>E</em> value always had to satisfy 1 because our circuit model did not consider spontaneous attenuation of the wave signal. However, in the calculating program we wrote and used for this study, the error occurred with the sum of the two coefficients exceeding 1 (by the tolerance was 10<sup>-5</sup>) for a total of 5,213 cell-pairs in three specific <em>E</em> values (45 cell-pairs at <em>E</em> = −1.000, 3,836 cell-pairs at <em>E</em> = −0.375, and 1,332 cell-pairs at <em>E</em> = 1.000). We performed the calculations on a total of 109,746 cell-pairs for a total of 801 <em>E</em> values, so these errors correspond to 0.006% of the total calculation results. To eliminate the effect of these errors in this study, we post-corrected the two coefficients of the 5,213 cell-pairs in the three specific <em>E</em> values in which the error occurred to <em>T</em><sub><em>ij</em></sub>(<em>E</em>) = 0, <em>R</em><sub><em>ij</em></sub>(<em>E</em>) = 1.</p><h2 id=\"s4e\" class=\"heading-2\">Calculation for effective conductance</h2><p>An electrical resistor network model was constructed that mimics <em>C. elegans’</em> electrical synapse network, with the 469 cells replaced with electrical conducting nodes and the 1,433 electrical synapses replaced with electrical resistors connecting these nodes. The effective resistance and its reciprocal, the effective conductance, when a direct current power source outside the electrical resistor network model contacted a cell by its positive pole, and another cell by its negative pole, respectively, were calculated.(<a href=\"#c18\">Klein and Randic, 1993</a>) The effective conductance shows how well electric current without interference flows between the two cells contacted to the external power source.</p><p>We expressed the electric voltage at node <em>i</em> as <em>v</em><sub><em>i</em></sub>, the electric current flowing from node <em>i</em> to node <em>j</em> as <em>μ</em><sub><em>ij</em></sub>, the resistance of the electrical resistor between node <em>i</em> and node <em>j</em> as <em>χ</em><sub><em>ij</em></sub>, the conductance of that as <picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_inline4.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" class=\"inline-image\" src=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_inline4.gif/full/max/0/default.jpg\" alt=\"\"/></picture>. The anatomical gap junction weights (<em>g</em><sub><em>ij</em></sub>) were used as the conductance value of the electrical resistors in the network, <em>ω</em><sub><em>ij</em></sub> = <em>g</em><sub><em>ij</em></sub>, with arbitrary units.</p><p>By Ohm’s law, each electrical resistor in the network satisfies the following equation,\n</p><p><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_ueqn7.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_ueqn7.gif/full/max/0/default.jpg\" alt=\"\"/></picture></p><p>The sum of the electric currents entering each node by Kirchhoff’s current law satisfied the equation below,\n</p><p><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_ueqn8.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_ueqn8.gif/full/max/0/default.jpg\" alt=\"\"/></picture></p><p>Where (+) and (−) meant a node in which the positive and negative poles of the external power source were in contact, respectively, and the capital letter <em>I</em> was the total electric current supplied by the external power source. When Ohm’s law above was substituted on the left-hand of this equation, it was expressed as <em>v</em><sub><em>i</em></sub> ∑<sub><em>j</em>≠<em>i</em></sub> <em>ω</em><sub><em>ij</em></sub> − ∑<sub><em>j</em>≠<em>i</em></sub> <em>ω</em><sub><em>ij</em></sub><em>v</em><sub><em>j</em></sub>, and then the equation was able to express in matrix and vector as follows,\n</p><p><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_ueqn9.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_ueqn9.gif/full/max/0/default.jpg\" alt=\"\"/></picture></p><p>Where <strong><em>L</em></strong><sup><em>ω</em></sup> was the Laplacian matrix of the electrical resistors’ conductance matrix (<strong><em>ω</em></strong>), defined as <picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_inline5.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" class=\"inline-image\" src=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_inline5.gif/full/max/0/default.jpg\" alt=\"\"/></picture> was a column-vector with an electric voltage at all nodes as a component, and <picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_inline6.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" class=\"inline-image\" src=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_inline6.gif/full/max/0/default.jpg\" alt=\"\"/></picture> was a unit column-vector of the identical dimension as <picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_inline7.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" class=\"inline-image\" src=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_inline7.gif/full/max/0/default.jpg\" alt=\"\"/></picture>, with only the component of the (+) node ((−) node) having a value of 1 and all other components having a value of 0. By applying the pseudo-inverse matrix of the Laplacian matrix (<strong><em>L</em></strong><sup><em>ω</em>+</sup>) on both sides of the equation, we obtained a particular solution as <picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_inline8.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" class=\"inline-image\" src=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_inline8.gif/full/max/0/default.jpg\" alt=\"\"/></picture>.</p><p>The effective resistance applied between the positive and negative poles of the external power source was defined by Ohm’s law of the electric voltage difference between the (+) and (−) nodes and the total electric current, as follows,\n</p><p><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_ueqn10.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_ueqn10.gif/full/max/0/default.jpg\" alt=\"\"/></picture></p><p>Substituting here the particular solution of <picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_inline9.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" class=\"inline-image\" src=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_inline9.gif/full/max/0/default.jpg\" alt=\"\"/></picture>obtained above was as follows,\n</p><p><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_ueqn11.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_ueqn11.gif/full/max/0/default.jpg\" alt=\"\"/></picture></p><p>As a result, we were able to obtain the effective resistance for any one cell-pair by calculating the pseudo-inverse matrix of the Laplacian matrix (<strong><em>L</em></strong><sup><em>ω</em>+</sup>) from the electrical resistors’ conductance matrix (<strong><em>ω</em></strong>). The effective conductance was defined as the reciprocal of the effective resistance, <em>G</em><sup>eff</sup> = (<em>R</em><sup>eff</sup>)<sup>−1</sup>.</p></section><section id=\"data-and-materials-availability\"><h1 id=\"d1e1826\" class=\"heading-1\">Data and materials availability</h1><p>All data are available in the manuscript or the supplementary materials.</p></section><section id=\"additional-information\"><h1 id=\"s5\" class=\"heading-1\">Additional information</h1><h1 id=\"s5\" class=\"heading-1\">Acknowledgements</h1><p>We appreciate two Nobel Laureates, Prof. Erwin Neher and Prof. Kurt Wuthrich, for their insightful discussions on the impact of this work. We have benefited a lot from their suggestions in the course of this study.</p><h2 id=\"s5a\" class=\"heading-2\">Funding</h2><p>This work was supported in part by both pCoE program of DGIST [grant number: 23-CoE-BT-01] and a grant from iPT, Korea.</p><h2 id=\"s6\" class=\"heading-2\">Author contributions</h2><p>IC and SK conceived the idea for this work. TC, IC, and SK set up the model, conducted the calculation, and analyzed the data and results. IC and SK wrote the manuscript. All authors reviewed and agreed on the contents of the manuscript.</p><h2 id=\"s7\" class=\"heading-2\">Declaration of interests</h2><p>The authors declare no competing interests.</p></section><section id=\"supplementary-materials\"><h1 id=\"s9\" class=\"heading-1\">Supplementary Materials</h1><h2 id=\"s9a\" class=\"heading-2\">Auxiliary paragraph 1</h2><p>The 31 specific <em>E</em> values in this study were not fixed and were of a property that can change as a researcher adjusts the resolution of the <em>E</em> value. Perhaps the higher the resolution of the <em>E</em> value, the more specific <em>E</em> values will be found. And it was arbitrary that our reference value for strong transmission was 0.5, and this reference value can be raised or lowered depending on the researcher’s intention, and the lower the reference value, the greater the number of cell-pairs with strong transmission will be found.</p><h2 id=\"s9b\" class=\"heading-2\">Auxiliary paragraph 2</h2><p>Because of the omitted the rest of cells and their electrical synapses in the network diagram, some nodes in the diagram look like remote islands, but it should be remembered that the 173 cells were connected as one large cluster through both the drawn and the omitted electrical synapses.</p><h2 id=\"s9c\" class=\"heading-2\">Auxiliary paragraph 3</h2><p>Because the number of the cell-pairs of intra-body-wall muscles was overwhelmingly large and it was relatively easy to measure the distance compared to those of other cell-pairs, the investigation for the distance excluded them (for example, the distance of two body-wall muscles in the same strand easily calculate from the given number in the name of the muscles).</p><div class=\"figure-container\"><figure class=\"figure\" id=\"figs1\"><label class=\"figure__label\">Figure S1.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_figs1.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_figs1.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Selected 〈<em>T</em>(<em>E</em>)〉 peaks.</h4><p>The 31 selected peaks are shown as dots on the graph of the average transmission coefficient for all cell-pairs. To make the dots more visible, only the <em>E</em> value range of [−1, 5] was drawn out of the total [−10, 10]. The upper panel shows the dots and the graph on the Y-axis of the real scale and the lower panel shows the same things on the Y-axis of the log scale.</p></figcaption></figure></div><div class=\"figure-container\"><figure class=\"figure\" id=\"figs2\"><label class=\"figure__label\">Figure S2.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_figs2.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_figs2.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Wavenumber-dependent transmission map.</h4><p>The cell-pairs with strong transmission (<em>T</em><sub><em>ij</em></sub>(<em>E</em>) &gt; 0.5) at <strong>(A)</strong> <em>E</em> = 0.000, <strong>(B)</strong> <em>E</em> = 0.100, <strong>(C)</strong> <em>E</em> = 0.175, and <strong>(D)</strong> <em>E</em> = 0.225 (or the corresponding wavenumbers) are shown, respectively. The left panels represent the transmission coefficient between cells belonging to the cell-pairs with strong transmission at each <em>E</em> value as a heatmap. Here, the X and Y axes are the cell index, and the cell name corresponding to the cell index can be found in <a href=\"#tbls1\">Table S1</a>-<a href=\"#tbls3\">3</a>. The right panels display the cell-pairs of strong transmission at each <em>E</em> value as red bidirectional arrows of the same thickness on the network diagram. In the network diagram, the cell name is written inside the circle that stands for each node (for the body-wall muscles, the cell name is abbreviated as follows; ex) dBWML1 → dL1), and the color of the node stands for the cell type (Red: Pharynx cells, Orange: Sensory neurons, Yellow: Inter neurons, Green: Motor neurons, Light blue: Body-wall muscles, Purple: Other end organs, Magenta: Sex-specific cells). Edges indicated by black solid lines stand for the electrical synapses among the cells, and the thickness of the edges is proportional to our processed weight. In the network diagram, only 173 cells that belonged to the cell-pair with strong transmission at least once in positive <em>E</em> values are represented, and the remaining cells and the electrical synapses by them are omitted from display. The virtual nodes of our circuit are also omitted from the display.</p></figcaption></figure></div><div class=\"figure-container\"><figure class=\"figure\" id=\"figs3\"><label class=\"figure__label\">Figure S3.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_figs3.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_figs3.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Wavenumber-dependent transmission map.</h4><p>The cell-pairs with strong transmission (<em>T</em><sub><em>ij</em></sub>(<em>E</em>) &gt; 0.5) at <strong>(A)</strong> <em>E</em> = 0.275, <strong>(B)</strong> <em>E</em> = 0.325, <strong>(C)</strong> <em>E</em> = 0.475, and <strong>(D)</strong> <em>E</em> = 0.575 (or the corresponding wavenumbers) are shown, respectively. The heatmaps of the left panels and the network diagram of the right panels are represented in the same way as in <a href=\"#figs2\">Fig. S2</a>.</p></figcaption></figure></div><div class=\"figure-container\"><figure class=\"figure\" id=\"figs4\"><label class=\"figure__label\">Figure S4.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_figs4.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_figs4.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Wavenumber-dependent transmission map.</h4><p>The cell-pairs with strong transmission (<em>T</em><sub><em>ij</em></sub>(<em>E</em>) &gt; 0.5) at <strong>(A)</strong> <em>E</em> = 0.750, <strong>(B)</strong> <em>E</em> = 0.800, <strong>(C)</strong> <em>E</em> = 0.850, and <strong>(D)</strong> <em>E</em> = 0.925 (or the corresponding wavenumbers) are shown, respectively. The heatmaps of the left panels and the network diagram of the right panels are represented in the same way as in <a href=\"#figs2\">Fig. S2</a>.</p></figcaption></figure></div><div class=\"figure-container\"><figure class=\"figure\" id=\"figs5\"><label class=\"figure__label\">Figure S5.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_figs5.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_figs5.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Wavenumber-dependent transmission map.</h4><p>The cell-pairs with strong transmission (<em>T</em><sub><em>ij</em></sub>(<em>E</em>) &gt; 0.5) at <strong>(A)</strong> <em>E</em> = 1.350, <strong>(B)</strong> <em>E</em> = 1.450., <strong>(C)</strong> <em>E</em> = 1.500, and <strong>(D)</strong> <em>E</em> = 1.575 (or the corresponding wavenumbers) are shown, respectively. The heatmaps of the left panels and the network diagram of the right panels are represented in the same way as in <a href=\"#figs2\">Fig. S2</a>.</p></figcaption></figure></div><div class=\"figure-container\"><figure class=\"figure\" id=\"figs6\"><label class=\"figure__label\">Figure S6.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_figs6.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_figs6.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Wavenumber-dependent transmission map.</h4><p>The cell-pairs with strong transmission (<em>T</em><sub><em>ij</em></sub>(<em>E</em>) &gt; 0.5) at <strong>(A)</strong> <em>E</em> = 1.700, <strong>(B)</strong> <em>E</em> = 1.750, <strong>(C)</strong> <em>E</em> = 1.800, and <strong>(D)</strong> <em>E</em> = 1.875 (or the corresponding wavenumbers) are shown, respectively. The heatmaps of the left panels and the network diagram of the right panels are represented in the same way as in <a href=\"#figs2\">Fig. S2</a>.</p></figcaption></figure></div><div class=\"figure-container\"><figure class=\"figure\" id=\"figs7\"><label class=\"figure__label\">Figure S7.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_figs7.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_figs7.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Wavenumber-dependent transmission map.</h4><p>The cell-pairs with strong transmission (<em>T</em><sub><em>ij</em></sub>(<em>E</em>) &gt; 0.5) at <strong>(A)</strong> <em>E</em> = 2.000, <strong>(B)</strong> <em>E</em> = 2.225, <strong>(C)</strong> <em>E</em> = 2.450, and <strong>(D)</strong> <em>E</em> = 2.650 (or the corresponding wavenumbers) are shown, respectively. The heatmaps of the left panels and the network diagram of the right panels are represented in the same way as in <a href=\"#figs2\">Fig. S2</a>.</p></figcaption></figure></div><div class=\"figure-container\"><figure class=\"figure\" id=\"figs8\"><label class=\"figure__label\">Figure S8.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_figs8.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_figs8.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Wavenumber-dependent transmission map.</h4><p>The cell-pairs with strong transmission (<em>T</em><sub><em>ij</em></sub>(<em>E</em>) &gt; 0.5) at <strong>(A)</strong> <em>E</em> = 3.000, <strong>(B)</strong> <em>E</em> = 3.375, <strong>(C)</strong> <em>E</em> = 3.475, and <strong>(D)</strong> <em>E</em> = 3.525 (or the corresponding wavenumbers) are shown, respectively. The heatmaps of the left panels and the network diagram of the right panels are represented in the same way as in <a href=\"#figs2\">Fig. S2</a>.</p></figcaption></figure></div><div class=\"figure-container\"><figure class=\"figure\" id=\"figs9\"><label class=\"figure__label\">Figure S9.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_figs9.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_figs9.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Wavenumber-dependent transmission map.</h4><p>The cell-pairs with strong transmission (<em>T</em><sub><em>ij</em></sub>(<em>E</em>) &gt; 0.5) at <strong>(A)</strong> <em>E</em> = 3.625, <strong>(B)</strong> <em>E</em> = 3.750, and <strong>(C)</strong> <em>E</em> = 3.875 (or the corresponding wavenumbers) are shown, respectively. The heatmaps of the left panels and the network diagram of the right panels are represented in the same way as in <a href=\"#figs2\">Fig. S2</a>.</p></figcaption></figure></div><div class=\"figure-container\"><figure class=\"figure\" id=\"figs10\"><label class=\"figure__label\">Figure S10.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_figs10.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_figs10.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Searching for optimal gamma.</h4><p>The average transmission coefficient for all cell-pairs as a function of <em>E</em> value (<em>E</em> value is a function of both <em>γ</em> and wavenumber <em>k</em>) was calculated under the four <em>γ</em> conditions (1, 2.5, 5, 10), respectively. Here, the wavenumbers used the same set as a hundred values equally spaced in the range of [0, <em>π</em>/<em>a</em>]. The upper panel shows the average transmission coefficient graphs as the Y-axis of the real scale and the lower panel shows the same graphs as the Y-axis of the log scale. The reference value (10<sup>-7</sup>) of the signal mobility edge is shown in the lower panel as a dot-dash line.</p></figcaption></figure></div><div class=\"figure-container\"><figure class=\"figure\" id=\"tbls1\"><label class=\"figure__label\">Table S1.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_tbls1.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_tbls1.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Cell names corresponding to the indices in the heatmaps for wavenumber-dependent transmission map.</h4><p>Each two columns shows the index and the corresponding cell name of the cells that belonged to the cell-pairs with strong transmission at the <em>E</em> value (or the corresponding wavenumber) indicated in the first row. The color painted on the name box stands for the cell type (Red: Pharynx cells, Orange: Sensory neurons, Yellow: Inter neurons, Green: Motor neurons, Light blue: Body-wall muscles, Purple: Other end organs, Magenta: Sex-specific cells).</p></figcaption></figure></div><div class=\"figure-container\"><figure class=\"figure\" id=\"tbls2\"><label class=\"figure__label\">Table S2.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_tbls2.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_tbls2.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Cell names corresponding to the indices in the heatmaps for wavenumber-dependent transmission map.</h4><p>It is represented in the same way as <a href=\"#tbls1\">Table S1</a>.</p></figcaption></figure></div><div class=\"figure-container\"><figure class=\"figure\" id=\"tbls3\"><label class=\"figure__label\">Table S3.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_tbls3.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_tbls3.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Cell names corresponding to the indices in the heatmaps for wavenumber-dependent transmission map.</h4><p>It is represented in the same way as <a href=\"#tbls1\">Table S1</a>.</p></figcaption></figure></div><div class=\"figure-container\"><figure class=\"figure\" id=\"tbls4\"><label class=\"figure__label\">Table S4.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_tbls4.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99904%2Fv2%2Fcontent%2F598855v2_tbls4.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">List of cell-pairs with strong transmission except intra body-wall muscles pairs.</h4><p>The first column represents the shortest distance along the network connecting the two cells of the cell-pair. The second and third columns represent the cell names of the cell-pair, and the color painted on the name box stands for the cell type (Red: Pharynx cells, Orange: Sensory neurons, Yellow: Inter neurons, Green: Motor neurons, Light blue: Body-wall muscles, Purple: Other end organs, Magenta: Sex-specific cells). The fourth, fifth, and sixth columns represent the transmission coefficient, the <em>E</em> value, and the wavenumber when the cell-pair shows the strongest transmission in the positive <em>E</em> value range, respectively.</p></figcaption></figure></div></section>"
}
