{
  "id": "99988",
  "doi": "10.1101/2022.12.11.519598",
  "version": 2,
  "status": "reviewed",
  "authorLine": "Mathias Guayasamin, Lewis R Depaauw-Holt ... Ciaran Murphy-Royal",
  "title": "Early-life stress induces persistent astrocyte dysfunction associated with fear generalisation",
  "published": "2024-08-06T14:00:00Z",
  "reviewedDate": "2024-08-06T14:00:00Z",
  "versionDate": "2025-01-15T14:00:00Z",
  "statusDate": "2025-01-15T14:00:00Z",
  "stage": "published",
  "subjects": [
    {
      "id": "neuroscience",
      "name": "Neuroscience"
    }
  ],
  "elifeAssessment": {
    "title": "eLife Assessment",
    "content": [
      {
        "type": "paragraph",
        "text": "This important paper explores the impact of early life stress (ELS) on adult brain and behavior. The significance of the convincing findings are that they implicate regulation of non-neuronal cells in the development of brain and behavioral dysfunction associated with ELS. With an elegant combination of behavioral models, morphological and functional assessments using immunostaining, electrophysiology, and viral-mediated loss-of-function approaches, the authors report that astrocyte dysfunction plays a role in ELS responses. The work is of interest to a broad behavioral and cellular neuroscience audience."
      }
    ],
    "id": "sa4",
    "doi": "10.7554/eLife.99988.2.sa4",
    "significance": [
      "important"
    ],
    "strength": [
      "convincing"
    ]
  },
  "indexContent": "Mathias Guayasamin, Lewis R Depaauw-Holt, Ifeoluwa I Adedipe, Ossama Ghenissa, Juliette Vaugeois, Manon Duquenne, Benjamin Rogers, Jade Latraverse-Arquilla, Sarah Peyrard, Anthony Bosson, Ciaran Murphy-Royal <section id=\"introduction\"><h1 id=\"s1\" class=\"heading-1\">Introduction</h1><p>Both human and rodent studies have provided compelling evidence for the long-lasting effects of adverse early-life experiences, highlighting enhanced susceptibility to subsequent stressors later in life (<a href=\"#c1\">1</a>–<a href=\"#c5\">5</a>). Early-life stress (ELS) has widespread effects across the brain and can influence many neural circuits including those involved in threat detection, emotion, cognitive processing, and reward seeking behaviours (<a href=\"#c6\">6</a>–<a href=\"#c9\">9</a>). Research investigating the neurobiology of stress has predominantly focused upon the effects on neurons and resulting behaviour (<a href=\"#c10\">10</a>–<a href=\"#c19\">19</a>). We have gleaned tremendous insight into disorders of stress from these studies, yet the links between stress, brain circuits and behaviour remain tenuous. Within this framework, the contribution of distinct brain cells, including astrocytes, remains largely untested. Glial cells, which comprise approximately half the cell population in the brain have been shown to directly regulate synaptic transmission and plasticity (<a href=\"#c20\">20</a>–<a href=\"#c29\">29</a>), thereby influencing many discrete behaviours (<a href=\"#c30\">30</a>–<a href=\"#c40\">40</a>). Despite research suggesting important roles for astrocytes in regulating affective states (<a href=\"#c31\">31</a>,<a href=\"#c33\">33</a>), fear (<a href=\"#c33\">33</a>), reward and addiction behaviours (<a href=\"#c36\">36</a>,<a href=\"#c41\">41</a>,<a href=\"#c42\">42</a>), whether astrocyte dysfunction prompts stress-induced behavioural impairments remains poorly understood.</p><p>First, we characterised whether ELS influenced stress hormone levels across our experimental paradigm from pre-stress until young adulthood. We report that that ELS induces a transient increase in blood glucocorticoids that peaks during late adolescence/young adulthood. Turning to behaviour, this increase in glucocorticoid levels was associated with anxiety-like behaviour in the elevated plus maze.</p><p>Next, we set out to determine whether ELS influenced cognitive function using an amygdala-dependent threat discrimination assay. This task was specifically chosen to test the effects of ELS on amygdala function as this brain region is involved with threat detection and associative learning that is acutely sensitive to stress (<a href=\"#c17\">17</a>,<a href=\"#c18\">18</a>,<a href=\"#c43\">43</a>–<a href=\"#c45\">45</a>). We employed an auditory discriminative fear conditioning paradigm that requires synaptic plasticity changes in the lateral amygdala (<a href=\"#c46\">46</a>) and found that ELS impairs discriminative fear memory resulting in fear generalisation. These hormonal and behavioural changes were associated with impaired synaptic plasticity and enhanced excitability of cells in the lateral amygdala, evidenced by increased c-Fos labelling.</p><p>Finally, we investigated the impact of ELS on astrocytes in the lateral amygdala revealing changes in specific proteins associated with morphological reorganisation and astrocyte network function. ELS resulted in decreased frequency and amplitude in astrocyte calcium activity. To directly implicate astrocytes with behavioural dysfunction we used two distinct viral approaches to mimic stress-induced astrocyte dysfunction specifically in the lateral amygdala. Impairment of astrocyte network function, or decreasing calcium activity, recapitulated ELS-induced fear generalisation, synaptic, and excitability phenotypes supporting the hypothesis that astrocytes play an influential role in the effects of stress on neural circuits and behaviour. Together, these findings identify astrocytes as central elements regulating amygdala-dependent affective memory and highlight astrocytes as putative targets for the treatment of stress disorders.</p><h1 id=\"s2\" class=\"heading-1\">Results</h1><h2 id=\"s2a\" class=\"heading-2\">Early-life stress increases blood corticosterone and induces anxiety-like behaviours</h2><p>We employed an ELS paradigm which combines limited bedding and nesting materials as well as maternal separation from postnatal days 10 to 17 (<a href=\"#fig1\">Figure 1A</a>) and has been shown to induce life-long stress susceptibility (<a href=\"#c6\">6</a>). We first set out to determine the impact of this ELS paradigm on stress hormone levels across our experimental window. Taking trunk blood from mice across several litters at different time points in the ELS paradigm: pre-stress (P10), end of ELS paradigm (P17), at the start (P45) and end of our experimental window (P70), we report that this ELS paradigm induces a latent increase in blood corticosterone with a significant increase occurring only in late adolescence P45, long after the termination of the stress paradigm (<a href=\"#fig1\">Figure 1B</a>).</p><div class=\"figure-container\"><figure class=\"figure\" id=\"fig1\"><label class=\"figure__label\">Figure 1.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_fig1.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_fig1.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Effects of ELS on anxiety-like behaviour.</h4><p><strong>(A)</strong> Timeline of ELS and behavioural assays. <strong>(B)</strong> Serum corticosterone levels are increased during adolescence, following ELS. P=0.01, Naïve N=9, ELS N=11 mice. <strong>(C)</strong> Representative movement tracks of naive (grey) and ELS (green) mice in open field task. <strong>(D)</strong> No significant difference in time spent in the periphery of open field maze following ELS. P=0.4591, Naïve N=9, ELS N=14 mice. <strong>(E)</strong> No significant difference in time spent in the center of open field maze following ELS. P=0.4591, Naïve N=9, ELS N=14 mice. <strong>(F)</strong> Total distance travelled during open field test was increased in ELS mice. P=0.04, Naïve N=9, ELS N=14 mice. <strong>(G)</strong> Representative locomotor tracks in elevated plus maze in naïve and ELS mice, black segment represents closed arms with grey arms representing open arms. <strong>(H)</strong> ELS mice had increased time spent in closed arms P=0.0276, Naïve N=18, ELS N=11 mice. <strong>(I)</strong> ELS mice had decreased time spent in open arms P= 0.0276, Naïve N=18, ELS N=11 mice. <strong>(H)</strong> Total distance travelled during elevated plus maze test was increased by ELS. P=0.02, Naïve N=9, ELS N=11 mice. See Table S1 for detailed statistical summaries.</p></figcaption></figure></div><p>Next, we investigated whether this ELS paradigm results in long-term behavioural change, beginning with anxiety-like behaviours. We found that while there were no changes in behaviour in the open-field task (<a href=\"#fig1\">Figure 1 D, E</a>), we did see an increase in locomotor activity, i.e. distance travelled, following ELS (<a href=\"#fig1\">Figure 1F</a>). Using the elevated plus maze we report increased anxiety-like behaviour with an increase in time spent in the closed arms and a reduction in time spent in the open arms of the maze (<a href=\"#fig1\">Figure 1 H, I</a>). This was also accompanied by an increase in distance travelled within the maze (<a href=\"#fig1\">Figure 1J</a>), similar to our findings in the open field. Increased locomotion in response to stress is consistent with previous reports (<a href=\"#c15\">15</a>,<a href=\"#c47\">47</a>).</p><h2 id=\"s3\" class=\"heading-2\">Amygdala-dependent memory, plasticity, and excitability are disrupted by early-life stress</h2><p>Considering the strong association between stress disorders, anxiety, and amygdala dysfunction, we next set out to determine whether amygdala-dependent behaviour was impacted by ELS. We specifically targeted lateral amygdala-dependent learning and memory using an auditory discriminative fear conditioning paradigm. In brief, during this behavioural task mice were first exposed to a neutral auditory cue (conditioned stimulus -; CS−) followed by a distinct auditory cue (CS+) paired with footshock (unconditioned stimulus; US). Twenty-four hours later mice were placed in a novel environment to remove contextual triggers and exposed to auditory cues from previous day without footshock (<a href=\"#fig2\">Figure 2B</a>). Memory precision was measured using percent time freezing during presentation of neutral (CS−) and conditioned (CS+) auditory cues. We report that mice accurately learn this task and can readily distinguish between neutral and conditioned cues (<a href=\"#tbls1\">Table S1</a>).</p><div class=\"figure-container\"><figure class=\"figure\" id=\"fig2\"><label class=\"figure__label\">Figure 2.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_fig2.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_fig2.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">ELS alters fear memory, synaptic plasticity, and neural excitability.</h4><p><strong>(A)</strong> Experimental timeline. <strong>(B)</strong> Timeline of auditory discriminative fear conditioning paradigm. <strong>(C)</strong> ELS did not affect % Freezing to neutral and aversive auditory cues during learning. Naïve N=20, ELS N=17. <strong>(D)</strong> % time freezing during presentation of neutral auditory cue (CS−; p=0.0002) and aversive cue (CS+; p=0.99). Naïve N=20, ELS N=17. <strong>(E)</strong> Discrimination Index was impaired by ELS. P=0.004. Naïve N=20, ELS N=17. <strong>(F)</strong> Schematic representation of electrode placement in slice electrophysiology experiment (top) with DIC image below. <strong>(G)</strong> Representative EPSP traces from naïve (top) and ELS (bottom) brain slices during baseline (black trace) and after LTP stimulation (grey trace). Scale bars = 0.5mV and 10ms. <strong>(H)</strong> LTP was impaired by ELS. P=0.002. Naïve N=15, ELS N=13. <strong>(I)</strong> Diagram of procedure for c-Fos staining experiments. <strong>(J)</strong> Brain slices containing lateral amygdala (LA) were selected for c-Fos staining. <strong>(L)</strong> Region of interest extracted from full amygdala image. Scale bars = 10μm. <strong>(K)</strong> c-Fos positive cell density was increased by ELS. P&lt;0.0001. Naïve n=39 slices N=10 mice, ELS n=37 slices N=10mice. See Table S1 for detailed statistical summaries.</p></figcaption></figure></div><p>Using this paradigm, we observed no effect of stress on freezing responses to the CS−presentations during conditioning (<a href=\"#fig2\">Figure 2C, grey area</a>), ruling out ELS-induced hypersensitivity or hypervigilance to novel auditory cues. We also found that fear acquisition, evidenced by freezing to the CS+/US pairing, was unaffected by ELS (<a href=\"#fig2\">Figure 2C</a>). In contrast, memory recall was affected with ELS mice exhibiting enhanced fear responses to neutral cues (CS−; <a href=\"#fig2\">Figure 2D, grey area</a>), with no difference in freezing to conditioned cues (CS+; <a href=\"#fig2\">Figure 2D</a>) compared to naïve mice. Additional analysis comparing average freezing responses to all tone presentations of CS− and CS+ supported these observations with no differences between naïve and ELS during conditioning (<a href=\"#fig2s2\">Figure 2 – figure supplement 2A</a>); while during memory recall ELS mice showed enhanced freezing to CS−presentations compared to naïve counterparts with no difference in freezing to CS+ (<a href=\"#fig2s2\">Figure 2 – figure supplement 2B</a>).</p><p>ELS-induced enhancement of fear responses to neutral cues is indicative of fear generalisation, a common stress-related behavioural phenotype conserved between rodents and humans (<a href=\"#c48\">48</a>,<a href=\"#c49\">49</a>). This behavioural observation is more clearly depicted using a discrimination index (DI) that takes into account freezing responses to neutral and conditioned cues. Using this measure, DI&gt;0 reflects accurate discrimination, DI=0 no discrimination and DI&lt;0 reflects a discrimination error, <em>i.e.</em> higher freezing to the neutral than conditioned cue. Using this index, we confirm a decrease in fear discrimination in ELS mice compared to naïve mice (<a href=\"#fig2\">Figure 2E</a>). Together these data reveal long-term behavioral changes with ELS enhancing affective responses resulting in fear generalisation in adult mice.</p><p>Investigation of potential sex effects revealed no differences between naïve male and female mice in this paradigm with both sexes showing equal performance in learning (<a href=\"#fig2s1\">Figure 2 – figure supplement 1A</a>), memory (<a href=\"#fig2s1\">Figure 2 – figure supplement 1B</a>), and auditory discrimination (<a href=\"#fig2s1\">Figure 2 – figure supplement 1C</a>). In ELS mice, we report a sex-dependent effect on fear acquisition with female mice exhibiting increased freezing responses to CS+/US pairing compared to males (<a href=\"#fig2s1\">Figure 2 – figure supplement 1D</a>). Despite this, both sexes show equal performance during memory recall and auditory discrimination (<a href=\"#fig2s1\">Figure 2 – figure supplement 1E, F</a>).</p><p>Auditory fear conditioning paradigms have been correlated with the potentiation of post-synaptic responses to cortical auditory afferents, in the lateral amygdala (<a href=\"#c46\">46</a>). As such, we set out to determine whether ELS impacts synaptic plasticity in cortico-amygdala circuits using acute brain slice electrophysiology and recorded field excitatory postsynaptic potentials (fEPSPs) by stimulating cortical inputs from the external capsule (<a href=\"#fig2\">Figure 2F</a>). We report that ELS impaired long-term potentiation (LTP) of synaptic transmission in this cortico-amygdala circuit (<a href=\"#fig2\">Figures 2G, H</a> and <a href=\"#fig2s2\">Figure 2 – figure supplement 2C</a>). This synaptic observation is consistent with findings using distinct stress paradigms (<a href=\"#c20\">20</a>), and highlights the important influence of stress on synaptic function across various brain regions.</p><p>Fear learning and memory in the lateral amygdala has also been correlated with the allocation of a small number of neurons to a fear engram (<a href=\"#c50\">50</a>). These engrams are thought to be a possible neural substrate for memory and their formation depends on neural excitability levels at the moment of acquisition (<a href=\"#c51\">51</a>,<a href=\"#c52\">52</a>). As both glucocorticoid injections or acute stress have been shown to increase engram size and enhance fear generalisation (<a href=\"#c53\">53</a>,<a href=\"#c54\">54</a>), we set out to determine whether ELS results in memory changes due to alterations in putative engram recruitment. We collected brain tissue 90 minutes after conditioning (<a href=\"#fig2\">Figure 2I</a>) and carried out immunostaining for the immediate early gene c-Fos, a commonly used activity marker, in the lateral amygdala (<a href=\"#fig2\">Figures 2J, K, L</a> and <a href=\"#fig2s2\">Figure 2 – figure supplement 2D, E</a>). Fear acquisition in ELS mice resulted in a significant increase in c-Fos density, suggestive of increased excitability levels. These results are consistent with reports of c-Fos density inversely correlating with memory accuracy (<a href=\"#c52\">52</a>). Further investigation of potential sex differences revealed that while there were no differences in c-Fos densities between naïve female and male animals (<a href=\"#fig2s2\">Figure 2 – figure supplement 2F</a>), we observed a significantly higher c-Fos density in ELS male mice compared to females following fear acquisition (<a href=\"#fig2s2\">Figure 2 – figure supplement 2G</a>).</p><p>Recently, astrocytes have been reported to be recruited to fear engrams during a hippocampus-dependent learning and memory task (<a href=\"#c55\">55</a>). As such, we quantified the percentage of astrocytes expressing the activity marker c-Fos following fear conditioning in mice and report similar values to those found in the hippocampus (<a href=\"#fig2s3\">Figure 2 – figure supplement 3A, B</a>) suggestive of modest recruitment of astrocytes in amygdala-dependent memory engrams.</p><h2 id=\"s4\" class=\"heading-2\">Early-life stress induces persistent changes in astrocytes</h2><p>To determine the influence of ELS on astrocytes in the lateral amygdala we carried out immunostaining on brain slices taken from a separate cohort of naïve and ELS mice. We first investigated whether increased blood corticosterone affects glucocorticoid receptor (GR) expression and localisation in astrocytes. Using immunostaining, we confirmed that this hormone receptor is abundantly expressed in lateral amygdala astrocytes (<a href=\"#fig3\">Figure 3B</a>). We further investigated the subcellular localisation of GR within astrocytes. When inactivated GRs are restricted to the cytosol, upon binding to agonists such as corticosterone however, GRs can translocate to the nucleus to influence gene expression (<a href=\"#c56\">56</a>). Calculating a ratio of cytosolic vs nuclear GR in astrocytes as a proxy for activity, we found an increase in the nuclear fraction of GR in astrocytes following ELS (<a href=\"#fig3\">Figure 3C</a>), suggestive of increased activation of glucocorticoid signaling in lateral amygdala astrocytes following ELS.</p><div class=\"figure-container\"><figure class=\"figure\" id=\"fig3\"><label class=\"figure__label\">Figure 3.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_fig3.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_fig3.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Long-term astrocyte dysfunction after early-life stress.</h4><p><strong>(A)</strong> Experimental timeline. <strong>(B)</strong> Representative immunostaining of GFAP, S100β, GR, DAPI, and GR/DAPI merge in Naïve and ELS conditions. Scale bars = 20μm <strong>(C)</strong> Nuclear/cystolic GR ratio in astrocytes was increased after ELS. P=0.026. Naïve N=8, ELS N=8. <strong>(D)</strong> Representative slide scan image of immunostaining for astrocyte proteins GFAP and Cx43. <strong>(E)</strong> Representative immunostaining of GFAP, Cx43, GLT-1, and DAPI in naïve and ELS conditions. Scale bars = 50μm <strong>(F)</strong> GFAP staining was reduced in ELS mice. P=0.02, Naïve N=11, ELS N=12. <strong>(G)</strong> Cx43 staining was decreased in ELS mice. P=0.008. Naïve N=11, ELS=14. <strong>(H)</strong> GLT-1 expression was unchanged by ELS. P=0.8. Naïve N=6, ELS N=16. See Table S1 for detailed statistical summaries.</p></figcaption></figure></div><p>To assess putative changes in astrocyte structure we investigated expression of the intermediate filament protein glial fibrillary acidic protein (GFAP; <a href=\"#fig3\">Figure 3D, E</a>) and found a significant decrease in normalised GFAP fluorescence intensity in the lateral amygdala following ELS (<a href=\"#fig3\">Figure 3F</a>). While functional consequences of GFAP changes are difficult to define, we interpret these modifications in GFAP expression to be indicative of an astrocytic response to stress. We next targeted astrocyte-specific proteins with known roles in influencing synaptic function including Cx43, a gap junction protein that composes astrocyte networks (<a href=\"#c57\">57</a>) and the glutamate transporter GLT-1, responsible for the efficient clearance of glutamate from the synaptic cleft (41; <a href=\"#fig3\">Figure 3D, E</a>).</p><p>We observed a decrease in fluorescence intensity for the gap junction protein Cx43 (<a href=\"#fig3\">Figure 3G</a>) while expression of the glutamate transporter GLT-1 remained unaffected by ELS (<a href=\"#fig3\">Figure 3H</a>). We did not observe any significant sex differences in the expression of GFAP or Cx43 in control or ELS conditions, with similar expression levels in naïve and the same effect of stress on these proteins in both male and female mice (<a href=\"#fig3s1\">Figure 3 – figure supplement 1A, B</a>). These data suggest that astrocytes mount a specific response to ELS which could result in discrete changes in astrocyte network function such as the uncoupling of the astrocytic Cx43 gap junction networks in the lateral amygdala.</p><h2 id=\"s5\" class=\"heading-2\">Early-life stress impairs astrocyte calcium activity</h2><p>While the ELS-induced changes in astrocyte protein expression are indicative of functional modifications, this cannot be assumed and needs to be tested. We chose to assess potential stress-induced changes in astrocyte calcium activity employing the membrane-tethered calcium sensor lck-GCaMP6f. Lateral amygdala astrocytes were specifically targeted using local injection of viral constructs with GCaMP6f expression driven by the GfaABC1D promoter. Two-photon laser scanning microscopy was used in acute brain slices a minimum of two weeks following virus injection (<a href=\"#fig4\">Figure 4A</a>) allowing for quantification of dynamic elevations in intracellular calcium in astrocytic processes in naïve (<a href=\"#fig4\">Figure 4B, C</a>) and ELS mice (<a href=\"#fig4\">Figure 4D, E</a>). Data was analysed using the AQUA2 pipeline allowing for accurate and unbiased analysis of spatial and temporal dynamics of astrocyte calcium activity (<a href=\"#c59\">59</a>).</p><div class=\"figure-container\"><figure class=\"figure\" id=\"fig4\"><label class=\"figure__label\">Figure 4.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_fig4.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_fig4.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">ELS induces a hypofunction in lateral amygdala astrocyte calcium signaling.</h4><p><strong>(A)</strong> Experimental timeline including age of viral injection and experimental window for two-photon calcium imaging. <strong>(B)</strong> Representative image of a lck-GCaMP6f-expressing astrocyte in the lateral amygdala with 4 regions of interest from a naïve animal. Scale bar=10μm <strong>(C)</strong> Representative calcium-signaling traces from 4 regions of interest shown in <strong>B. (D)</strong> Representative image of a lck-GCaMP6f-expressing astrocyte in the lateral amygdala with 4 regions of interest from an ELS animal. Scale bar=10μm <strong>(E)</strong> Representative calcium-signaling traces from 4 regions of interest shown in <strong>D. (F)</strong> Frequency of calcium events was decreased lateral amygdala astrocytes after ELS, P&lt;0.0001, Naïve n=25 astrocytes from N=8 animals, ELS n=25 astrocytes from N=7 animals. <strong>(G)</strong> Frequency distribution of calcium event frequency from naïve (grey line) and ELS (green line) animals. <strong>(H)</strong> Amplitude of calcium events was decreased after ELS, P= 0.0165, Naïve n=22 astrocytes from N=8 animals, ELS n=17 astrocytes from N=7 animals. <strong>(I)</strong> Frequency distribution of calcium event amplitude from naïve (grey line) and ELS (green line) animals. <strong>(J)</strong> Area of calcium events was decreased after ELS, P &lt;0.0001, Naïve n=25 astrocytes from N=8 animals, ELS n=25 astrocytes from N=7 animals. <strong>(K)</strong> Frequency distribution of event area from naïve (grey line) and ELS (green line) animals. <strong>(L)</strong> Rise time of calcium events was increased following ELS, P= 0.0311, Naïve n=25 astrocytes from N=8 animals, ELS n=25 astrocytes from N=7 animals. <strong>(M)</strong> Frequency distribution of calcium event rise from naïve (grey line) and ELS (green line) animals. <strong>(N)</strong> Calcium event duration was unchanged by ELS, P=0.4740, Naïve n=25 astrocytes from N=8 animals, ELS n=25 astrocytes from N=7 animals. <strong>(O)</strong> Frequency distribution of calcium event duration from naïve (grey line) and ELS (green line) animals. <strong>(P)</strong> Decay time of calcium events was unaltered by ELS, P=0.2164, Naïve n=25 astrocytes from N=8 animals, ELS n=25 astrocytes from N=7 animals. <strong>(Q)</strong> Frequency distribution of calcium event decay time duration from naïve (grey line) and ELS (green line) animals.</p></figcaption></figure></div><p>We report that ELS results in astrocyte calcium hypofunction, evidenced by decreased calcium event frequency (<a href=\"#fig4\">Figure 4F, G</a>), amplitude (<a href=\"#fig4\">Figure 4H, I</a>) and size of individual events (<a href=\"#fig4\">Figure 4J, K</a>). Additionally, we observed a modest increase in rise time of calcium transients (<a href=\"#fig4\">Figure 4L, M</a>) with no significant change in event duration (<a href=\"#fig4\">Figure 4 N, O</a>) or decay time (<a href=\"#fig4\">Figure 4P, Q</a>). Together, these results are suggestive of astrocyte hypofunction following ELS.</p><p>Unexpectedly, our experiments revealed sexual dimorphism in astrocytic calcium dynamics in the lateral amygdala between naïve female and male mice. Specifically, we found that naïve female mice exhibited larger event amplitudes (<a href=\"#fig4s1\">Figure 4 – figure supplement 1A, B</a>), event area (<a href=\"#fig4s1\">Figure 4 – figure supplement 1D, E</a>) and rise time (<a href=\"#fig4s1\">Figure 4 – figure supplement 1G, H</a>) compared to naïve male mice. Interestingly, all sex differences were suppressed by stress with ELS-induced decrease in astrocyte activity normalising all parameters between sexes (<a href=\"#fig4s1\">Figure 4 – figure supplement 1A, C, D, E, G, I</a>). No sex differences were observed for event frequency (<a href=\"#fig4s1\">Figure 4 – figure supplement 1J-L</a>), duration (<a href=\"#fig4s1\">Figure 4 – figure supplement 1M-O</a>) or decay time (<a href=\"#fig4s1\">Figure 4 – figure supplement 1P-R</a>) in any conditions.</p><h2 id=\"s6\" class=\"heading-2\">Astrocyte dysfunction alone phenocopies the effects of ELS on fear generalisation, synaptic plasticity, and excitability</h2><p>To implicate astrocytes in the cellular and behavioural effects of ELS we carried out a series of genetic loss-of-function experiments, specifically targeting astrocytes in the lateral amygdala using viral approaches (<a href=\"#fig5\">Figure 5A, B, C</a> and <a href=\"#fig5s1\">Figure 5 - figure supplement 1A</a>). Based on the putative astrocyte network dysfunction we identified in fixed tissue (<a href=\"#fig3\">Figure 3G</a>), we targeted astrocyte network function by overexpressing a dominant negative Cx43 (dnCx43). We have previously shown this manipulation to completely occlude functional coupling between neighbouring astrocytes by introducing a point mutation that blocks the pore of gap junction channels (dnCx43) (<a href=\"#c20\">20</a>). Second, to mimic the impact of ELS on astrocyte calcium activity (<a href=\"#fig4\">Figure 4</a>), we used a calcium extruder pump (hPMCA2/b, a.k.a. CalEx) (<a href=\"#c60\">60</a>,<a href=\"#c61\">61</a>) that we validated to show that expression of this pump in lateral amygdala astrocytes (<a href=\"#fig5s2\">Figure 5 - figure supplement 2A-E</a>) effectively reduces frequency (<a href=\"#fig5s2\">Figure 5 - figure supplement 2F</a>) and amplitude (<a href=\"#fig5s2\">Figure 5 - figure supplement 2G</a>) of astrocyte calcium events without affecting event size, duration, rise time, or decay (<a href=\"#fig5s2\">Figure 5 - figure supplement 2H-K</a>). This manipulation closely mimics the effects of ELS on astrocyte calcium activity, allowing us to parse the precise contribution of astrocyte activity in behaviour.</p><div class=\"figure-container\"><figure class=\"figure\" id=\"fig5\"><label class=\"figure__label\">Figure 5.</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_fig5.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_fig5.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><h4 class=\"heading-4\">Astrocyte dysfunction mimics the effects of ELS on behaviour, synapses, and neural excitability.</h4><p><strong>(A)</strong> Representative image showing localisation of viral vector in lateral amygdala. <strong>(B)</strong> Viral constructs used to manipulate astrocyte function. <strong>(C)</strong> Astrocyte dysfunction did not affect % Freezing to neutral and aversive auditory cues during learning. eGFP N=12, CalEx N=11, dnCx43 N=17 mice. <strong>(D)</strong> % time freezing during presentation of neutral auditory cue (CS−) was increased with astrocyte dysfunction (eGFP vs CalEx: P&lt;0.0001; eGFP vs dnCx43: P=0.029; CalEx vs dnCx43: P=0.0005) with no impact on % Freezing to aversive cue (CS+). eGFP N=12, CalEx N=11, dnCx43 N=17 mice. <strong>(E)</strong> Discrimination Indexes were impaired by astrocyte dysfunction. eGFP vs CalEx: P&lt;0.0001; eGFP vs dnCx43: P=0.013; CalEx vs dnCx43: P=0.03. eGFP N=12, CalEx N=11, dnCx43 N=17 mice. <strong>(F)</strong> Astrocyte dysfunction occluded the induction of LTP. eGFP vs CalEx: P=0.04; eGFP vs dnCx43: P=0.02; CalEx vs dnCx43: P=0.88. eGFP N=5, CalEx N=9, dnCx43 N=16. <strong>(G)</strong> Representative c-Fos staining in the lateral amygdala in control (eGFP), CalEx, and dnCx43 conditions. Scale bars = 10μm. <strong>(H)</strong> c-Fos positive cell density was increased with astrocyte dysfunction. eGFP vs CalEx: P&lt;0.0001; eGFP vs dnCx43: P=0.0005; CalEx vs dnCx43: P=0.88. eGFP n=17 slices N=5 mice, CalEx n=17 slices N=5 mice, dnCx43 n=12 slices N=5 mice.See Table S1 for detailed statistical summaries.</p></figcaption></figure></div><p>Initially, we screened for changes in anxiety-like behaviours using the elevated plus maze and report no impact of lateral amygdala-specific astrocyte manipulation on the time spent in the open versus closed arms or in total distance traveled (<a href=\"#fig5s3\">Figure 5 - figure supplement 3A-C</a>) nor in time spent in the periphery versus the middle of the open field maze or in total distance traveled (<a href=\"#fig5s3\">Figure 5 - figure supplement 3D-F</a>). Next, using auditory discriminative fear conditioning paradigm, we found that learning was unaffected by astrocyte dysfunction (<a href=\"#fig5\">Figure 5D</a>, <a href=\"#fig5s4\">Figure 5 – figure supplement 4A</a>, and <a href=\"#tbls1\">Table S1</a>). We also report that similar to ELS, lateral amygdala astrocytic dysfunction does not lead to hypervigilance to neutral auditory cues (<a href=\"#fig5\">Figure 5D</a>, grey area). During memory recall, however, we found that both astrocyte hypofunction manipulations enhanced fear responses to neutral cues, without affecting freezing to conditioned cues (<a href=\"#fig5\">Figure 5E</a> and <a href=\"#fig5s4\">Figure 5 – figure supplement 4B</a>). This behavioural phenotype induced by astrocyte dysfunction alone, with either dnCx43 or CalEx, mimicked the effects of ELS on auditory fear discrimination, i.e. enhanced fear generalisation. Accordingly, quantification of discrimination index revealed an impairment in discriminative fear memory in both dnCx43 and CalEx conditions, compared to viral control (<a href=\"#fig5\">Figure 5F</a>). This effect was dependent on the increase in freezing to the neutral cue with freezing responses to the aversive tone being unaltered by astrocytic dysfunction (<a href=\"#fig5s4\">Figure 5 – figure supplement 4B</a>). Taken together, these data directly implicate astrocytes in valence processing in the lateral amygdala and suggest a potential link between ELS and astrocyte dysfunction.</p><p>Investigation of potential sex differences in these genetic manipulations of astrocyte function revealed that the impact of CalEx on discrimination memory was more robust in female mice compared to males (<a href=\"#fig5s4\">Figure 5 – figure supplement 4C</a>). In the case of dnCx43, no differences were observed between females and males (<a href=\"#fig5s4\">Figure 5 – figure supplement 4D</a>).</p><p>Next, we set out to determine whether astrocyte dysfunction also mirrored the cellular and synaptic changes observed in ELS. Using acute brain slice electrophysiology, we report an occlusion of LTP in both CalEx and dnCx43 conditions (<a href=\"#fig5\">Figure 5G</a>). In line with fear memory and synaptic plasticity changes, we also report that astrocyte dysfunction directly influences neural excitability with increased c-Fos density following fear conditioning in both CalEx and dnCx43 compared to control virus (<a href=\"#fig5\">Figure 5H, L</a>). No sex differences were observed for c-Fos densities in eGFP- (<a href=\"#fig5s5\">Figure 5 – figure supplement 5A, D</a>) or CalEx-expressing mice (<a href=\"#fig5s5\">Figure 5 – figure supplement 5B, E</a>). dnCx43 expression however, resulted in higher c-Fos density in female mice compared to male counterparts (<a href=\"#fig5s5\">Figure 5 – figure supplement 5F</a>).</p><p>Globally, these data highlight astrocytes as critical regulators of lateral amygdala function and output with astrocyte integrity essential for regulating synaptic plasticity, neural excitability, and of brain region-dependent behaviour.</p><h1 id=\"s7\" class=\"heading-1\">Discussion</h1><p>In this study, we investigated the potential roles of astrocytes in cellular and behavioural dysfunctions associated with ELS. Using a rodent model of ELS that employs maternal separation and limited bedding, we report increased blood glucocorticoid levels associated with heightened anxiety-like behaviours. These endocrine and behavioural changes were accompanied by impaired discriminative fear memory in an amygdala-dependent auditory discrimination task. More precisely, we observed that ELS mice displayed increased fear responses to neutral cues with no change in freezing responses to conditioned stimuli. These behavioural changes were further associated with alterations on the cellular scale including synaptic plasticity and neuronal excitability. Investigating contributions of non-neuronal cells, we found robust changes in lateral amygdala astrocytes following ELS comprising increased glucocorticoid receptor translocation to the nucleus and decreased expression of key astrocyte network proteins. Functionally, we observed astrocyte hypoactivity with decreased frequency, amplitude, and size of calcium events following ELS.</p><p>To link astrocyte dysfunction with cellular, synaptic, and behavioural changes, we genetically targeted lateral amygdala astrocytes to mimic the effects we found in ELS. Astrocyte dysfunction alone, either decreasing gap junction coupling or reducing astrocyte calcium activity, phenocopied the effects of ELS across excitability, synaptic, and behavioural scales. Astrocytes have long been shown to be critical for memory formation, with the vast majority of studies reporting that astrocyte dysfunction impairs memory across various brain regions (<a href=\"#c32\">32</a>,<a href=\"#c34\">34</a>,<a href=\"#c62\">62</a>,<a href=\"#c63\">63</a>). Here, we show that astrocyte dysfunction in the lateral amygdala effectively impairs discriminative fear memory evidenced by fear generalisation, <em>i.e.</em> the inappropriate expression of fear towards stimuli of neutral valence. These data reveal that astrocytes are critical for the appropriate behavioural responses to emotionally salient cues and provide evidence supporting the recently proposed contextual guidance theory of astrocyte function in the brain (<a href=\"#c64\">64</a>).</p><p>Using an ELS paradigm that coincides with peak astrocyte postnatal development (<a href=\"#c65\">65</a>,<a href=\"#c66\">66</a>), we found a latent increase in circulating glucocorticoids after ELS with peak levels appearing during late adolescence and subsiding towards adulthood. While the lack of endocrine response to stress during the stress paradigm might appear paradoxical, this ELS paradigm overlaps with the stress hyporesponsive period, a time window during which stressors fail to elicit increases in blood corticosterone levels (<a href=\"#c67\">67</a>–<a href=\"#c70\">70</a>). Indeed, similar to our findings, others have reported latent increases in blood corticosterone levels following early-life stress that were associated with increased anxiety-like behaviour (<a href=\"#c47\">47</a>) and fear generalisation (<a href=\"#c71\">71</a>) later in life. Increased levels of blood glucocorticoids had a direct impact on astrocytes with increased translocation of GR from the cytosol to the nucleus of astrocytes following ELS, indicative of a higher levels of glucocorticoid signaling (<a href=\"#c56\">56</a>). While the effects of ELS on blood glucocorticoids were transient, this could have long-term consequences on protein expression levels resulting in changes in stress susceptibility and behavioural deficits. The primary behavioural phenotype revealed by this work, i.e. fear generalisation, is a common trait observed in anxiety disorders (<a href=\"#c49\">49</a>,<a href=\"#c72\">72</a>,<a href=\"#c73\">73</a>). As such, these findings provide further insight into the neurobiological mechanisms of stress on endocrine, cellular, and behavioural scales.</p><p>Our work builds upon a growing literature that is interested in the potential roles of astrocytes in early-life stress (<a href=\"#c74\">74</a>–<a href=\"#c77\">77</a>). Here, we identified specific astrocytic impairments induced by ELS and followed up with precise genetic manipulation of these astrocyte functions in the lateral amygdala. These astrocyte-specific manipulations replicate cellular and fear generalisation phenotype observed following ELS. We did not, however, observe an anxiety-like phenotype using elevated plus maze and open field with amygdala astrocyte manipulation which could be interpreted as a lack of astrocytic involvement in these discrete behaviours.</p><p>We found that both ELS and astrocyte dysfunction enhance neuronal excitability, assessed by local c-Fos staining in the lateral amygdala following auditory discriminative fear conditioning. One interpretation of these data is that astrocytes might tune engram formation, with astrocyte dysfunction, genetically or after stress, increasing c-Fos expression and a loss of specificity of the memory trace. In support of this notion, evidence of a cellular mechanism whereby c-Fos levels inversely correlate with memory accuracy have been recently shown in hippocampal circuits (<a href=\"#c48\">48</a>). In addition, early life experience strongly shapes episodic memory development, with stress delaying maturation of memory processes (<a href=\"#c78\">78</a>). Further support comes from recent demonstration of astrocyte-engram neuron interactions with astrocytes potentially forming part of engram stabilisation or even direct recruitment of astrocytes into engrams (<a href=\"#c55\">55</a>,<a href=\"#c79\">79</a>). Our data are in line with previous reports that have demonstrated clear roles for astrocytes in memory formation and consolidation (<a href=\"#c33\">33</a>,<a href=\"#c37\">37</a>,<a href=\"#c38\">38</a>) and reveal that astrocytes participate in the neurobiological mechanisms by which stress influences emotional memory.</p><p>Our work revealed unexpected sex differences in calcium signalling in lateral amygdala astrocytes. We found astrocyte calcium events were larger in amplitude and size in female mice compared to males. This higher basal activity could explain why CalEx induced a more profound impairment in fear discrimination in female mice. Interestingly, these sex differences are eliminated by stress inducing a homogenous calcium signature between both sexes. Sex differences in astrocytic development and function is starting to gain increased attention (<a href=\"#c62\">62</a>,<a href=\"#c65\">65</a>,<a href=\"#c80\">80</a>), with much more to be learned regarding the potentially divergent functions of astrocytes in the female and male brain.</p><p>In sum, our data shed new light on the role of astrocytes as central regulators of amygdala-dependent behaviour, synaptic function, and excitability. In addition, our work suggests a key role of astrocytes in mediating stress-induced behavioural and cellular impairments, supporting the notion that astrocytic disruption is not simply downstream of neuronal dysfunction. These ideas are forcing a change in perception of how brain disorders develop, moving away from a neuro-centric cascade and placing astrocytes in the spotlight (<a href=\"#c64\">64</a>,<a href=\"#c81\">81</a>–<a href=\"#c85\">85</a>). Collectively, these data support the hypothesis that astrocytes are key to execute the appropriate behavioural response to emotionally salient cues and underscore the potential of astrocytes as therapeutic targets in stress-related psychiatric conditions.</p><h1 id=\"s9\" class=\"heading-1\">Methods</h1><h2 id=\"s9a\" class=\"heading-2\">Animals</h2><p>All experiments were performed in accordance with the guidelines for maintenance and care of animals of the Canadian Council on Animal Care (CCAC) and approved by the Institutional Committee for the Protection of Animals (CIPA) at the Centre Hospitalier de l’Université de Montréal. Both male and female C57BL/6J mice (Jax #000664) were used in the study, housed on a 12hr:12hr light:dark cycle (lights on at 06:30) with <em>ad libitum</em> access to food and water.</p><h2 id=\"s9b\" class=\"heading-2\">Early Life Stress protocol</h2><p>ELS was performed as previously described (<a href=\"#c6\">6</a>).C57BL/6J pups were separated from their mothers for 4-hours per day (ZT2-ZT6) for 7 days between ages P10 and P17. During separation pups and mothers were placed into new cages with 60% less bedding. Bedding was weighed on P10 and divided 33% into each cage (home cage, pup separation cage, and mother separation cage). Separated pups and mothers had <em>ad libitum</em> access to food and water and pup cages were placed on a water heating pad maintained at 34 degrees Celsius. After the final day of separation (P17) bedding was returned to the original amount and pups were housed with their mothers until weaning at P21.</p><h2 id=\"s9c\" class=\"heading-2\">Behavioural assays</h2><h3 id=\"s9c1\" class=\"heading-3\">Auditory Discriminative Fear Conditioning</h3><p>Mice between ages P45-70 were used. Four days prior to behavioural testing mice were single housed in individual cages. Two days later mice were handled for approximately 10 minutes by hand and mobilisation tube. On the first day of ADFC, single housed mice were left for 1 hour in behavioural room to habituate prior to the start of the conditioning assay.</p><p><u>Conditioning:</u> Mice were first exposed to a neutral stimulus (CS−; white noise, 20s) repeated six times. After a two-minute interval mice were exposed to a tone which becomes the conditioned stimulus (CS+;12 kHz tone, 20s) as it co-terminates with a mild foot shock (Unconditioned stimulus (US); 0.5mA, 2s) delivered in the last two seconds of tone presentation (repeated six times). Conditioning was carried out in chamber with checkered walls that was cleaned with 70% ethanol between animals.</p><p><u>Memory recall:</u> 24 hours after conditioning mice were exposed to CS− and CS+ (counterbalanced) in a novel environment characterised by stripped walls and a white floor covering, cleaned with 0.5% hydroperoxide between animals. Fear learning was quantified by the percentage of time spent freezing to CS− and CS+/US during the conditioning phase. Fear memory was quantified by the percentage time freezing to CS− or CS+ following presentation in the memory-recall phase. A discrimination index was calculated comparing fear responses to CS+ and CS− using the following formula;\n</p><p><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_ueqn1.gif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_ueqn1.gif/full/max/0/default.jpg\" alt=\"\"/></picture></p><h3 id=\"s9c2\" class=\"heading-3\">Open Field Task</h3><p>This task comprised of a total of 5 minutes and during that time the mice were left to freely explore the OFT apparatus, a white plexiglass box measuring 38×38 cm. During the task, mice were filmed, and the time spent in distinct parts of the box <em>i.e.</em> centre and periphery were quantified using AnyMaze software (Stoelting). The total time spent in the center was used as a quantification of anxiety-like behaviour, where more time in the center represented less anxiety-like behaviour and the total distance travelled was measured to quantify locomotor changes.</p><h3 id=\"s9c3\" class=\"heading-3\">Elevated Plus Maze</h3><p>This task comprised of a total of 5 minutes during which mice were removed from their cages and placed at the centre of the four arms of the maze, facing an open arm. Mice were video recorded, and these videos were analysed using Anymaze software (Stoelting) which quantified the time spent (s) in closed arms or open arms during the 5min testing period. Anxiety-like behaviour was quantified by ratio of time spent in open vs closed arms.</p><h2 id=\"s9d\" class=\"heading-2\">Acute brain slice preparation</h2><p>Coronal slices containing lateral amygdala were obtained from mice between P45-70. Animals were anesthetized with isoflurane and the brain was rapidly excised and placed in ice-cold choline-based cutting solution saturated with 95% O<sub>2</sub> and 5% CO<sub>2</sub> containing the following (in mM): 120 choline chloride, 3 KCl, 1.25 NaH<sub>2</sub>PO<sub>4</sub>, 26 NaHCO<sub>3</sub>, 8 MgCl<sub>2</sub>, 20 glucose, pH 7.2 and 295 mOsmol. Slices (300 μm thick) were cut on a vibratome (Leica VT1200, Nussloch, Germany). Slices were transferred to oxygenated artificial CSF (ACSF) at 32 ± 0.5°C for 30 min containing the following (in mM): 130 NaCl, 2.5 KCl, 1.25 NaH<sub>2</sub>PO<sub>4</sub>, 26 NaHCO<sub>3</sub>, 10 glucose, 1.3 MgCl<sub>2</sub>, 2 CaCl<sub>2</sub>, pH 7.3–7.4 and 300-305 mOsmol, then allowed to recover for at least 30 min before recordings in oxygenated ACSF at room temperature (RT). For experiments, the slices were transferred to a recording chamber where they were perfused (2 ml/min) with ACSF at 32°C for the course of the experiment. Slices were used for a maximum of 6 hr after cutting.</p><h2 id=\"s9e\" class=\"heading-2\">Electrophysiology</h2><p>Extracellular field excitatory postsynaptic potentials (fEPSPs) were recorded in current clamp mode with a pipette filled with ACSF placed in the lateral part of the amygdala. Monosynaptic EPSPs were elicited by stimulation of cortical afferences with a tungsten concentric bipolar electrode (World Precision Instruments). LTP was induced using a theta burst stimulation (TBS) protocol consisting of 4 pulses at 100 Hz repeated at 5 Hz intervals for 10 seconds. Signals were amplified using a Multiclamp 700B amplifier (Molecular Devices) and digitized using the Digidata 1440 (Molecular Devices). Data were recorded (pClamp 10.2, Molecular Devices) for offline analysis. The magnitude of LTP was quantified by normalizing and averaging the slope of fEPSPs following LTP induction relative to the last 5 min of baseline.</p><h2 id=\"s9f\" class=\"heading-2\">Two-photon calcium imaging and analysis</h2><p>Fluorescence calcium imaging was performed on a custom two-photon laser-scanning microscope (Scientifica). The microscope was equipped with a Ti:Sapph laser (Ultra II, Coherent), a green bandpass emission filter (525-40 nm), an orange/red bandpass emission filter (605–70 nm), and associated photomultiplier tubes (GaAsP, Hamamatsu).Time-series images were acquired through bidirectional laser scanning (920nm excitation laser, 86.85µm x 86.85µm, 512×512 pixels at 1Hz) at a single focal plane incorporating the entirety of the imaged astrocyte ramifications. All images were acquired using Scanimage (mbf bioscience). Acute brain slices (350µm) containing the lateral amygdala were obtained from from mice (ages between P45-70) injected with the viral construct AAV2/5-gfaABC1D-lck-GCaMP6f 3 weeks prior. Animals were anesthetized with isoflurane and the brain was rapidly excised and placed in ice-cold NMDG based cutting solution saturated with 95% O2 and 5% CO2 containing the following (in mM): 119.9 NMDG, 2.5 KCl, 25, 1 CaCl2, 1.4 NaH2P04 and 20 D-glucose saturated with 95% O2 and 5% CO2. Slices (350µm thick) were cut on a vibratome (Leica VT1200, Nussloch, Germany). Slices were transferred to oxygenated NMDG cutting solution artificial CSF (aCSF) at 33 ± 0.5°C for 15 min followed by a 1-hour recovery period in artificial CSF (aCSF) at RT containing the following (in mM): 130 NaCl, 2.5 KCl, 1.25 NaH<sub>2</sub>PO<sub>4</sub>, 26 NaHCO<sub>3</sub>, 2.5 glucose, 1.3 MgCl<sub>2</sub>, 2 CaCl<sub>2</sub>, pH 7.3–7.4 and 300-305 mOsmol. All time-series images were acquired in a recording chamber constantly perfused with aCSF as described above.</p><p>For unbiased, automatic calcium event detection, TIFF files of time-lapse images were processed with the AQUA2 pipeline in MATLAB. Parameters of interest (event frequency, amplitude, area, duration, rise time and decay time) were directly extracted from the AQUA2 output file. For statistical testing, averages of all events from a single astrocyte were calculated for each parameter. In parallel, to better represent the diversity in calcium events, frequency distributions plots were created considering every detected event for all our experimental conditions.</p><h2 id=\"s9g\" class=\"heading-2\">Stereotaxic surgery and AAV delivery</h2><p>P25-35 mice were given a subcutaneous (<em>s.c.</em>) injection of Carprofen (20 mg/kg) 1h prior surgery. Animals were then deeply anesthetised (2% isoflurane) before placing them into a stereotaxic frame (Kopf instruments). Surgical site was infiltrated with bupivacaine/lidocaine (2mg/kg <em>sc.</em>) 15 min prior surgery. Biliteral injections of the following viral constructs produced at the Canadian Neurophotonics Viral Vector Core:AAV2/5-gfaABC1D-lck-GCamP6f (9.6×10<sup>12</sup> GC/ml), AAV2/5-gfaABC1D-eGFP (1.2-1.5×10<sup>11-12</sup> GC/ml), AAV2/5-gfaABC1D-dnCx43-eGFP (1.2-1.7×10<sup>12</sup> GC/ml) and AAV2/5-gfaABC1D-hPMCAw/b-mCherry (1.2×10<sup>12</sup>) were delivered to the LA (coordinates relative to bregma: −1.4 mm AP, ± 3.4 mm ML and −5 mm DV) of mice of either sex. Viral solutions were injected at a rate of 200 nL/min for a total volume of 650 nL per hemisphere using a 10 µl Hamilton syringe (Harvard apparatus) and a microinjection syringe pump (UMP3T-2 World Precision Instruments). Animals received 250 µL of saline for post-surgery hydration.</p><h2 id=\"s9h\" class=\"heading-2\">Brain processing</h2><p>Mice were anaesthetised in an enclosed chamber filled with isoflurane (5% for induction, 3-4% for maintenance, v/v) until loss of toe pinch reflex. A transcardial perfusion was used to ensure uniform preservation of tissue and brains were fixed in 4 % paraformaldehyde (PFA) for 24 hours at 4 degrees Celsius. The fixed brains were then placed in falcon tubes containing 30% sucrose solution for a minimum of two days. Brains were embedded in optimal cutting temperature (OCT) compound and flash frozen in 2-methylbutane between −40 and −50 degrees Celsius and then stored at −80 until cryosectioning. Brains were cut at 30um thickness at −20 degrees Celsius using a Leica CM3050S Cryostat. Slices were stored in cryoprotector solution at 4 degrees Celsius until immunohistochemistry.</p><p>For c-fos labeling experiments, mice were anaesthetised and then perfused 90 minutes after the end of fear conditioning. The whole lateral amygdala was sectioned in 30um thick brain slices and every fourth brain slice was selected for immunohistochemistry.</p><h2 id=\"s9i\" class=\"heading-2\">Immunohistochemistry</h2><p>Free floating brain slices were washed 3 times in 1X PBS for 15 minutes to remove cryoprotector solution. Slices were permeabilised in block-perm solution (3% Bovine-Serum-Albumin, 0.5% Triton<sup>10%</sup> in PBS) for a duration of 1 hour. Slices were incubated with antibodies for 24 hours at 4 degrees Celsius. Slices were incubated with primary antibodies; [Rabbit] anti-S100β (1:1000, Abcam, ab52642), [Mouse] anti-glucocorticoid receptor (1:500, ThermoFisher, MA1-510), [Chicken] anti-GFAP (1:1000, ThermoFisher, PA1-10004), [mouse] anti-Cx43 (1:1000 ThermoFisher, 3D8A5), [Rabbit] Anti-GLT-1 (EAAT2) (1:1000, NovusBio, NBP1-20136) and), [Rabbit] Anti-c-Fos (1:2000, Synaptic Systems, Cat.No. 226008). After primary antibody incubation slices were washed 3 times in 1X PBS for 15 minutes to remove non-specific binding. Slices were incubated with secondary antibodies in a DAPI solution (1:10000) at RT in aluminium foil for 1 hour. Slices were incubated with secondary antibodies; [goat] anti-rabbit Alexa 488 (1:1000, Jackson Immuno Research, 111-545-144), [goat] anti-mouse Alexa 647 (1:1000, ThermoFisher, A32728), [goat] anti-chicken Alexa 568 (1:1000, ThermoFisher, A11041). After secondary antibody incubation slices were washed again 3 times in 1X PBS for 15 minutes before being mounted onto Fisherbrand microscope slides using ProLong™ Glass Antifade mountant (P36982).</p><h2 id=\"s9j\" class=\"heading-2\">Microscopy</h2><p>Slices were imaged using a Leica TCS SP5 laser scanning confocal microscope with oil immersion Plan-Apochromat 63x objective 1.4 NA, or using a Zeiss Observer Z1 spinning disk confocal microscope/TIRF with a 20x objective 1.8 NA. 16-bit images of 246 x 246 um areas were acquired at 400Hz (frame size (x*y); 1024 x 1024, pixel size; 250nm). 25-30um z-stacks were acquired with a step size of 0.5um. 15um max intensity z-projections of the lateral amygdala were analysed using Image-J (Fiji) to obtain A.U fluorescence intensity measures of secondary antibodies attached to primaries with specificity to epitopes; GFAP, Cx43, GLT-1, and GR. We applied a fluorescence threshold for GFAP, Cx43 and GLT-1 fluorescence and measured integrated density A.U (thresholds; Mean, Otsu, Otsu respectively). For nuclear and cytosolic Glucocorticoid Receptor measures, astrocyte (S100β+ DAPI nuclei were thresholded and used as ROIs for nuclear measures of GR fluorescence (S100β<sup>+</sup> + DAPI<sup>+</sup>). The same nuclear DAPI ROI was cleared from the previously thresholded s100b regions to obtain cytosolic astrocytic GR (S100β<sup>+</sup> - DAPI<sup>+</sup>). Integrated density A.U of GR fluorescence was used to calculate Nuclear:Cytosolic GR ratios.</p><p>For c-Fos cell counting in the lateral amygdala, 16-bit images containing the lateral and basal amygdala nuclei were acquired. 20-30 z-stacks were acquired with a step size of 1um. For c-Fos particle counting analysis, a region of interest was used to isolate the lateral amygdala and then 8-bit z-stacks of the c-Fos channel were analysed semi-automatically by using the FIJI plugin Quanty-cfos (<a href=\"#c86\">86</a>). In brief, a threshold for area and fluorescence intensity was set manually to identify ROIs around all c-Fos positive nuclei. These ROIs were then manually inspected to remove false positives and negatives found by the plug-in. c-Fos particle counts were then normalized by the volume of the z-stack to calculate the c-Fos density. In order the calculate the volume, the area of the lateral amygdala was multiplied by the number of z-stacks.</p><h2 id=\"s9k\" class=\"heading-2\">Blood Collection &amp; Corticosterone analysis</h2><p>Trunk blood was collected via decapitation at ZT2 (08:30). To minimise handling induced elevations in corticosterone mice were housed with clear plastic tubes used to move individual mice intoan enclosed chamber filled with 5% isoflurane for 2 minutes. Mice were placed in enclosed Isoflurane until loss of toe pinch reflect (maximum elapsed time of 2 minutes). Mice were decapitated and trunk blood was collected into BD 365963 Microtainer® Capillary Blood Collection Tubes and placed onto Ice. Blood was centrifuged for 5 minutes at 4 degrees Celsius at 5000rpm. Serum was aliquoted and stored at −80 degrees Celsius. Corticosterone measurements were obtained using an ENZO ELISA kit (ADI-900-097).</p><h2 id=\"s9l\" class=\"heading-2\">Statistical analyses</h2><p>Results are presented as mean ±S.E.M. Data with one variable were analyzed with the two-tailed Student’s <em>t</em> test or Mann-Whitney test. Data with more than two conditions were first screened for a Gaussian distribution with Kolmogorov-Smirnov test followed by analysis either with one-way/repeated measures ANOVA or Kruskal-Wallis/Friedman test when needed and Tukey’s multiple-comparison parametric <em>post hoc</em> test (data with Gaussian distribution) or by a Dunn’s multiple-comparison non-parametric <em>post hoc</em> test (data with non-Gaussian distribution). Auditory discriminative fear conditioning data was analysed using a two-way ANOVA with appropriate post-hoc tests. Open field and elevated plus maze data analysed using one-way ANOVA with appropriate post hoc tests. Graphic significance levels were *, p &lt; 0.05; **, p &lt; 0.01 and ***, p &lt; 0.001. All data were analyzed using GraphPad Prism software (Version 9, GraphPad, USA).</p><h2 id=\"s9m\" class=\"heading-2\">Data availability</h2><p>The datasets that support the findings of this study are available from the corresponding author upon request.</p></section><section id=\"supplementary-figures-and-tables\"><h1 id=\"s10\" class=\"heading-1\">Supplementary figures and tables</h1><div class=\"figure-container\"><figure class=\"figure\" id=\"fig2s1\"><label class=\"figure__label\">Figure 2 – Figure supplement 1</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_fig2s1.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_fig2s1.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><p><strong>(A)</strong> No differences between male and female naïve mice freezing during learning phase (conditioning) of auditory discriminative fear conditioning to CS− (left), P=0.2521; or CS+ (right), P=0.8432. Female N=7, Male N=8. <strong>(B)</strong> No differences between male and female naïve mice during memory recall of CS− (left), P=0.3956; and CS+ (right), P=0.8851. Female N=7, Male N=8. <strong>(C)</strong> No differences in auditory discrimination between male and female naïve mice. P= 0.8505, Female N=7, Male N=8. <strong>(D)</strong> No differences between male and female ELS mice freezing during learning phase (conditioning) of auditory discriminative fear conditioning to CS− (left), P= 0.2521. Female ELS mice freeze significantly more to CS+ (right) than male counterparts, P&lt;0.0001. Female N=9, Male N=8. <strong>(E)</strong> No differences between male and female ELS mice during memory recall of CS− (left), P= 0.16220; or CS+ (right), P=0.1869. Female N=9, Male N=8. <strong>(F)</strong> No differences in auditory discrimination between male and female ELS mice. P=0.5157, Female N=9, Male N=8.</p></figcaption></figure></div><div class=\"figure-container\"><figure class=\"figure\" id=\"fig2s2\"><label class=\"figure__label\">Figure 2 – Figure supplement 2</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_fig2s2.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_fig2s2.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><p><strong>(A)</strong> Average freezing responses to CS− (grey) and CS+ (red) during fear conditioning for naïve and ELS mice. Tone (CS +/−) represents the within-subject variable while treatment (naïve/ELS) represents the between-subject variable. <strong>Naïve</strong> (<strong>CS− vs CS+/US</strong>), P &lt;0.0001, N=15 mice; <strong>ELS</strong> (<strong>CS− vs CS+/US</strong>), P&lt;0.0001, N=17; <strong>CS−</strong> (<strong>Naïve vs ELS</strong>), P=0.2543, Naïve N=15 mice, ELS N=17 mice; <strong>CS+/US</strong> (<strong>Naïve vs ELS</strong>), P=0.2851, Naïve N=15 mice, ELS N=17 mice. <strong>(B)</strong> Average freezing responses to CS− (grey) and CS+ (red) during Discrimination for naïve and ELS mice. Tone (CS +/−) represents the within-subject variable while treatment (naïve/ELS) represents the between-subject variable. <strong>Naïve</strong> (<strong>CS− vs CS+/US</strong>), P=0.0001, N=15 mice; <strong>ELS</strong> (<strong>CS− vs CS+/US</strong>), P=0.0392, N=17 mice; <strong>CS−</strong> (<strong>Naïve vs ELS</strong>), P=0.0128, Naïve N=15 mice, ELS N=17 mice; <strong>CS+/US</strong> (<strong>Naïve vs ELS</strong>), P=0.7267, Naïve N=15 mice, ELS N=17 mice. <strong>(C)</strong> Normalised fEPSP slope showing synaptic response before and after theta burst stimulation (grey vertical bar) in naïve and ELS mice. <strong>(D)</strong> Representative Z-stack projection of c-Fos staining in entire lateral and basolateral amygdala in a naïve mice 90 minutes after conditioning. <strong>(E)</strong> Representative Z-stack projection of c-Fos staining in entire lateral and basolateral amygdala in an ELS mice 90 minutes after conditioning. <strong>(F)</strong> No differences in c-Fos density between male and female naïve mice 90 minutes after conditioning. P=0.1020, Male n=27, Female n=12. <strong>(G)</strong> ELS results in increased c-Fos density 90 minutes after conditioning in male mice compared to female counterparts. P= 0.0383, Male n=19, Female n=18. Scale bars = 100μm</p></figcaption></figure></div><div class=\"figure-container\"><figure class=\"figure\" id=\"fig2s3\"><label class=\"figure__label\">Figure 2 - Figure supplement 3</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_fig2s3.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_fig2s3.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><p><strong>(A)</strong> Representative immunostaining of eGFP-expressing astrocytes (left), c-Fos (middle) and merge (right), from the lateral amygdala 90 minutes following fear conditioning. Yellow arrows point to c-Fos-positive astrocyte. Scale bars = 100μm. <strong>(B)</strong> Quantification of eGFP-positive c-Fos-positive astrocytes as a percentage of total c-Fos positive counts in the lateral amygdala.</p></figcaption></figure></div><div class=\"figure-container\"><figure class=\"figure\" id=\"fig3s1\"><label class=\"figure__label\">Figure 3 – Figure supplement 1</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_fig3s1.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_fig3s1.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><p><strong>(A)</strong> Normalised Fluorescence intensity values of GFAP in the lateral amygdala of Naïve and ELS mice split by Sex. Naïve Male (N=7) vs ELS male (N=10), P=0.582; <strong>Naïve Female</strong> (N= 8) vs <strong>ELS Female</strong> (N=8), P=0.0323; <strong>Naïve Male</strong> vs <strong>Naïve Female</strong>, P&gt;0.999; <strong>ELS male</strong> vs <strong>ELS Female</strong>, P=0.750. Normalised Fluorescence intensity values of Cx43 in the lateral amygdala of Naïve and ELS mice split by Sex. Naïve Male (N=7) vs ELS male (N=9), P=0.0253; <strong>Naïve Female</strong> (N= 9) vs <strong>ELS Female</strong> (N=7), P=0.0201; <strong>Naïve Male</strong> vs <strong>Naïve Female</strong>, P&gt;0.999; <strong>ELS male vs ELS Female</strong>, P=0.9189.</p></figcaption></figure></div><div class=\"figure-container\"><figure class=\"figure\" id=\"fig4s1\"><label class=\"figure__label\">Figure 4 – Figure supplement 1</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_fig4s1.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_fig4s1.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><p><strong>(A)</strong> ELS results in decreased calcium event amplitude only for female mice. <strong>Male</strong> (Naïve vs ELS), P=0.5478; <strong>Female</strong> (Naïve vs ELS), P=0.0058. Increased calcium event amplitude was observed in naïve females compared to males. <strong>Naïve</strong> (Male vs Female), P=0.0425. No differences were observed between male and female ELS animals. <strong>ELS</strong> (Male vs Female), P=0.9627. Naïve Male n=13 astrocytes, Naïve Female n=10 astrocytes, ELS Male n=10 astrocytes, ELS Female n=8 astrocytes. <strong>(B)</strong> Frequency distribution of calcium event amplitude from naïve male (blue line) and female (red line) mice. <strong>(C)</strong> Frequency distribution of calcium event amplitude from ELS male (dark teal line) and female (purple line) mice. <strong>(D)</strong> ELS results in decreased calcium event area only for female mice. <strong>Male</strong> (Naïve vs ELS), P=0.0385; <strong>Female</strong> (Naïve vs ELS), P &lt;0.0001. Increased calcium event area was observed in naïve females compared to males. <strong>Naïve</strong> (Male vs Female), P=0.0002. No differences were observed between male and female ELS animals. <strong>ELS</strong> (Male vs Female), P=0.9702 Naïve Male n=14 astrocytes, Naïve Female n=11 astrocytes, ELS Male n=13 astrocytes, ELS Female n=12 astrocytes. <strong>(E)</strong> Frequency distribution of calcium event area from naïve male (blue line) and female (red line) mice. <strong>(F)</strong> Frequency distribution of calcium event area from ELS male (dark teal line) and female (purple line) mice. <strong>(G)</strong> ELS results in increased calcium event rise time only for female mice. <strong>Male (</strong>Naïve vs ELS), P=0.6814; <strong>Female</strong> (Naïve vs ELS), P &lt;0.0001. Increased calcium event amplitude was observed in naïve males compared to females. <strong>Naïve</strong> (Male vs Female), P=0.0014. No differences were observed between male and female ELS animals. <strong>ELS</strong> (Male vs Female), P=0.1062. Naïve Male n=14 astrocytes, Naïve Female n=11 astrocytes, ELS Male n=13 astrocytes, ELS Female n=12 astrocytes. <strong>(H)</strong> Frequency distribution of calcium event rise time from naïve male (blue line) and female (red line) mice. <strong>(I)</strong> Frequency distribution of calcium event rise time from ELS male (dark teal line) and female (purple line) mice. <strong>(J)</strong> ELS results in decreased frequency of calcium events both for males and females. <strong>Male</strong> (Naïve vs ELS), P&lt;0.0001; <strong>Female</strong> (Naïve vs ELS), P=0.0419. No difference in calcium event frequency were observed between male and females within the naïve or ELS groups. <strong>Naïve</strong> (Male vs Female), P=0.2053; <strong>ELS</strong> (Male vs Female), P=0.2671. Naïve Male n=14 astrocytes, Naïve Female n=11 astrocytes, ELS Male n=13 astrocytes, ELS Female n=12 astrocytes. <strong>(K</strong> Frequency distribution of calcium event frequency from naïve male (blue line) and female (red line) mice. <strong>(L)</strong> Frequency distribution of calcium event frequency from ELS male (dark teal line) and female (purple line) mice. <strong>(M)</strong> No differences in calcium event duration between Naïve and ELS female and male mice. <strong>Male</strong> (Naïve vs ELS), P=0.7688; <strong>Female</strong> (Naïve vs ELS), P=0.4499. <strong>Naïve</strong> (Male vs Female), P=0.4983; <strong>ELS</strong> (Male vs Female), P=0.8604. Naïve Male n=14 astrocytes, Naïve Female n=11 astrocytes, ELS Male n=13 astrocytes, ELS Female n=12 astrocytes. <strong>(N)</strong> Frequency distribution of calcium event duration from naïve male (blue line) and female (red line) mice. <strong>(O)</strong> Frequency distribution of calcium event duration from ELS male (dark teal line) and female (purple line) mice. <strong>(P)</strong> No differences in calcium event decay time between Naïve and ELS female and male mice. <strong>Male</strong> (Naïve vs ELS), P=0.9997; <strong>Female</strong> (Naïve vs ELS), P=0.0718. <strong>Naïve</strong> (Male vs Female), P=0.5942; <strong>ELS</strong> (Male vs Female), P=0.3383. Naïve Male n=14 astrocytes, Naïve Female n=11 astrocytes, ELS Male n=13 astrocytes, ELS Female n=12 astrocytes. <strong>(Q)</strong> Frequency distribution of calcium event decay time from naïve male (blue line) and female (red line) mice. <strong>(R)</strong> Frequency distribution of calcium event decay time from ELS male (dark teal line) and female (purple line) mice.</p></figcaption></figure></div><div class=\"figure-container\"><figure class=\"figure\" id=\"fig5s1\"><label class=\"figure__label\">Figure 5 – Figure supplement 1</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_fig5s1.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_fig5s1.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><p><strong>(A)</strong> Representative viral targeting of lateral amygdala astrocytes with AAV-GfaABC<sub>1</sub>D-eGFP.</p></figcaption></figure></div><div class=\"figure-container\"><figure class=\"figure\" id=\"fig5s2\"><label class=\"figure__label\">Figure 5 – Figure supplement 2</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_fig5s2.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_fig5s2.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><p><strong>(A)</strong> Timeline of CalEx/lck-GCaMP6 viral injections and 2-photon calcium imaging experiments. <strong>(B)</strong> Representative image of a non-CalEx (CalEx-) lck-GCaMP6-expressing astrocyte in the lateral amygdala with 4 regions of interest from a naïve animal. Scale bar=10μm <strong>(C)</strong> Representative calcium-signaling traces from 4 regions of interest shown in <strong>B. (D)</strong> Representative image of a CalEx+lck-GCaMP6-expressing astrocyte in the lateral amygdala with 4 regions of interest from an ELS animal. Scale bar=10μm <strong>(E)</strong> Representative calcium-signaling traces from 4 regions of interest shown in <strong>D. (F)</strong> CalEx effectively decreases the frequency of calcium events in lateral amygdala astrocytes. P=0.0087, CalEx-n=6 astrocytes from N=3 animals, CalEx+ n=6 astrocytes from N=3 animals. <strong>(G)</strong> CalEx decreases calcium event amplitude in lateral amygdala astrocytes. P=0.0411, CalEx-n=6 astrocytes from N=3 animals, CalEx+ n=6 astrocytes from N=3 animals. <strong>(H)</strong> CalEx does not impact calcium event area in lateral amygdala astrocytes. P=0.0649, CalEx-n=6 astrocytes from N=3 animals, CalEx+ n=6 astrocytes from N=3 animals. <strong>(I)</strong> CalEx does not impact calcium event duration in lateral amygdala astrocytes. P=0.1797, CalEx-n=6 astrocytes from N=3 animals, CalEx+ n=6 astrocytes from N=3 animals. <strong>(J)</strong> CalEx does not impact calcium event rise time in lateral amygdala astrocytes. P=0.3095, CalEx-n=6 astrocytes from N=3 animals, CalEx+ n=6 astrocytes from N=3 mice. <strong>(K)</strong> CalEx does not impact calcium event decay time in lateral amygdala astrocytes. P=0.5887, CalEx-n=6 astrocytes from N=3 animals, CalEx+ n=6 astrocytes from N=3 mice.</p></figcaption></figure></div><div class=\"figure-container\"><figure class=\"figure\" id=\"fig5s3\"><label class=\"figure__label\">Figure 5 – Figure supplement 3</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_fig5s3.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_fig5s3.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><p><strong>(A)</strong> No effect of lateral amygdala astrocyte viral manipulation on time spent in closed arms of elevated plus maze. <strong>eGFP vs CalEx;</strong> P&gt;0.9999, <strong>eGFP vs dnCx43</strong>, P=0.7177; <strong>CalEx vs dnCx43,</strong> P&gt;0.9999. eGFP N= 7 animals, CalEx N=9 animals, dnCx43 N=9 animals. <strong>(B)</strong> No effect of lateral amygdala astrocyte viral manipulation on time spent in open arms of elevated plus maze. <strong>eGFP vs CalEx;</strong> P&gt;0.9999, <strong>eGFP vs dnCx43</strong>, P=0.7177; <strong>CalEx vs dnCx43,</strong> P&gt;0.9999. eGFP N= 7 animals, CalEx N=9 animals, dnCx43 N=9 animals. <strong>(C)</strong> No effect of lateral amygdala astrocyte viral manipulation on total distance travelled in the elevated plus maze. <strong>eGFP vs CalEx;</strong> P=0.3095, <strong>eGFP vs dnCx43</strong>, P=0.5025; <strong>CalEx vs dnCx43,</strong> P=0.9197. eGFP N= 7 animals, CalEx N=9 animals, dnCx43 N=9 animals. <strong>(D)</strong> No effect of lateral amygdala astrocyte viral manipulation on time spent in the periphery of open field maze. <strong>eGFP vs CalEx;</strong> P=0.8547, <strong>eGFP vs dnCx43</strong>, P&gt;0.9999; <strong>CalEx vs dnCx43,</strong> P=0.9248. eGFP N= 6 animals, CalEx N=11 animals, dnCx43 N=12 animals. <strong>(E)</strong> No effect of lateral amygdala astrocyte viral manipulation on time spent in the center of open field maze. <strong>eGFP vs CalEx;</strong> P=0.8547, <strong>eGFP vs dnCx43</strong>, P&gt;0.9999; <strong>CalEx vs dnCx43,</strong> P=0.9248. eGFP N= 6 animals, CalEx N=11 animals, dnCx43 N=12 animals. <strong>(F)</strong> No effect of lateral amygdala astrocyte viral manipulation on total distance travelled in the open field maze. <strong>eGFP vs CalEx;</strong> P=0.8547, <strong>eGFP vs dnCx43</strong>, P&gt;0.9999; <strong>CalEx vs dnCx43,</strong> P=0.9248. eGFP N= 6 animals, CalEx N=11 animals, dnCx43 N=12 animals.</p></figcaption></figure></div><div class=\"figure-container\"><figure class=\"figure\" id=\"fig5s4\"><label class=\"figure__label\">Figure 5 – Figure supplement 4</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_fig5s4.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_fig5s4.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><p><strong>(A)</strong> Average freezing responses to CS− (grey) and CS+ (red) during fear conditioning for eGFP, CalEx and dnCx43 mice. Tone (CS +/−) represents the within-subject variable while treatment (naïve/ELS) represents the between-subject variable. <strong>eGFP</strong> (CS− vs CS+US), P&lt;0.0001, N=12 animals; <strong>CalEx</strong> (CS− vs CS+US), P&lt;0.0001, N=11 animals; <strong>dnCx43</strong> (CS− vs CS+US), P&lt;0.0001, N=17 animals; <strong>CS−</strong> (eGFP vs CalEx), P= 0.9448; <strong>CS−</strong> (eGFP dnCx43), P=0.3372; <strong>CS−</strong> (CalEx vs dnCx43), P=0.7121; <strong>CS+US</strong> (eGFP vs CalEx), P=0.6879; <strong>CS+/US</strong> (eGFP vs dnCx43), P=0.8030; <strong>CS+/US</strong> (CalEx vs dnCx43), P=0.9891. <strong>(B)</strong> Average freezing responses to CS− (grey) and CS+ (red) during Discrimination for eGFP, CalEx and dnCx43 mice. Tone (CS +/−) represents the within-subject variable while treatment (naïve/ELS) represents the between-subject variable. <strong>eGFP</strong> (CS− vs CS+US), P&lt;0.0001, N=12 animals; <strong>CalEx</strong> (CS− vs CS+US), P&lt;0.0001, N=11 animals; <strong>dnCx43</strong> (CS− vs CS+US), P&lt;0.0001, N=17 animals; <strong>CS−</strong> (eGFP vs CalEx), P=0.9448; <strong>CS−</strong> (eGFP dnCx43), P=0.3372; <strong>CS−</strong> (CalEx vs dnCx43), P=0.7121; <strong>CS+/US</strong> (eGFP vs CalEx), P=0.6879; <strong>CS+/US</strong> (eGFP vs dnCx43), P=0.8030; <strong>CS+/US</strong> (CalEx vs dnCx43), P=0.9891. <strong>(C)</strong> CalEx disruption of lateral amygdala astrocytes affects female auditory cue discrimination significantly more than male counterparts. P&lt;0.0001, Male N=6 animals, Female N=5 animals. <strong>(D)</strong> No differences in the impact of dnCx43 on auditory cue discrimination between male and female animals. P=0.1803, Male N=10, Female N=7.</p></figcaption></figure></div><div class=\"figure-container\"><figure class=\"figure\" id=\"fig5s5\"><label class=\"figure__label\">Figure 5 – Figure supplement 5</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_fig5s5.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_fig5s5.tif/full/max/0/default.jpg\" alt=\"\"/></picture><figcaption class=\"figure__caption\"><p><strong>(A)</strong> Representative Z-stack projection of c-Fos staining in entire lateral and basolateral amygdala from an eGFP mice 90 minutes after conditioning. <strong>(B)</strong> Representative Z-stack projection of c-Fos staining in entire lateral and basolateral amygdala from a CalEx mice 90 minutes after conditioning. <strong>(C)</strong> Representative Z-stack projection of c-Fos staining in entire lateral and basolateral amygdala from a dnCX43 mice 90 minutes after conditioning. <strong>(D)</strong> No differences in lateral amygdala c-Fos density between male and female eGFP mice. P=0.9372, Male n=6 astrocytes, Female n=6 astrocytes. <strong>(E)</strong> No differences in lateral amygdala c-Fos density between male and female CalEx mice. P=0.3502, Male n= 6 astrocytes, Female n=11 astrocytes. <strong>(F)</strong> dnCx43 leads to increased lateral amygdala c-Fos density in females compared to male counterparts. P=0.0051, Male n=5 astrocytes, Female n=7 astrocytes.</p></figcaption></figure></div><div class=\"figure-container\"><figure class=\"figure\" id=\"tbls1\"><label class=\"figure__label\">Supplementary Table 1</label><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_tbls1.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_tbls1.tif/full/max/0/default.jpg\" alt=\"\"/></picture><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_tbls1a.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_tbls1a.tif/full/max/0/default.jpg\" alt=\"\"/></picture><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_tbls1b.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_tbls1b.tif/full/max/0/default.jpg\" alt=\"\"/></picture><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_tbls1c.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_tbls1c.tif/full/max/0/default.jpg\" alt=\"\"/></picture><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_tbls1d.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_tbls1d.tif/full/max/0/default.jpg\" alt=\"\"/></picture><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_tbls1e.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_tbls1e.tif/full/max/0/default.jpg\" alt=\"\"/></picture><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_tbls1f.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_tbls1f.tif/full/max/0/default.jpg\" alt=\"\"/></picture><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_tbls1g.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_tbls1g.tif/full/max/0/default.jpg\" alt=\"\"/></picture><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_tbls1h.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_tbls1h.tif/full/max/0/default.jpg\" alt=\"\"/></picture><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_tbls1i.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_tbls1i.tif/full/max/0/default.jpg\" alt=\"\"/></picture><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_tbls1j.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_tbls1j.tif/full/max/0/default.jpg\" alt=\"\"/></picture><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_tbls1k.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_tbls1k.tif/full/max/0/default.jpg\" alt=\"\"/></picture><picture><source srcSet=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_tbls1l.tif/full/max/0/default.jpg\"/><img loading=\"lazy\" src=\"https://prod--epp.elifesciences.org/iiif/2/99988%2Fv2%2Fcontent%2F519598v4_tbls1l.tif/full/max/0/default.jpg\" alt=\"\"/></picture></figure></div></section><section id=\"acknowledgements\"><h1 class=\"heading-1\">Acknowledgements</h1><p>We thank Rosemary Bagot (McGill University) for critical input on this study, Thierry Alquier and Stephanie Fulton (Université de Montréal) for their input throughout, Aurélie Cleret-Buhot (CRCHUM cellular imaging core) for microscopy training, and the staff of the animal facility at the CRCHUM. This work was funded by Canadian Institutes of Health Research Project Grant (478629), NSERC Discovery Grant (RGPIN-2021-03211), Fonds de Recherche du Québec – Santé (FRQS; 296562 &amp; 309889), Brain and Behaviour Research Foundation Young Investigator award (NARSAD; 28589), CHUM Foundation, Fondation Courtois, and the Réseau Québécois sur le Suicide les troubles de l’humeur et les troubles Associées (RQSHA) grant to C.M-R. L.D-H. was supported by a doctoral fellowship from the Fonds de Recherche du Québec. I.I.A., J.V. and B.R. were supported by a Canada Graduate Scholarship Master’s award, and Recruitment Fellowships from Neuroscience Dept. Université de Montréal. C.M-R. was supported by a Junior 1 Chercheur-Boursier salary award from FRQS.</p></section><section id=\"additional-information\"><h1 id=\"d1e1317\" class=\"heading-1\">Additional information</h1><h2 id=\"s8\" class=\"heading-2\">Author Contributions</h2><p>M.G. I.I.A., L.R.D-H, and C.M-R designed the study. M.G., I.I.A., O.G., J.L-A, J.V. and C.M-R. carried out behavioural experiments, analysing the subsequent data. M.G. and L.R.D-H. carried out immunostaining and analysis of subsequent data. L.R.D-H, M.D., B.R. took blood samples and performed ELISA experiments. M.G., L.R.D-H., O.G., and A.B. carried out injection of viral vectors. M.G. and A.B. carried out electrophysiological experiments and analysis of subsequent data. M.G. carried out calcium imaging. S.P. maintained and generated mouse colonies. M.G. L.R.D-H, A.B., and C.M-R wrote the manuscript. All authors contributed to generating ELS mice and approved the final version of the manuscript.</p></section>"
}
