{
  "id": "80993",
  "doi": "10.1101/2022.05.28.493855",
  "pdf": "https://www.biorxiv.org/content/10.1101/2022.05.28.493855v1.full.pdf",
  "status": "reviewed",
  "authorLine": "François Mallard, Bruno Afonso, Henrique Teotónio",
  "title": "Selection and the direction of phenotypic evolution",
  "indexContent": "* Evolutionary Biology (https://elifesciences.org/subjects/evolutionary-biology)\\n\\n\\n** Selection and the direction of phenotypic evolution\\n------------------------------------------------------------\\n1. François Mallard\\n2. Bruno Afonso\\n3. Henrique Teotónio\\n\\n* https://doi.org/10.7554/eLife.80993.1\\n\\n* Open access (https://en.wikipedia.org/wiki/Open_access)\\n* Copyright information (https://creativecommons.org/licenses/by/4.0/)\\n\\n\\n** Reviewed Preprint\\n------------------------------------------------------------\\n\\nThis preprint was published after peer review by eLife.\\n* downloadDownload (#)\\n\\nSent for peer review\\n12 July 2022\\n\\nPosted to bioRxiv\\n29 May 2022Go to bioRxiv (https://www.biorxiv.org/content/10.1101/2022.05.28.493855)\\n\\n* Full text\\n* Figures and data\\n* Peer review\\n\\n* Abstract (#abstract)\\n* eLife assessment (#assessment)\\n* Introduction (#s1)\\n* Methods (#s2)\\n* Results (#s3)\\n* Discussion (#s4)\\n* References (#references)\\n* Author Information (#author-list)\\n\\n\\n** Abstract\\n------------------------------------------------------------\\nPredicting phenotypic evolution on the short-term of tens to hundreds of generations, particularly in changing environments and under finite population sizes, is an important theoretical goal. Because organisms are not simply collections of independent traits, making headway into this goal requires understanding if the phenotypic plasticity of ancestral populations aligns with the phenotypic dimensions that contain more genetic variation for selection to be effective and eventually feedback on the maintenance of genetic variation and promote adaptation or rescue from extinction. By performing 50 generations of experimental evolution in a changing environment we show that ancestral phenotypic plasticity for locomotion behavior in the partially-outcrossing nematode Caenorhabditis elegans is nonadaptive because it does not align with the phenotypic dimension encompassing most genetic variance in the ancestral population and is of no consequence to future phenotypic divergence. Despite\\nevolution of the genetic structure of locomotion behavior we are able to predict the direction of phenotypic divergence, but not the magnitude, based on the genetic covariances between the component traits of locomotion behavior and fitness of the ancestral population. We further demonstrate that indirect selection on the component traits of locomotion behavior with unobserved trait(s) is responsible for the observed phenotypic divergence on them. Our findings indicate that selection theory can predict the direction of short-term adaptive phenotypic evolution.\\n\\neLife assessment\\n\\nThis is a potentially important paper that takes advantage of an unusually comprehensive evolutionary genetic dataset to tease apart the relationship between genetic variation and phenotypic divergence over the ~medium term (50 generations). The questions addressed have broad relevance across evolution, conservation, and agricultural fields, and this paper will particularly appeal to evolutionary biologists. Nonetheless, the strength of evidence is incomplete for the major results and conclusions reported.\\n* Read the peer reviews (#)\\n* About eLife assessments (https://elifesciences.org/inside-elife/db24dd46)\\n\\n\\n** Introduction\\n------------------------------------------------------------\\n\\nPhenotypic evolution should be considered in the context of the whole organism, as organisms are not just collections of independent traits (Gould and Lewontin, 1979 (#c27) ). Theory indicates that stabilizing and disruptive selection on each trait, and correlated selection between trait combinations, which together define the individual “selection surface” (Phillips and Arnold, 1989 (#c59) ), will shape standing additive genetic variances of traits and covariances between traits (Arnold et al., 2001 (#c3) Jones et al., 2004 (#c34) Lande, 1980 (#c40) Svensson et al., 2021 (#c76) ), as summarized by the G matrix describing the traits’ genetic structure that is inherited between parents and offspring. This is because the phenotypic dimensions with greater additive genetic variation allow less constrained responses to directional selection and thus more rapid adaptation to novel environments or rescue from extinction (Blows and McGuigan, 2015 (#c7) Chevin et al., 2010 (#c14) Lande, 2009 (#c41)\\nSchluter, 1996 (#c68) ). Theory also suggests that de novo input of genetic covariances by pleiotropic mutations, if variable, could in the long-term of mutation-selection balance (time being scaled by the effective population size), be aligned with the orientations of the selection surface and eventually explain phenotypic divergence between populations and species (Jones et al., 2007 (#c35) 2014 (#c36) ). However, many studies of natural populations find more standing genetic variation than that expected at mutation-selection balance (Sella and Barton, 2019 (#c69) Walsh and Lynch, 2018 (#c82) ), and it is not entirely clear that the G matrix can evolve to align with the selection surface (Arnold et al., 2008 (#c4) Steppan et al., 2002 (#c73) ), in part because selection might not be constant or uniform when populations are faced with changing environments (Careau et al., 2015 (#c9) Chevin and Haller, 2014 (#c13) Gomulkiewicz and Houle, 2009 (#c26) Guzella et al., 2018 (#c28) ), in part\\nbecause all populations are finite, mutations rare, founder effects common, and drift on the G matrix likely to alter phenotypic evolution on the short-term of tens to hundreds of generations, before mutation-selection balance is reached (Mallard et al., 2022 (#c46) 2019 (#c47) Matuszewski et al., 2015 (#c49) Phillips et al., 2001 (#c58) Whitlock et al., 2002 (#c84) ).\\n\\nWhen populations are challenged in a novel environment it is possible that phenotypic plasticity, the ability of a genotypes to express alternative trait values under environmental variation, aids immediate population persistence (Ghalambor et al., 2007 (#c24) Pfennig et al., 2010 (#c56) ), but for adaptive phenotypic divergence to then occur the plastic phenotypic dimension should align with the dimension where most genetic variation is found (Draghi and Whitlock, 2012 (#c19) Gomulkiewicz and Holt, 1995 (#c25) Price et al., 2003 (#c62) Via and Lande, 1985 (#c81) ). Adaptation or rescue from extinction can be hampered if less genetic variation is available for selection in the relevant phenotypic dimensions. A recent meta-analysis of natural populations has found that phenotypic dimensions of plasticity and genetic variation are aligned (Noble et al., 2019 (#c54) ), despite great heterogeneity among the studies surveyed, suggesting that the development and physiology responsible for the\\ntraits’ expression under environmental variation reflect the distribution of pleiotropic mutational effects due to past correlated selection (Draghi and Whitlock, 2012 (#c19) Jones et al., 2014 (#c36) Morrissey, 2015 (#c50) ). Yet, several studies found that the phenotypic plasticity of ancestral populations does not always match the phenotypic directions of adaptation (Ghalambor et al., 2015 (#c23) Ho and Zhang, 2019 (#c31) Koch and Guillaume, 2020 (#c37) Mallard et al., 2020 (#c48) Sikkink et al., 2019 (#c71) ), indicating that selection is often misunderstood.\\n\\nWhile accounting for phenotypic plasticity is relatively straightforward in lab populations, or natural populations that can be transplanted between environments, the same cannot be said about understanding selection. Estimates of selection will be biased in strength or kind if unobserved traits impacting fitness are genetically correlated with the observed traits or there is correlated selection because of environmental covariances between observed and unobserved traits with fitness, both instances of “indirect” selection on the observed traits (Morrissey et al., 2010 (#c52) Rausher, 1992 (#c65) Walsh and Lynch, 2018 (#c82) ). Lande’s equation (Lande, 1979 (#c39) ), sciency picture , models trait evolution over one generation in the multivariate context sciency picture as a function of the G matrix and the directional selection gradients on each trait (β), while explicitly considering potential correlated selection between the observed traits and stabilizing/disruptive selection on each\\none of them (Lande and Arnold, 1983 (#c42) ), but might fail when unobserved traits are important. Using the Robertson secondary theorem of natural selection (Robertson, 1968 (#c66) Walsh and Lynch, 2018 (#c82) ), sciency picture , however, observed mean trait changes over one generation are accurately predicted because the responses due to selection, i.e., the selection differentials, equal the breeding value change of the trait affecting fitness and thus the additive genetic covariance of the trait with relative fitness (w), independently of unobserved traits (Morrissey and Bonnet, 2019 (#c51) Morrissey et al., 2010 (#c52) ). However, distinguishing direct from indirect selection on each trait is not possible with the Robertson equation, and further the parental trait breeding values must have no transmission bias, due for example to non-Mendelian segregation or to transgenerational environmental effects, and be fully mapped onto offspring trait breeding values (Price, 1972 (#c61) Walsh\\nand Lynch, 2018 (#c82) ).\\n\\nTo help resolve these problems, and following (Etterson and Shaw (2001) (#c20) ) and (Morrissey et al. (2012) (#c53) ) among others, (Stinchcombe et al. (2014) (#c75) ) have proposed in a single statistical framework to apply the Robertson equation in a presumed ancestral population, before phenotypic divergence, to predict the direction of trait evolution because of selection, and in a second step to apply Lande’s equation to infer the gradients of directional selection on each trait: sciency picture ; where the selection differential s, or the trait response R because of selection after one generation, is defined by the difference between the trait means for an observed ancestral population sciency picture and the expected trait means of a divergent population as predicted by the Robertson equationsciency picture . For example, if the “genetic” selection gradient during the period considered (β[g]) is not inferred, or is different from the Lande’s “phenotypic” selection gradient obtained\\nby the regression of divergent onto ancestral trait values (β), then phenotypic divergence must have been due to indirect selection. This framework is appropriate for a single generation and it is unknown if it can be applied to multiple generations and changing selection surfaces. Furthermore, as the G matrix evolves by selection, drift or mutation, the prediction of phenotypic divergence from the Robertson equation and the inference of selection with Lande’s equation likely becomes inaccurate (Phillips and McGuigan, 2006 (#c57) Shaw et al., 1995 (#c70) ), though we lack expectations of when they become so, except for models at mutation-selection balance that notably disregard drift, strong selection or reduced effective recombination between fitness loci (Arnold et al., 2001 (#c3) Lande, 1980 (#c40) Mallard et al., 2022 (#c46) 2019 (#c47) Sella and Barton, 2019 (#c69) ).\\n\\nWe here report a test of (Stinchcombe et al. (2014) (#c75) ) proposal by doing experimental evolution from standing genetic variation in the partially-outcrossing nematode Caenorhabditis elegans and following as a phenotype the worms’ locomotion behaviour. Locomotion behavior is described by six statistically independent traits of transition rates between movement state and direction (Mallard et al., 2019 (#c47) ), measured in a common scale with no need for transformation to apply selection theory (Houle et al., 2011 (#c32) ). We started by characterizing the broad-sense G matrices of a lab population in the low salt concentration environment where it had adapted to for 140 generations (Chelo and Teotónio, 2013 (#c12) Noble et al., 2017 (#c55) Teotónio et al., 2012 (#c78) ), as well as in a novel high salt concentration environment, by measuring locomotion differences between inbred lines derived from the outbreeding population. We have previously shown that the broad-sense G matrix is an\\nadequate surrogate of the true narrow-sense additive G matrix of experimental outbreeding populations (Mallard et al., 2019 (#c47) ), but see (Chelo et al., 2019 (#c11) ) and Discussion. We then challenged the lab adapted population to a gradually increasing salt concentration environment for 35 generations, followed by 15 generations in constant high salt and measured locomotion behavior in three derived replicate populations. We also before showed that derived populations adapted to the high salt conditions (Theologidis et al., 2014 (#c80) ), and thus here ask if the Robertson equation, when applied to the ancestral lab adapted population, predicts 50 generations of locomotion behavior evolution in the novel high and ancestral low salt environments, and whether direct and indirect selection have a bearing on the observed transition rate divergence in the target high salt environment, using Lande’s equation.\\n\\n\\n** Methods\\n------------------------------------------------------------\\n\\n\\n** Archiving\\n------------------------------------------------------------\\n\\nFertility data (see below) has been previously published in (Chelo et al. (2019) (#c11) ). New data, R code for analysis and modeling results (e.g. G matrix estimates) can be found in our github repository and will be archived in Dryad.org upon publication.\\n\\n\\n** Experimental populations\\n------------------------------------------------------------\\n\\nThree replicate populations were derived from an outbreeding population (named A6140; “A” for androdioecious, “6” for replicate six, “140” for generations of lab evolution), previously adapted to standard lab conditions (Noble et al., 2017 (#c55) Teotónio et al., 2012 (#c78) Theologidis et al., 2014 (#c80) ). A6140 in turn resulted from the hybridization of 16 founder strains during 33 generations followed by 140 4-day discrete and non-overlapping life-cycles at N = 10^4 census sizes at the time of reproduction (Teotónio et al., 2012 (#c78) ), and N[e] = 10^3 effective population sizes (Chelo and Teotónio, 2013 (#c12) ). C. elegans is an androdioecious roundworm, where hermaphrodites can self but only outcross when mated with males. Natural populations are depauperate of genetic diversity and males are rare due to a long history of selfing, selective sweeps and background selection (Andersen et al., 2012 (#c2) Rockman et al., 2010 (#c67) ). Under our lab conditions, however,\\npartial-outcrossing is readily maintained at frequencies between 60%-80% (Mallard et al., 2019 (#c47) Teotónio et al., 2012 (#c78) ). During domestication populations were maintained in 10x 9cm Petri dishes NGM-lite agar media containing 25mM NaCl and a lawn of E. coli HT115 that served as food from the L1 larval stage until reproduction. Periodic population samples were cryogenetically stored (Stiernagle, 1999 (#c74) ), allowing for contemporaneous comparisons between ancestral and derived populations after revival of samples (Teotónio et al., 2017 (#c79) ).\\n\\nHere we report the evolution of locomotion behavior in three replicate populations (named GA[1,2,4] populations: “G” for gradual, “A” for androdioecious, “1,2,4” for replicate number) derived from A6140. GA populations were maintained in exactly the same conditions as during domestication except that the NGM-lite media was supplemented with 8mM of NaCl at each generation for 35 generations and then kept constant at 305mM NaCl for an additional 15 generations. Details about the derivation of the GA populations can be found in (Theologidis et al. (2014) (#c80) ). In (Theologidis et al. (2014) (#c80) ) we showed, using competitions assays between ancestral and derived populations, that there was adaptation and further in (Chelo et al. (2019) (#c11) ) that there was maintenance of partial-outcrossing and heterozygosity of about 0.25 for 1 single nucleotide variant per kbp by the end of the 50 generations of evolution. Control populations were also kept in the domestication environment and the\\nevolution of locomotion behavior in these populations is described in a (Mallard et al., 2019 (#c47) ). Throughout we refer to the NGM-lite 305mM NaCl environment as the “high” salt target environment, while the domestication 25mM NaCl environment as the “low” salt environment.\\n\\n\\n** Inbred lines and fitness\\n------------------------------------------------------------\\n\\nWe derived inbred lines by selfing single hermaphrodites from the ancestor (A6140) and the three replicate populations at generation 50 (GA[1,2,4]50) for at minimum of 10 generations (Chelo et al., 2019 (#c11) ). The total number of lines obtained and phenotyped for locomotion behavior can be found in Table 1 (#tbl1) . In (Chelo et al. (2019) (#c11) ) we measured individual hermaphrodite self-fertility in high salt, a trait that here we use as a surrogate for fitness. Fertility was measured under environmental conditions that closely followed those of experimental evolution, except for density and presence of males. The log-transformed, covariate-adjusted fertility values (best linear unbiased estimates) for each inbred line were downloaded from (Chelo et al. (2019) (#c11) ), exponentiated, and divided by the mean to obtain a relative fitness measure (w).\\nTable 1:sciency picture\\n\\nNumber of measurements per population in each of three assay years. In total there were 188 lines for A6140 and 61, 61 and 42 lines for GA[1,2,4].\\n\\n\\n** Locomotion behavior\\n------------------------------------------------------------\\n\\nInbred lines were thawed from frozen stocks on 9 cm Petri plates and grown until exhaustion of food. This occurred 2-3 generations after thawing, after which individuals were washed adults removed by centrifugation, and three plates per line seeded with 1000 larvae at mixed larval stages. Samples were then maintained for one to two complete generations in the standard domestication environment. At the assay generation (generation 4-6 generations post-thaw), starvation-synchronized L1 larvae were seeded in both the low and high-salt environments. Adults were phenotyped for locomotion behaviour 48h later at their usual time of reproduction in one 9cm plate. At the beginning of each assay we measured ambient temperature and humidity in the imaging room. Given the number of lines phenotyped we repeated this protocol several times by the same experimenter, each defining a statistical “block”, usually including samples from A6140 and from one of the GA populations, over a period of three years\\n(Table 1 (#tbl1) ). In total, we phenotyped 188 lines from the A6140 population and 61,61 and 42 lines from each of the GA[1,2,4] populations, with most lines being phenotyped twice and always in separate blocks (average 1.9 in low salt, 2 in high salt).\\n\\nWe imaged adult hermaphrodites using the Multi-Worm Tracker [version 1.3.0; (Swierczek et al. (2011) (#c77) )], and followed the protocols detailed in (Mallard et al. (2019) (#c47) ) to collect the data. Each movie contains about 1000 tracks of hermaphrodites (called objects) with a mean duration of about 1 minute. Standardized to a common frame rate, we filtered and extracted the number and persistence of tracked objects per movie, and assigned movement states across consecutive frames as forward, still or backwards (assuming forward as the dominant direction of movement).\\n\\nModeling transitions rates has also been detailed in (Mallard et al. (2019) (#c47) ). Briefly, expected transition rates between forward, still and backward movement states follow a continuous time Markov process, and given the constraint that self-transition rates equal the sum of the six non-self transition rates, we considered that these non-self transition rates are independent [called q[k] for notation consistency with (Mallard et al. (2019) (#c47) )]. For estimation we used log-likehood models specified in RStan [(Stan Development Team (2018) (#c72) ), R version 3.3.2, RStan version 2.15.1], which performs Bayesian inference to calculate the posterior probability of the parameters’ distribution given the observed data.\\n\\n\\n** Phenotypic plasticity and divergence\\n------------------------------------------------------------\\n\\nWe modeled phenotypic plasticity among high-and low-salt environments in A6140 and GA[1,2,4]50 using linear mixed models. For each transition rate:\\nsciency picture\\n\\nwhere α is the overall mean, β[i] the set of environmental fixed effects accounting for temperature, humidity and density (including interactions), γ is a fixed effect accounting for mean differences between assay years, sciency picture the mean difference between our two environments, ζ ∼ 𝒩 (0, σ^2) and η ∼ 𝒩 (0, σ^2) the random effects of line identities and block effects, respectively, and finally, ∼ 𝒩 (0, σ^2) the residual error. Each measured variable was centered and standardized prior to the analysis.\\n\\nWe modeled divergence of locomotion behavior after 50 generations of evolution using two different formulations. In the first (equation 2 (#eqn2) ), we tested for a consistent divergence among replicates by considering GA[1,2,4]50 identity as a random effect. In the second (equation 3 (#eqn3) ), we further investigated individual replicate divergence from A6140.\\n\\nFor the first model:\\nsciency picture\\n\\nwith α, β[i], γ, δ, ζ, η and as defined above. θ[k] is here the mean difference between the ancestral and the evolved populations. κ ∼ N (0, σ^2) is a random effect of mean differences between our three GA[1,2,4] evolved populations.\\n\\nFor the second model:\\nsciency picture\\n\\nwhere sciency picture is now a fixed categorical effect accounting for mean differences between our populations. Note that the κ random effect does not appear in this model.\\n\\nThe significance of fixed effects were tested with Likelihood Ratio Tests (LRT, approximately χ^2 distributed), using the anova command in R with arguments being the two nested models containing or not the fixed effect being tested. Differences between A6140 and each of the GA replicates were tested using the emmeans package (Lenth, 2021 (#c43) ).\\n\\nWe define from equations 1 (#eqn1) and 2 (#eqn2) the vectors of phenotypic plasticity ΔP and of phenotypic divergence ΔD as:\\nsciency picture sciency picture\\n\\nNote that there is one ΔD for each environment. We further created distributions of ΔD and\\n\\nΔP by bootstrapping 1000 times the set of inbred lines before estimating each of the vectors. These are used to calculate the confidence intervals of Figures 3 (#fig3) , 5 (#fig5) , 6 (#fig6) , S6 (#figS6) , and S8 (#figS8) .\\n\\n\\n** G matrices\\n------------------------------------------------------------\\n\\nWe estimated G matrices separately for each of the four studied populations (A6140, GA[1,2,4]50). We present results for the A6140 population in the low and high salt environment, for GA[1,2,4]50 only in the high salt environment. The 6 transition rates q[k] were fitted as a multivariate response variable y in the model:\\nsciency picture\\n\\nhere µ is the intercept and β[i], γ, ζ, η and as defined above (equation 1 (#eqn1) ). The matrix of genetic (co)variances is then half the line (co)variance matrix (ζ[lineID]), as we have measured inbred lines we twice count genetic effects. We have elsewhere showed that selection is significant during inbreeding (Chelo et al., 2019 (#c11) ), but we have also shown that it does not on average change the mean transition rate values in low salt (Mallard et al., 2019 (#c47) ). The broad-sense G matrix as estimated here should thus be an adequate surrogate for the narrow-sense G matrix (Lynch and Walsh, 1998 (#c45) ), and see Discussion.\\n\\nModels were fit with the R package MCMCglmm (Hadfield, 2010 (#c29) ). We constructed priors as the matrix of phenotypic variances for each trait. Model convergence was verified by visual inspection of the posterior distributions and an autocorrelation below 0.05. 100,000 burn-in iterations were done with a thinning interval of 2,000 and a total of over 2 million MCMC iterations.\\n\\nWe define the main axis of genetic variation g[max] as the first eigenvector of our A6140 G-matrix, g[2−6] its subsequent eigenvectors and λ[1−6] their six eigenvalues. To describe the genetic dimensions of divergence among all the four populations (A6140 and GA[1,2,4]50), we performed spectral decomposition of the four G matrices in high salt; for details see (Aguirre et al. (2014) (#c1) ); (Morrissey and Bonnet (2019) (#c51) ). G-matrix differences in this analysis are described by orthogonal eigentensors, which in turn can be decomposed into eigenvectors with associated eigenvalues. We define the first of these eigenvectors as the genetic divergence vector e[11] as it is the phenotypic dimension encompassing most of the genetic differences between all four G matrices.\\n\\nAs discussed in (Walter et al. (2018) (#c83) ), the significance of the posterior mean variance-covariance estimate is based on the overlap between the posterior null distribution of the posterior mean with the observed posterior mean. We consider that differences between the estimated empirical distributions can be inferred when their 80% credible intervals (strickly 83%) do not overlap (Austin and Hux, 2002 (#c5) ).\\n\\n\\n** Selection\\n------------------------------------------------------------\\n\\nWe also estimated G[qw] matrices, as defined by (Stinchcombe et al. (2014) (#c75) ), with 13 traits: the six transition rates estimated in each environment (q[k]) and the relative fertility measured in the high salt environment (w). By computing G[qw] we estimate the (broad-sense) genetic covariance between transition rates and relative fertility. According to Robertson’s secondary theorem of natural selection (Robertson, 1968 (#c66) Walsh and Lynch, 2018 (#c82) ) if the broad-sense genetic covariance is the same as the narrow-sense additive genetic covariance between traits and fitness, then it will be equal to the selection differentials on each transition rate, s, and thus the responses to selection R:\\nsciency picture\\n\\nFollowing (Stinchcombe et al. (2014) (#c75) ), we then estimated the “genetic” directional selection gradients on each transition rate β[g] using Lande’s equation:\\nsciency picture\\n\\nComputation was done as described above for the G matrices, with the same parameters.\\n\\n\\n** Plasticity, genetic variances, selection and divergence\\n------------------------------------------------------------\\n\\nOur analysis relies on comparing the direction or the size/length of several vectors and scalars in multivariate space. We used the metrics introduced by (Noble et al. (2019) (#c54) ) to compare the alignment of the phenotypic dimension with most genetic variation, g[max], with phenotypic plasticity, ΔP, in A6140. The angle between g[max] and ΔP is:\\nsciency picture\\n\\nAs both g[max] and −g[max] are the first eigenvector of the G-matrix and their eigenvalue sciency picture a single (positive) scalar, Θ values between 90° and 180° were transformed so that Θ always remains between 0° and 90° (Θ = 180°-Θ, which results from using −g[max] instead of g[max] in equation 9 (#eqn9) ). The null expectation for Θ when using random vectors is then 45°.\\n\\nTo estimate the amount of genetic variance in plasticity:\\nsciency picture\\n\\nΠ being next defined as the ratio between the genetic variance along plasticity dimensions and the maximum amount of variance in any phenotypic direction (sciency picture , the first eigenvalue of the G matrix):\\nsciency picture\\n\\nΠ values are comprised between 0 (no genetic variance along the plasticity dimensions) and 1 (when plasticity contains all genetic variance). The null expectation of Π being:\\nsciency picture\\n\\nwhere sciency picture is the mean of all six eigenvalues of G, in turn the average genetic variance across any phenotypic dimensions (i.e.,sciency picture of the total genetic variance).\\n\\nWe defined other angles to compare the alignment of ancestral g[max] with the dimensions of phenotypic and genetic divergence, by replacing in equation 9 (#eqn9) ΔP with ΔD and e[11], respectively. We also computed the angle between ancestral plasticity ΔP and phenotypic divergence ΔD, and that between predicted selection responses (R/s from equation 7 (#eqn7) ) with observed divergence (ΔD) as a test of Robertson’s equation. For all metrics, we computed 80% and 95% credible intervals by randomly sampling the posterior distribution of the A6140 G matrix, the exception being the angle between plasticity and phenotypic divergence, where we used the least square estimates from equations 1 (#eqn1) and 2 (#eqn2) .\\n\\n\\n** Results\\n------------------------------------------------------------\\n\\n\\n** Locomotion behavior in the ancestral population\\n------------------------------------------------------------\\n\\nOur ancestral population (A6140) evolved for 140 generations in a defined lab environment characterized in part by low salt (25mM NaCl) in the worms’ growing media (see Methods). We found significant phenotypic plasticity for locomotion behavior between the low salt environment and a novel high salt (305mM NaCl) environment (Figure 1 (#fig1) ). Only for one of the six transition rates measured to describe locomotion behavior, the transition rate between backward and forward movement did not show plasticity (Table 2 (#tbl2) ). Three transition rates increased (still to/from forward and backward to still) and two decreased (still/forward to backward) in high salt when compared with low salt.\\nFigure 1:sciency picture\\n\\nPhenotypic plasticity in the ancestral population A6140. Grey dots indicate the values estimated for each inbred line in the low and high salt environments for each of the transition rates between activity and movement direction. F stands for “forward”, B for “backward” and S for “still”, left to right order indicating movement direction. Orange shows the mean least-square estimates of the transition rates among inbred lines in each environment, with bars the 95% confidence intervals (see Methods). Mean differences between environments are indicated by a line, with asterisks showing plasticity (LRT χ^2, P-value <0.001; Table 1 (#tbl1) ).\\nTable 2:sciency picture\\n\\nPhenotypic plasticity in the ancestral population\\n\\nWe next partitioned the phenotypic (co)variances of our six transition rates among the inbred lines of A6140 into genetic and error (co)variances in each salt environment. We find that the structure of the two G matrices is quite similar (Figure 2 (#fig2) ). First, there is no detectable difference in the total genetic variance of the G matrices (Figure 2A (#fig2) ). Second, in both environments, locomotion behavior is modular (Figure 2B (#fig2) ). Transition rates from still to forward or backward, i.e. leaving the still state, are negatively correlated with the remaining transition rates and these positively correlated with each other. Third, eigen decomposition of the G matrix in low salt shows that it is rounder than that of high salt, but differences are not important (Figure 2C (#fig2) ). The first eigenvector dimension (g[max]) encompasses most genetic variation in both environments, and they are aligned as the angle between them is small (mean ± 95 CI: 12.6^°[4.4 − 21.6]).\\nFigure 2:sciency picture\\n\\nG-matrix of the ancestral population A6140 measured in low and high salt environments. A. Total genetic variance in each environment (trace of the G matrices), blue (red) for low (high) salt environments. B. Bottom six entries indicate the diagonal estimates the genetic variances of transition rates, top 15 entries indicate the off-diagonal estimates of genetic covariances between transition rates. Blue (red) indicate estimates in low (high) salt, with colored intervals and bars showing respectively 80% and 95% credible intervals of the posterior distribution, dots the mean of the posterior (see Methods). In Supplementary Figure S1, we show that most (co)variance estimates, in both environments, are different from those expected just with sampling effects. C. Eigenvalues estimates of the six eigenvectors of the G matrices, blue (red) for low (high) salt. Dot and bars indicate the mean, 80% and 95% credible intervals of the posterior distributions. Following (Morrissey and Bonnet (2019)\\n(#c51) ), the two phenotypic dimensions with most genetic variation, g[max] and g[2], in low salt, but only g[max] in high salt, are different from null expectations in both environments (not shown).\\nFigure 3:sciency picture\\n\\nPlasticity and g[max] in the ancestral population. A. Projection of the amount of genetic variance along the phenotypic plasticity vector ΔP. Bars indicate for both low and high salt environments the estimated projections (Π), with dots and error bars the mean, 80% and 95% credible intervals (see Methods). Lower bars show the null expectation if the total genetic variance was equally distributed along all the phenotypic dimensions (round G-matrix). B. The angle between ΔP and g[max], Θ, in both low and high salt is higher than the random expectation of 45°C (dashed line, see Methods). Bars indicate 80% and 95% credible intervals.\\n\\nPhenotypic plasticity (ΔP) is not aligned with g[max] in the high salt environment, because the amount of genetic variance along phenotypic plasticity is not different than expected by chance (Figure 3A (#fig3) , see Methods), and because the angle between the two phenotypic dimensions of plasticity and g[max] is larger than expected (Figure 3B (#fig3) ).\\n\\n\\n** Evolution of locomotion behavior in changing salt environments\\n------------------------------------------------------------\\n\\nThree replicate populations from A6140 were exposed to a gradually increasing salt concentration for 35 generations followed by 15 generations in the target high salt environment (GA[1,2,4] populations, see Methods). In the high salt environment, after 50 generations, we find that for each of the transition rates there was at least one replicate population different from the ancestor (Table 3 (#tbl3) ). Among replicates, significant phenotypic divergence for four out of the six transition rates is also observed (Figure 4 (#fig4) , Table 4 (#tbl4) ). Phenotypic divergence was not limited by the amount of genetic variance, as the backward to still and forward to still transition rates diverged while showing the lowest genetic variance in the ancestral population (Figure 2 (#fig2) ). In the low salt environment, there was phenotypic divergence for 3 out of the 6 transition rates (Supplementary Figure S2 (#figS2) , Tables 3 (#tbl3) and 4 (#tbl4) ).\\nTable 3:sciency picture\\n\\nDivergence of each GA population from the ancestral population\\nFigure 4:sciency picture\\n\\nExperimental evolution of locomotion behavior. Small colored dots show the estimated transition rates in high salt for each line from the ancestral population A6140 (grey) and three replicate GA[1,2,4] populations at generation 50 (red). Least square estimates of the mean and 95% confidence intervals are shown in circles and error bars. Divergence between ancestral and the 3 replicate populations is shown by asterisks (LRT χ^2, P-value <0.05 *, <0.01 **, <0.001 ***; Table 4 (#tbl4) ). Divergence per replicate population can be found in Table 3 (#tbl3) . Results obtained in the low salt environment can be found in Supplementary Figure S2, and analysis in Tables 3 (#tbl3) and 4 (#tbl4) .\\nFigure 5:sciency picture\\n\\nAncestral g[max] with phenotypic and genetic divergence in high salt. The among replicate GA populations angle between ancestral g[max] (Figure 2C) and phenotypic divergence ΔD (equation 2 (#eqn2) ). Similarly the angle between phenotypic divergence ΔD and genetic divergence (e[11], Supplementary Figure S4 (#figS4) , and between g[max] and e[11]. All bars indicate with dots and error the mean, 80% and 95% credible intervals obtained by sampling the posterior distribution estimates of the A6140 G matrix (see Methods). The null expectation of non-alignment between vectors is 45° (see Methods), thus the dimension encompassing most genetic variation in the ancestral population aligns with both phenotypic and genetic divergence observed after evolution to high salt.\\nFigure 6:sciency picture\\n\\nPredicted versus observed phenotypic divergence. A. Shown are the ancestral genetic covariances between transition rates in low (blue) and high (red) salt environments with relative fertility in high salt (Robertson’s selection differentials s or selection responses R, see equation 7 (#eqn7) ). Genetic variance for fitness in high salt is also important (bottom bar). B. Shows selection differentials s (from panel A.) against the observed phenotypic divergence ΔD (equation 2 (#eqn2) , from Figure 4 (#fig4) and Supplementary Figure S2 (#figS2) ). While in high salt the direction of divergence for all six transition rates are well predicted, because they fall within the identity line, in low salt the direction of divergence are well predicted for only two transition rates (dashed lines showing no predicted divergence). C. from panel B. we plot the angles between expected and observed phenotypic divergence vectors. For all panels, dots and error bars indicate the mean and the 80% and 95%\\ncredible intervals (see Methods). See Supplementary Figure S8 (#figS8) for the predicted versus observed magnitude of phenotypic divergence.\\nTable 4:sciency picture\\n\\nDivergence among GA populations from the ancestral population\\n\\nWe next estimated the G matrices of derived populations to find about the main phenotypic dimensions of genetic divergence after 50 generations. After 50 generations of evolution there was an overall reduction in genetic (co)variances (Supplementary Figure S3 (#figS3) ). The three replicate GA[1,2,4] populations mostly diverged from the ancestral population along only one dimension, as defined by the first eigenvector of the first eigentensor measuring the genetic differences among all populations (called here e[11], see Methods; Supplementary Figures S4 (#figS4) and S5 (#figS5) ).\\n\\nThe phenotypic dimension which contains most genetic variation in the ancestral A6140 population (g[max]) aligns with the dimension of phenotypic divergence (ΔD) in the the target high salt environment, as the angle between both vectors is small (Figure 5 (#fig5) ). There was consistent parallel genetic divergence of the three replicate populations because the main dimension of genetic divergence (e[11]) between them and the ancestor also aligns with the g[max] of the ancestor. As a consequence, phenotypic divergence (ΔD) and genetic divergence (e[11]) follow similar directions. As expected from the analysis in Figure 3 (#fig3) , phenotypic divergence did not follow ancestral phenotypic plasticity (Supplementary Figure S6 (#figS6) ).\\n\\n\\n** Selection and locomotion behavior divergence\\n------------------------------------------------------------\\n\\nRobertson’s selection differentials could predict phenotypic divergence in the target high salt because the are defined as the genetic covariances between traits and relative fitness (see Introduction). These genetic covariances were jointly estimated with the matrix G[qw], combining the inbred line transition rates and relative fertility means for the ancestral population (see Methods). We assume that fertility is a good proxy for fitness.\\n\\nThe G matrix presented above is robust to the G[qw] matrix estimation (Supplementary Figure S7 (#figS7) ). Transition rate covariances with fertility, for example, reflect the modularity found in the G-matrix (Figure 2 (#fig2) ), as they show signed covariances with fertility similar as those between each other. In high salt, the six transition rate covariances with fertility are different from zero, while in low salt they are not (Figure 6A (#fig6) ). Fitness variance in the ancestral population at the high salt environment is high, unlike in the low salt environment (Mallard et al., 2019 (#c47) ), confirming that the domestication to the low salt environment and that the high salt environment is a “stressful” environment (Figure 6A (#fig6) ).\\n\\nFor all transition rates in high salt, Robertson’s expected responses to selection (R) match well with the observed phenotypic divergence (ΔD) as shown in Figure 6B (#fig6) . We further computed the angles between the predicted and observed phenotypic divergence vectors and also find a good match between them (Figure 6C (#fig6) ). But while in high salt the direction of phenotypic divergence is predicted for all 6 transition rates, its magnitude was not (Supplementary Figure S8 (#figS8) ): across all populations, observed divergence is only on average 1.3 times the expected per-generation divergence. In the low salt environment predictions for the direction of phenotypic divergence degenerate (Figure 6BC (#fig6) ).\\n\\nDirect selection on transition rates, as measured by the genetic directional selection gradients (β[g]), were computed as the inverse of the ancestral G-matrix obtained from the G[qw] matrix and the vector of selection differentials (s). We find that β[g] are not different from zero, except perhaps for the transition rate between still and backward where it may be positive (Figure 7 (#fig7) ). From the G[qw] modeling we also obtained the vector of selection differentials between transition rates in low salt and fertility in high salt. Unsurprisingly, β[g] on low salt transition rates are not different from zero (not shown).\\nFigure 7:sciency picture\\n\\nSelection gradients on transition rates. Directional selection gradients on transition rates in high salt are show following equation 8 (#eqn8) , Lande’s retrospective equation, as the product of the inverse of ancestral G matrix in high salt (Figure 2 (#fig2) ) with Robertson’s selection differentials (equation 7 (#eqn7) , Figure 6A (#fig6) ). Dots and error bars show the mean and 80% and 95% credible intervals obtained by sampling the posterior distribution of the ancestral G matrix (see Methods). Similar results are found when the ancestral G matrix in low salt are sampled (not shown).\\n\\n\\n** Discussion\\n------------------------------------------------------------\\n\\nWe did experimental evolution with partially-outcrossing C. elegans populations harboring standing genetic variation in a gradually increasing salt environment for 35 generations followed by 15 generations in constant high salt. We have previously shown that these partial-outcrossing populations exposed to changing salt environments purged deleterious recessives alleles while maintaining genetic diversity during the 50 generations of evolution, either due to associative overdominance or true overdominance (Chelo et al., 2019 (#c11) ). The derived populations adapted to the high salt conditions (Theologidis et al., 2014 (#c80) ), and thus here we could ask: 1) if plasticity in the transition rates between movement and direction of locomotion behavior were aligned with the phenotypic dimension where more genetic variation is found in the ancestral population and, as a consequence, help explain adaptive phenotypic divergence in high salt; 2) whether or not 50 generations of phenotypic\\ndivergence could be predicted from the ancestral genetic covariances of transition rates with fitness in high salt, using Robertson’s secondary theorem of natural selection; and 3) if direct and/or indirect selection on transitions was responsible for phenotypic divergence, using Lande’s equation with Robertson’s selection differentials. For an analysis of selection on locomotion behavior, and the evolution of the G matrix, in a constant low salt environment we refer the reader to (Mallard et al. (2019) (#c47) ).\\n\\nFifty generations of experimental evolution in changing salt conditions led to phenotypic divergence in the target high salt environment for at least 5 out of the 6 transition rates, and in the low salt environment for 3 out of the 6 transitions rates, although there was heterogeneity between replicate populations. In the ancestral population, and in both salt environments, transition rates between still and forward (SF) and still and backwards (SB) form different behavioral modules as these traits show positive genetic covariances with each other, and negative genetic covariances with all other transition rates. Gene expression in our populations is restricted to being active (leaving the still state) and not the direction of movement. In itself this observation is interesting because it explains why phenotypic divergence in SF and SB is of different sign than that of the other 4 transition rates, and because it also explains why the phenotypic dimension encompassing most genetic variation\\nof the ancestral population aligns well with the main dimensions of both phenotypic divergence and genetic divergence among all populations in high salt. However, many studies of neuronal, muscular or metabolic function using mutants have suggested that engaging in activity can be decoupled from the direction of movement (De Bono and Maricq, 2005 (#c17) Zhen and Samuel, 2015 (#c85) ) and elsewhere we have described little mutational pleiotropy for transition rates for two strains founders of our populations (Mallard et al., 2022 (#c46) ). The evolution of genetic covariances between transition rates in our populations should therefore result mostly from the frequency dynamics of relevant alleles in linkage disequilibrium (Lande, 1980 (#c40) Phillips and McGuigan, 2006 (#c57) ). See (Mallard et al. (2022) (#c46) ) for a discussion on the role of pleiotropy and linkage disequilibrium in some of our populations.\\n\\nSeveral authors have suggested that ancestral phenotypic plasticity will be aligned with the phenotypic dimensions with more standing genetic variation, or mutational input, and thus facilitate adaptation if past correlated selection between traits led to the evolution of plasticity in particular dimensions of trait combinations (Arnold et al., 2008 (#c4) Draghi and Whitlock, 2012 (#c19) Jones et al., 2007 (#c35) 2014 (#c36) ). Empirical tests of this idea are few. In a meta-analysis of several studies in natural populations phenotypic plasticity generally matched phenotypic dimensions with more genetic variation but did not depend on the degree of environmental stress and thus, presumably, on selection (Noble et al., 2019 (#c54) ). More explicitly, (Johansson et al. (2021) (#c33) ) have showed that phenotypic plasticity for life-history and morphological trait responses to changes in photoperiod in damselflies was aligned with phenotypic dimensions with more genetic variation but only in\\npopulations facing selection because of photoperiod seasonality, as expected from theory. In our study, the G matrix is very similar in the low and high salt environments for the ancestral population, and the phenotypic dimension with more genetic variation in high salt neither aligns well with that of phenotypic plasticity nor the phenotypic dimension where plasticity is found contains much genetic variation. It is thus not surprising that the mismatch between plasticity and genetics does not impede or facilitate adaptive phenotypic divergence.\\n\\nOne of the main results of our study is that the direction of phenotypic divergence for at least 5 out of 6 transition rates in high salt is predicted using Robertson’s equation. The direction of divergence in the transition rate between still and forward is not predicted, even if it has a detectable genetic covariance with fitness because of replicate population heterogeneity and perhaps a founder sampling effect when establishing them. Yet, these are remarkable findings, especially when considering that the individual selection surface likely changed during the first 35 generations of the experiment, and that the G matrix in high salt evolved during the 50 generations, by drift and selection, cf. (Guzella et al., 2018 (#c28) ), mostly through a reduction in genetic variance across all phenotypic dimensions. The selection surface probably changed during evolution but only in strength, because only one environmental factor was employed and the nature of change across generations was linear\\non the mean environmental value, not the variance (Chevin et al., 2015 (#c15) Proulx and Teotónio, 2017 (#c64) ). That the Robertson equation predicts phenotypic divergence is also remarkable because fertility is only a component of fitness. Indeed, we previously were unable to measure increased fertility in high salt (Chelo et al., 2019 (#c11) ), despite obvious adaptation – as measured with competition assays between ancestral and derived populations (Teotónio et al., 2017 (#c79) ), see Figure 4d (#fig4) in (Theologidis et al. (2014) (#c80) ) –. Our analysis demonstrates that even if we estimated broad-sense genetic covariances between transition rates and fertility they are nonetheless adequate surrogates of the additive genetic covariances of outbreeding populations, as required by Robertson’s equation.\\n\\nBut while characterization of genetic covariances between transition rates and fertility in high salt in the ancestral population is sufficient to predict the direction of phenotypic evolution in the target high salt environment, we cannot predict with much accuracy the direction of phenotypic evolution in the (ancestral) low salt environment, and hence we cannot predict the evolution of phenotypic plasticity. The simplest explanation for this finding is that the ancestral population contained low and significant levels of genetic covariances between transition rates in low salt and fitness in high salt, but that these covariances were undetectable given sample sizes we have. In low salt, transition rates are effectively neutral and could have only diverged by being genetically correlated with high salt traits under selection. Similarly, in (Mallard et al. (2019) (#c47) ) we have described that phenotypic stasis of locomotion behaviour in populations facing constant low salt results from\\neffective stabilizing selection over a large phenotypic space after adaptation, cf. (Haller and Hendry, 2014 (#c30) ), and that after adaptation, Robertson’s equation of little use to predict evolution over local phenotypic space because in this local space genetic covariances between transition rates and fitness are small and mostly evolve by drift (Mallard et al., 2019 (#c47) ).\\n\\nThe Robertson equation has been applied to a few natural populations, those where time series of trait and fitness values are concurrently obtained with pedigrees such that trait breeding values can be estimated. (Biquet et al. (2022) (#c6) ) provide an exemplary study of a blue tit population that has been followed for more than 40 years, and in which egg laying has changed to earlier and earlier spring dates, presumably because of climate change. Despite significant heritability for egg laying date and selection on it, however, modeling the expected breeding values for laying date did not reveal any temporal trend consistent with a general lack of genetic covariance between laying date and fitness during the whole period followed. There was thus no evolution, meaning no genetic divergence for laying date, which the authors can attribute to the stochastic nature of individual development to maturity. Using a similar approach, (Bonnet et al. (2017) (#c8) ) have found on the contrary that\\nevolution towards earlier dates of parturition in a red deer population (also over 40 years and also presumably because of climate change) could be predicted and were consistent with the estimated change of parturition date breeding values. What our study suggests is that for organisms where pedigrees are difficult to obtain, and thus trait breeding values difficult to estimate, such as small organisms that cannot be marked and those with a rapid or complex life-cycle, for example, one may be able to measure the genetic covariance of the traits of interest with fitness in an ancestral population, to predict the direction of adaptive future phenotypic divergence on the short-term of a few tens of generations.\\n\\nA second major finding of our study is that we were unable to infer direct selection on transition rates, despite phenotypic divergence in a majority of them, as directional selection gradient estimates were not obviously different from zero. There are two explanations for this result: either unobserved traits under direct selection are genetically correlated with observed ones or there is correlated selection between observed and unobserved traits because of unknown environmental covariances of them with fitness. A recent study in wild salmon as shown that selection due to human harvesting of a prey species (for feeding cultured salmon) explained divergence for early maturity and small body sizes, despite selection for increased body size at maturity because of fishing (Czorlich et al., 2022 (#c16) ). In an example privileging the second explanation, (Kruuk et al. (2002) (#c38) ) have found that despite heritability and directional selection for antler size in red deer there was phenotypic\\nstasis due to nutritional state covariation and antler size. We find it unlikely, however, that a similar situation to (Kruuk et al. (2002) (#c38) ) explains our results. This is because worms’ locomotion behaviour were measured in ancestral and derived populations in “common garden” assays, after reviving population samples from storage and culturing them under similar environmental conditions for 4-6 generations. Perhaps more importantly, we have also reported that transgenerational environmental effects on the viability of individuals exposed to high salt do not carry over for more than three generations, and are in any case small when compared to the fitness effects of within-generation high salt exposure (Proulx et al., 2019 (#c63) ). Expression of trait values specific to changing salt environments could be at play, but this would require a genetic basis for individuals to detect and anticipate the higher salt levels of future generations, despite they themselves developing and\\ngrowing under lower and constant salt levels as was the case during experimental evolution (Dey et al., 2016 (#c18) Proulx and Teotónio, 2017 (#c64) ).\\n\\nWe favor the interpretation that indirect selection on transition rates is due to them being genetically correlated with unobserved traits under direct selection. One candidate trait to be under direct selection is body size at the time of reproduction. In a changing salt environment increased body size could be favored for example because the accumulation of osmolites will lower cuticle tension and enhance individual survival. Body size and locomotion behavior in C. elegans are further known to be physiologically regulated in concert not only by the amount of food eaten, and how much energy is spent by growing, foraging, mating or reproducing, but also by the perception of stressful environments (Fujiwara et al., 2015 (#c21) 2002 (#c22) ). The software tracker that we used to obtain locomotion behavior data also contains information about body size (Noble et al., 2017 (#c55) Swierczek et al., 2011 (#c77) ). Estimates of the genetic covariance between body size and fertility in the\\nancestral population suggest an expected response to selection in high salt of 0.2, which is similar to the observed body size change after 50 generations of evolution and, coincidentally, a selection gradient of β[g] = 0.2 (−0.03-0.46, 95% CI). We also find significant genetic covariances between all transition rates and body size (not shown). Many other traits can be implicated, however, for example developmental time, because hermaphrodites engaged in selfing tend to more rapidly resume activity when harassed by males than when self-sperm depleted (Chasnov et al., 2007 (#c10) Lipton et al., 2004 (#c44) ) and delayed maturity favors selfing in this protandrous nematode (Poullet et al., 2016 (#c60) Theologidis et al., 2014 (#c80) ). Only a more detailed investigation can shed light on the complexity of the selection surface in the high salt environment. Our analysis suggests, however, that indirect selection led to the divergence of locomotion behavior in part because of important genetic\\ncovariances between body size and transition rates.\\n\\nIn our experimental evolution model, ancestral plasticity neither hinders nor facilitates phenotypic divergence of locomotion behavior. The direction of phenotypic divergence in the target environment can be predicted from the ancestral genetic covariances of component traits of locomotion behavior with fitness, even if experimental evolution took place in a gradually changing environment until reaching the target environment, for multiple generations, and there was a large reduction of genetic variation affecting locomotion behaviour. Indirect selection seems to be responsible for the phenotypic divergence of locomotion behavior. Together, these findings indicate that selection theory can be used to predict the direction of short-term adaptive phenotypic evolution.\\n\\n\\n** References\\n------------------------------------------------------------\\n*\\n1. Aguirre J. D.\\n2. Hine E.\\n3. McGuigan K.\\n4. Blows M. W.\\n2014Comparing g: multivariate analysis of genetic variation in multiple populations112:21–9\\n*\\n1. Andersen E. C.\\n2. Gerke J. P.\\n3. Shapiro J. A.\\n4. Crissman J. R.\\n5. Ghosh R.\\n6. Bloom J. S.\\n7. Felix M. A.\\n8. Kruglyak L.\\n2012Chromosome-scale selective sweeps shape caenorhabditis elegans genomic diversity44:285–90\\n*\\n1. Arnold S.\\n2. Pfender M.\\n3. Jones A. G.\\n2001The adaptive landscape as a conceptual bidge between micro and macroevolutionGenetica 112:9–32\\n*\\n1. Arnold S. J.\\n2. Burger R.\\n3. Hohenlohe P. A.\\n4. Ajie B. C.\\n5. Jones A. G.\\n2008Understanding the evolution and stability of the g-matrix62:2451–61\\n*\\n1. Austin P. C.\\n2. Hux J. E.\\n2002A brief note on overlapping confidence intervals36:194–195\\n*\\n1. Biquet J.\\n2. Bonamour S.\\n3. de Villemereuil P.\\n4. de Franceschi C.\\n5. Teplitsky C.\\n2022Phenotypic plasticity drives phenological changes in a mediterranean blue tit population35:347–359\\n*\\n1. Blows M. W.\\n2. McGuigan K.\\n2015The distribution of genetic variance across phenotypic space and the response to selection24:2056–2072\\n*\\n1. Bonnet T.\\n2. Wandeler P.\\n3. Camenisch G.\\n4. Postma E.\\n2017Bigger is fitter? quantitative genetic decomposition of selection reveals an adaptive evolutionary decline of body mass in a wild rodent population15:\\n*\\n1. Careau V.\\n2. Wolak M. E.\\n3. Carter P. A.\\n4. Garland T. J.\\n2015Evolution of the additive genetic variance-covariance matrix under continuous directional selection on a complex behavioural phenotype282:\\n*\\n1. Chasnov J. R.\\n2. So W. K.\\n3. Chan C. M.\\n4. Chow K. L.\\n2007The species, sex, and stage specificity of a caenorhabditis sex pheromone104:6730–5\\n*\\n1. Chelo I. M.\\n2. Afonso B.\\n3. Carvalho S.\\n4. Theologidis I.\\n5. Goy C.\\n6. Pino-Querido A.\\n7. Proulx S.\\n8. Teotónio H.\\n2019Partial selfing can reduce genetic loads while maintaining diversity during evolutionG3 (Bethesda) 9:2811–2821\\n*\\n1. Chelo I. M.\\n2. Teotónio H.\\n2013The opportunity for balancing selection in experimental populations of caenorhabditis elegans67:142–56\\n*\\n1. Chevin L. M.\\n2. Haller B. C.\\n2014The temporal distribution of directional gradients under selection for an optimum68:3381–94\\n*\\n1. Chevin L. M.\\n2. Lande R.\\n3. Mace G. M.\\n2010Adaptation, plasticity, and extinction in a changing environment: towards a predictive theory8:\\n*\\n1. Chevin L. M.\\n2. Visser M. E.\\n3. Tufto J.\\n2015Estimating the variation, autocorrelation, and environmental sensitivity of phenotypic selection69:2319–32\\n*\\n1. Czorlich Y.\\n2. Aykanat T.\\n3. Erkinaro J.\\n4. Orell P.\\n5. Primmer C. R.\\n2022Rapid evolution in salmon life history induced by direct and indirect effects of fishing376:420–423\\n*\\n1. De Bono M.\\n2. Maricq A. V.\\n2005Neuronal substrates of complex behavior in c. elegansAnn Rev Neurosci 28:451–501\\n*\\n1. Dey S.\\n2. Proulx S.\\n3. Teotónio H.\\n2016Adaptation to temporally fluctuating environments by the evolution of maternal effects14:\\n*\\n1. Draghi J. A.\\n2. Whitlock M. C.\\n2012Phenotypic plasticity facilitates mutational variance, genetic variance, and evolvability along the major axis of environmental variation66:2891–902\\n*\\n1. Etterson J. R.\\n2. Shaw R. G.\\n2001Constraint to adaptive evolution in response to global warming294:151–4\\n*\\n1. Fujiwara M.\\n2. Hino T.\\n3. Miyamoto R.\\n4. Inada H.\\n5. Mori I.\\n6. Koga M.\\n7. Miyahara K.\\n8. Ohshima Y.\\n9. Ishihara T.\\n2015The importance of cgmp signaling in sensory cilia for body size regulation in caenorhabditis elegans201:1497–510\\n*\\n1. Fujiwara M.\\n2. Sengupta P.\\n3. McIntire S. L.\\n2002Regulation of body size and behavioral state of c. elegans by sensory perception and the egl-4 cgmp-dependent protein kinase36:1091–102\\n*\\n1. Ghalambor C. K.\\n2. Hoke K. L.\\n3. Ruell E. W.\\n4. Fischer E. K.\\n5. Reznick D. N.\\n6. Hughes K. A.\\n2015Non-adaptive plasticity potentiates rapid adaptive evolution of gene expression in nature\\n*\\n1. Ghalambor C. K.\\n2. McKay J. K.\\n3. Carroll S. P.\\n4. Reznick D. N.\\n2007Adaptive versus nonadaptive phenotypic plasticity and the potential for contemporary adaptation in new environments21:394–407\\n*\\n1. Gomulkiewicz R.\\n2. Holt R.\\n1995When does evolution by natural selection prevent extinction?Evolution 49:201–207\\n*\\n1. Gomulkiewicz R.\\n2. Houle D.\\n2009Demographic and genetic constraints on evolution174:–29\\n*\\n1. Gould S. J.\\n2. Lewontin R. C.\\n1979The spandrels of san marco and the panglossian paradigm: a critique of the adaptationist programme205:581–98\\n*\\n1. Guzella T.\\n2. Dey S.\\n3. Chelo I. M.\\n4. Pino-Querido A.\\n5. Pereira V.\\n6. Proulx S.\\n7. Teotónio H.\\n2018Slower environmental change hinders adaptation from standing genetic variationPLoS Genet 14:\\n*\\n1. Hadfield J.\\n2010Mcmc methods for multi-response generalized linear mixed models: The mcmcglmm r package33:1–22\\n*\\n1. Haller B. C.\\n2. Hendry A. P.\\n2014Solving the paradox of stasis: squashed stabilizing selection and the limits of detection68:483–500\\n*\\n1. Ho W.-C.\\n2. Zhang J.\\n2019Genetic gene expression changes during environmental adaptations tend to reverse plastic changes even after the correction for statistical nonindependence36:604–612\\n*\\n1. Houle D.\\n2. Pelabon C.\\n3. Wagner G.\\n4. Hansen T.\\n2011Measurement and meaning in biology86:3–34\\n*\\n1. Johansson F.\\n2. Watts P. C.\\n3. Sniegula S.\\n4. Berger D.\\n2021Natural selection mediated by seasonal time constraints increases the alignment between evolvability and developmental plasticity75:464–475\\n*\\n1. Jones A. G.\\n2. Arnold S.\\n3. Burger R.\\n2004Evolution and stability of the g matrix in an adaptive landscape with a moving optimumEvolution 58:1639–1654\\n*\\n1. Jones A. G.\\n2. Arnold S. J.\\n3. Bürger R.\\n2007The mutation matrix and the evolution of evolvability61:727–745\\n*\\n1. Jones A. G.\\n2. Burger R.\\n3. Arnold S. J.\\n2014Epistasis and natural selection shape the mutational architecture of complex traitsNat Commun 5:3709\\n*\\n1. Koch E. L.\\n2. Guillaume F.\\n2020Restoring ancestral phenotypes is a general pattern in gene expression evolution during adaptation to new environments in tribolium castaneum29:3938–3953\\n*\\n1. Kruuk L.\\n2. Slate J.\\n3. Pemberton J.\\n4. Brotherstone S.\\n5. Guiness F.\\n6. Clutton-Brock T.\\n2002Antler size in red deer: heritability and selection but no evolutionEvolution 56:1683–1685\\n*\\n1. Lande R.\\n1979Quantitative genetic analysis of multivariate evolution, applied to brain: body size allometryEvolution 33:402–416\\n*\\n1. Lande R.\\n1980The genetic covariance between characters maintained by pleiotropic mutations94:203–15\\n*\\n1. Lande R.\\n2009Adaptation to an extraordinary environment by evolution of phenotypic plasticity and genetic assimilation22:1435–46\\n*\\n1. Lande R.\\n2. Arnold S. J.\\n1983On the measurement of selection on correlated charactersEvolution 37:1210–1226\\n*\\n1. Lenth R. V.\\n2021emmeans: Estimated Marginal Means, aka Least-Squares Means\\n*\\n1. Lipton J.\\n2. Kleemann G.\\n3. Ghosh R.\\n4. Lints R.\\n5. Emmons S. W.\\n2004Mate searching in caenorhabditis elegans: a genetic model for sex drive in a simple invertebrate24:7427–34\\n*\\n1. Lynch M.\\n2. Walsh B.\\n1998Genetics and Analysis of Quantitative Traits\\n*\\n1. Mallard F.\\n2. Noble L.\\n3. Baer C.\\n4. Teotónio H.\\n2022Variation in mutational (co)variances\\n*\\n1. Mallard F.\\n2. Noble L.\\n3. Guzella T.\\n4. Afonso B.\\n5. Baer C. F.\\n6. Teotónio H.\\n2019Phenotypic stasis with genetic divergence778282\\n*\\n1. Mallard F.\\n2. Nolte V.\\n3. Schlotterer C.\\n2020The evolution of phenotypic plasticity in response to temperature stress12:2429–2440\\n*\\n1. Matuszewski S.\\n2. Hermisson J.\\n3. Kopp M.\\n2015Catch me if you can: adaptation from standing genetic variation to a moving phenotypic optimumGenetics 200:1255–1274\\n*\\n1. Morrissey M. B.\\n2015Evolutionary quantitative genetics of nonlinear developmental systems69:2050–66\\n*\\n1. Morrissey M. B.\\n2. Bonnet T.\\n2019Analogues of the fundamental and secondary theorems of selection, assuming a log-normal distribution of expected fitness110:396–402\\n*\\n1. Morrissey M. B.\\n2. Kruuk L. E.\\n3. Wilson A. J.\\n2010The danger of applying the breeder’s equation in observational studies of natural populations23:2277–88\\n*\\n1. Morrissey M. B.\\n2. Parker D. J.\\n3. Korsten P.\\n4. Pemberton J. M.\\n5. Kruuk L. E.\\n6. Wilson A. J.\\n2012The prediction of adaptive evolution: empirical application of the secondary theorem of selection and comparison with the breeder’s equation66:2399–2410\\n*\\n1. Noble D. W.\\n2. Radersma R.\\n3. Uller T.\\n2019Plastic responses to novel environments are biased towards phenotype dimensions with high additive genetic variation116:13452–13461\\n*\\n1. Noble L. M.\\n2. Chelo I.\\n3. Guzella T.\\n4. Afonso B.\\n5. Riccardi D. D.\\n6. Ammerman P.\\n7. Dayarian A.\\n8. Carvalho S.\\n9. Crist A.\\n10. Pino-Querido A.\\n11. Shraiman B.\\n12. Rockman M. V.\\n13. Teotónio H.\\n2017Polygenicity and epistasis underlie fitness-proximal traits in the caenorhabditis elegans multiparental experimental evolution (cemee) panel207:1663–1685\\n*\\n1. Pfennig D. W.\\n2. Wund M. A.\\n3. Snell-Rood E. C.\\n4. Cruickshank T.\\n5. Schlichting C. D.\\n6. Moczek A. P.\\n2010Phenotypic plasticity’s impacts on diversification and speciation25:459–467\\n*\\n1. Phillips P.\\n2. McGuigan K.\\n2006Evolution of Genetic Variance-Covariance Structure\\n*\\n1. Phillips P.\\n2. Whitlock M. C.\\n3. Fowler G. R.\\n2001Inbreeding changes the shape of the genetic covariance matrix in drosophila melanogasterGenetics 158:1137–1145\\n*\\n1. Phillips P. C.\\n2. Arnold S. J.\\n1989Visualizing multivariate selection43:1209–1222\\n*\\n1. Poullet N.\\n2. Vielle A.\\n3. Gimond C.\\n4. Carvalho S.\\n5. Teotónio H.\\n6. Braendle C.\\n2016Complex heterochrony underlies the evolution of caenorhabditis elegans hermaphrodite sex allocationEvolution 30:2357–2369\\n*\\n1. Price G.\\n1972Fisher’s ‘fundamental theorem’ made clear36:129–140\\n*\\n1. Price T. D.\\n2. Qvarnstrom A.\\n3. Irwin D. E.\\n2003The role of phenotypic plasticity in driving genetic evolution270:1433–40\\n*\\n1. Proulx S.\\n2. Dey S.\\n3. Guzella T.\\n4. Teotónio H.\\n2019How differing modes of non-genetic inheritance affect population viability in fluctuating environmentshttps://doi.org/10.1101/506865\\n*\\n1. Proulx S.\\n2. Teotónio H.\\n2017What kind of maternal effects are selected for in fluctuating environments?189:\\n*\\n1. Rausher M. D.\\n1992The measurement of selection on quantitative traits: biases due to environmental covariances between traits and fitness46:616–626\\n*\\n1. Robertson A.\\n1968The spectrum of genetic variation5–16\\n*\\n1. Rockman M. V.\\n2. Skrovanek S. S.\\n3. Kruglyak L.\\n2010Selection at linked sites shapes heritable phenotypic variation in c. elegans330:372–6\\n*\\n1. Schluter D.\\n1996Adaptive radiaation along genetic lines of least resistance50:1766–1774\\n*\\n1. Sella G.\\n2. Barton N.\\n2019Thinking about the evolution of complex traits in the era of genome-wide association studiesAnnual Review of Genomics and Human Genetics 20:461–493\\n*\\n1. Shaw F.\\n2. Shaw R. G.\\n3. Wilkinson G.\\n4. Turelli M.\\n1995Changes in genetic variances and covariances: G whiz!Evolution 49:1260–1267\\n*\\n1. Sikkink K. L.\\n2. Reynolds R. M.\\n3. Ituarte C. M.\\n4. Cresko W. A.\\n5. Phillips P. C.\\n2019Environmental and evolutionary drivers of the modular gene regulatory network underlying phenotypic plasticity for stress resistance in the nematode ¡em¿caenorhabditis remanei¡/em¿9:969–982\\n*\\n1. undefined undefined\\n2018RStan: the R interface to Stan\\n*\\n1. Steppan S.\\n2. Phillips P.\\n3. Houle D.\\n2002Comparative quantitative genetics: evolution of the g matrixTREE 17:320–327\\n*\\n1. Stiernagle T.\\n1999Maintenance of C. elegans\\n*\\n1. Stinchcombe J. R.\\n2. Simonsen A. K.\\n3. Blows M. W.\\n2014Estimating uncertainty in multivariate responses to selection68:1188–96\\n*\\n1. Svensson E. I.\\n2. Arnold S. J.\\n3. Burger R.\\n4. Csillery K.\\n5. Draghi J.\\n6. Henshaw J. M.\\n7. Jones A. G.\\n8. De Lisle S.\\n9. Marques D. A.\\n10. McGuigan K.\\n11. Simon M. N.\\n12. Runemark A.\\n2021Correlational selection in the age of genomics5:562–573\\n*\\n1. Swierczek N. A.\\n2. Giles A. C.\\n3. Rankin C. H.\\n4. Kerr R. A.\\n2011High-throughput behavioral analysis in c. elegans8:592–8\\n*\\n1. Teotónio H.\\n2. Carvalho S.\\n3. Manoel D.\\n4. Roque M.\\n5. Chelo I. M.\\n2012Evolution of outcrossing in experimental populations of Caenorhabditis elegans7:\\n*\\n1. Teotónio H.\\n2. Estes S.\\n3. Phillips P.\\n4. Baer C.\\n2017Experimental evolution with caernohabditis nematodes206:691–716\\n*\\n1. Theologidis I.\\n2. Chelo I. M.\\n3. Goy C.\\n4. Teotónio H.\\n2014Reproductive assurance drives transitions to self-fertilization in experimental caenorhabditis elegans12:93\\n*\\n1. Via S.\\n2. Lande R.\\n3. undefined undefined\\n1985Genotype-environment interaction and the evolution of phenotypic plasticity39:505–522\\n*\\n1. Walsh B.\\n2. Lynch M.\\n2018Evolution and Selection of Quantitative Traits\\n*\\n1. Walter G. M.\\n2. Aguirre J. D.\\n3. Blows M. W.\\n4. Ortiz-Barrientos D.\\n2018Evolution of genetic variance during adaptive radiation191:\\n*\\n1. Whitlock M. C.\\n2. Phillips P. C.\\n3. Fowler K.\\n2002Persistence of changes in the genetic covariance matrix after a bottleneck56:1968–75\\n*\\n1. Zhen M.\\n2. Samuel A. D.\\n2015C. elegans locomotion: small circuits, complex functionsCurr Opin Neurobiol 33:117–26\\n\\n\\n** Author information\\n------------------------------------------------------------\\n1.\\n** François Mallard\\n------------------------------------------------------------\\n2.\\n** Bruno Afonso\\n------------------------------------------------------------\\n3.\\n** Henrique Teotónio\\n------------------------------------------------------------\\n\\n\\n** Figures and data\\n------------------------------------------------------------\\nTable 1:sciency picture\\n\\nNumber of measurements per population in each of three assay years. In total there were 188 lines for A6140 and 61, 61 and 42 lines for GA[1,2,4].\\nsciency picture sciency picture sciency picture sciency picture sciency picture sciency picture sciency picture sciency picture sciency picture sciency picture sciency picture sciency picture Figure 1:sciency picture\\n\\nPhenotypic plasticity in the ancestral population A6140. Grey dots indicate the values estimated for each inbred line in the low and high salt environments for each of the transition rates between activity and movement direction. F stands for “forward”, B for “backward” and S for “still”, left to right order indicating movement direction. Orange shows the mean least-square estimates of the transition rates among inbred lines in each environment, with bars the 95% confidence intervals (see Methods). Mean differences between environments are indicated by a line, with asterisks showing plasticity (LRT χ^2, P-value <0.001; Table 1 (#tbl1) ).\\nTable 2:sciency picture\\n\\nPhenotypic plasticity in the ancestral population\\nFigure 2:sciency picture\\n\\nG-matrix of the ancestral population A6140 measured in low and high salt environments. A. Total genetic variance in each environment (trace of the G matrices), blue (red) for low (high) salt environments. B. Bottom six entries indicate the diagonal estimates the genetic variances of transition rates, top 15 entries indicate the off-diagonal estimates of genetic covariances between transition rates. Blue (red) indicate estimates in low (high) salt, with colored intervals and bars showing respectively 80% and 95% credible intervals of the posterior distribution, dots the mean of the posterior (see Methods). In Supplementary Figure S1, we show that most (co)variance estimates, in both environments, are different from those expected just with sampling effects. C. Eigenvalues estimates of the six eigenvectors of the G matrices, blue (red) for low (high) salt. Dot and bars indicate the mean, 80% and 95% credible intervals of the posterior distributions. Following (Morrissey and Bonnet (2019)\\n(#c51) ), the two phenotypic dimensions with most genetic variation, g[max] and g[2], in low salt, but only g[max] in high salt, are different from null expectations in both environments (not shown).\\nFigure 3:sciency picture\\n\\nPlasticity and g[max] in the ancestral population. A. Projection of the amount of genetic variance along the phenotypic plasticity vector ΔP. Bars indicate for both low and high salt environments the estimated projections (Π), with dots and error bars the mean, 80% and 95% credible intervals (see Methods). Lower bars show the null expectation if the total genetic variance was equally distributed along all the phenotypic dimensions (round G-matrix). B. The angle between ΔP and g[max], Θ, in both low and high salt is higher than the random expectation of 45°C (dashed line, see Methods). Bars indicate 80% and 95% credible intervals.\\nTable 3:sciency picture\\n\\nDivergence of each GA population from the ancestral population\\nFigure 4:sciency picture\\n\\nExperimental evolution of locomotion behavior. Small colored dots show the estimated transition rates in high salt for each line from the ancestral population A6140 (grey) and three replicate GA[1,2,4] populations at generation 50 (red). Least square estimates of the mean and 95% confidence intervals are shown in circles and error bars. Divergence between ancestral and the 3 replicate populations is shown by asterisks (LRT χ^2, P-value <0.05 *, <0.01 **, <0.001 ***; Table 4 (#tbl4) ). Divergence per replicate population can be found in Table 3 (#tbl3) . Results obtained in the low salt environment can be found in Supplementary Figure S2, and analysis in Tables 3 (#tbl3) and 4 (#tbl4) .\\nFigure 5:sciency picture\\n\\nAncestral g[max] with phenotypic and genetic divergence in high salt. The among replicate GA populations angle between ancestral g[max] (Figure 2C) and phenotypic divergence ΔD (equation 2 (#eqn2) ). Similarly the angle between phenotypic divergence ΔD and genetic divergence (e[11], Supplementary Figure S4 (#figS4) , and between g[max] and e[11]. All bars indicate with dots and error the mean, 80% and 95% credible intervals obtained by sampling the posterior distribution estimates of the A6140 G matrix (see Methods). The null expectation of non-alignment between vectors is 45° (see Methods), thus the dimension encompassing most genetic variation in the ancestral population aligns with both phenotypic and genetic divergence observed after evolution to high salt.\\nFigure 6:sciency picture\\n\\nPredicted versus observed phenotypic divergence. A. Shown are the ancestral genetic covariances between transition rates in low (blue) and high (red) salt environments with relative fertility in high salt (Robertson’s selection differentials s or selection responses R, see equation 7 (#eqn7) ). Genetic variance for fitness in high salt is also important (bottom bar). B. Shows selection differentials s (from panel A.) against the observed phenotypic divergence ΔD (equation 2 (#eqn2) , from Figure 4 (#fig4) and Supplementary Figure S2 (#figS2) ). While in high salt the direction of divergence for all six transition rates are well predicted, because they fall within the identity line, in low salt the direction of divergence are well predicted for only two transition rates (dashed lines showing no predicted divergence). C. from panel B. we plot the angles between expected and observed phenotypic divergence vectors. For all panels, dots and error bars indicate the mean and the 80% and 95%\\ncredible intervals (see Methods). See Supplementary Figure S8 (#figS8) for the predicted versus observed magnitude of phenotypic divergence.\\nTable 4:sciency picture\\n\\nDivergence among GA populations from the ancestral population\\nFigure 7:sciency picture\\n\\nSelection gradients on transition rates. Directional selection gradients on transition rates in high salt are show following equation 8 (#eqn8) , Lande’s retrospective equation, as the product of the inverse of ancestral G matrix in high salt (Figure 2 (#fig2) ) with Robertson’s selection differentials (equation 7 (#eqn7) , Figure 6A (#fig6) ). Dots and error bars show the mean and 80% and 95% credible intervals obtained by sampling the posterior distribution of the ancestral G matrix (see Methods). Similar results are found when the ancestral G matrix in low salt are sampled (not shown).\\n\\n\\n** Editors\\n------------------------------------------------------------\\n* Senior Editor\\nMolly Przeworski\\nColumbia University, United States\\n* Reviewing Editor\\nJacqueline Sztepanacz\\nUniversity of Toronto, Canada\\n\\nReviewer #1 (Public Review):\\n\\nIn this manuscript, the authors use experimental evolution in C. elegans to ask whether evolution in locomotor traits in a high salt environment can be predicted using the Roberston-Price identity and whether the evolutionary response to the salt environment is due to direct selection on locomotor phenotypes or indirect selection via an unmeasured trait. The authors also examine the alignment between phenotypic plasticity in the ancestral environment aligns with G.\\n\\nThe experimental evolution system in C. elegans is a powerful model system to test these types of questions, in particular, because it is possible to resurrect ancestral populations and compare them contemporaneously to evolved lines. It is also possible to estimate broad sense genetic covariance matrices from inbred lines, as the authors have done here.\\n\\nThe introduction does not clearly set up the background for the key questions that the manuscript addresses. One of the key parts of the manuscript is to attempt to determine whether locomotory behaviour evolves because of direct or indirect selection of the traits. However, the authors don't provide an argument for why a salty environment would select for locomotory traits. Indeed, in the discussion, the authors point out that it is likely an unmeasured trait (body size) correlated with locomotory traits that are under selection. They present arguments for why this might be the case and point to un-included data that show body size significantly genetically covaries with all of the traits studied. Since the authors appear to have these data, and one of their key questions is comparing direct vs. indirect responses to selection, it would be more powerful to include the body size data and estimate selection on all traits together.\\n\\nPhenotypic plasticity was estimated from a series of univariate models, with estimates arranged in a vector. As the authors point out in the manuscript, traits that are not included in a model but covary with traits that are can largely bias estimates of the traits that are included. For this reason, it would make sense to estimate phenotypic plasticity using a multivariate model, as has been done for G matrices.\\n\\nThe estimation and interpretation of G matrices are a critical part of the manuscript. The authors state that broad sense estimates of G are a good proxy for additive genetic variation in this system, but in the Discussion they also state that overdominance was likely important during evolution to the salt environment, leading to some lack of clarity on whether dominance is important or not. It is also unclear how uncertainty in estimated G matrices was assessed. Showing that G differs from noise is critical to the majority of the results presented. The authors cite Morrissey and Bonnet (2019) as providing the method for generating the null distribution of G, however, this paper does not appear to propose or describe a method to do this.\\n\\nAlthough the figure captions state that they are showing estimates of genetic variances, it appears to be heritability (bounded between 0 and 1). Whether the authors are studying heritability or genetic variance is an important difference, particularly in the context of a changing environment and phenotypic plasticity, where environmental variation is important and expected to change. For example, the result that G is smaller in evolved populations could simply be due to their being larger environmental variance in the salt environment (as you would expect). This is unrelated to an evolutionary response.\\n\\nIt seems that comparisons to the ancestral population were done for A160, not the founding population for each evolved line at G0. It is not clear whether the founder effects of each replicate are important and if this is the most appropriate comparison (the Discussion suggests that founder effects are important).\\n\\nOverall, there is much interesting data collected and analysed in this manuscript, addressing a valuable question. However, it is not obvious whether the estimates of G matrices are different from noise, and heritability may not be the most appropriate scale to ask questions about phenotypic plasticity and evolution in a novel stressful environment that may affect levels of environmental variation.\\n\\nReviewer #2 (Public Review):\\n\\nThis manuscript represents the drawing together of a series of published results with new information, aiming to comprehensively address questions about the predictability of phenotypic evolution. The authors have data that may allow them to simultaneously investigate how genetic variation influences phenotypic evolution, and how that evolution, in turn, shapes genetic variation.\\n\\nI had several concerns about the suitability of the data for the questions posed, and about the robustness of the evidence presented. These concerns may be resolved via more detailed information about what was done and/or further analyses to provide robust support for conclusions. However, if not resolved, the data may be fundamentally unsuited to the purpose.\\n\\nResponse to selection:\\n\\nIt was not clear to me that it was appropriate to interpret locomotor behavior as having evolved in response to the salinity environment. Specifically, where is the evidence that any change in trait means is a (direct or indirect) response to selection imposed by increased salinity rather than the neutral drift of a trait due to the reduction in population size caused by the salinity? Strong evidence of adaptive evolution would be provided by all 3 replicates significantly diverging from the ancestor in the same direction. Model 2 seems to aim to test the null hypothesis that the three replicates diverged from one another via a random effects model - but with only three replicates, there is very low power, and variance is likely to be estimated as zero. I'm not sure what is shown in Tables 3 & 4, or how these results relate to models 2 & 3, so my interpretation of the information may be incorrect. Nonetheless, and noting that the errors around estimates are not presented, there seems to be\\nconsiderable heterogeneity in size and direction of divergence between replicates for most of the traits. Is this study really dissecting responses to directional selection, or is it dissecting drift?\\n\\nWhat are the traits, and what is the confidence in G?\\nMy outsider's interpretation of these results is that defining 6 transition states is a way of getting at a single behavioral trait, and I was not convinced that these data were suitable for addressing questions about multivariate evolution. Genetic parameters were estimated using MCMCglmm, which imposes boundaries on estimates. The authors state that they followed Morrissey and Bonnet 2019, but I was unable to infer what this means with respect to accounting for the contribution of sampling error to covariances (or how they accounted for the positive variance constraint). Because I was unsure how sampling error was being assessed for G, I was not confident about the interpretation of statistical support for individual parameters, or for eigenvalues of G. Following this forward, if the measured characteristics constitute a single trait, with an entirely shared genetic basis, then the results of strong alignment of everything with gmax makes complete sense - there is a single trait, that is\\nheritable and plastic, and for which the mean evolved.\\n\\nReviewer #3 (Public Review):\\n\\nUsing experimental evolution with a nematode model system in a novel salt environment, Mallard et al. present a very nice experiment testing whether plasticity aligns with genetic variance and whether phenotypic divergence can be predicted from patterns of genetic variance. They find that although plasticity is not in the direction of genetic variance, estimates of selection that predict divergence are concordant with observed divergence. However, direct selection on a trait not included in the analysis is expected to be the underlying cause of phenotypic evolution. I commend the authors on their experiment and the framing of such a conceptually difficult topic.\\n\\nStrengths:\\n\\nComparing a common ancestor to evolved populations to predict evolution has rarely been achieved, and the authors provide a strong test for predicting evolution in a novel environment.\\n\\nWeaknesses:\\n\\nAlthough a valuable dataset, the framing of the paper needs to be more focused on the question of predicting phenotypic evolution and comparing direct versus indirect selection. There are many details that are missing in the methods, which include the biological importance of the traits that are being studied, and how adaptation to the novel environment has occurred. In the discussion, they reveal that a measured trait that hasn't been included in the analyses is likely responsible for the observed patterns and it is unclear why this trait wasn't included in the analyses. In addition, direct versus indirect selection is not formally compared, which makes it difficult to interpret their results.",
  "stage": "published",
  "published": "2022-10-20T03:00:00Z",
  "reviewedDate": "2022-10-20T03:00:00Z",
  "versionDate": "2022-10-20T03:00:00Z",
  "statusDate": "2022-10-20T03:00:00Z",
  "subjects": [
    {
      "id": "evolutionary-biology",
      "name": "Evolutionary Biology"
    }
  ]
}
