{
  "id": "81274",
  "doi": "10.1101/2020.07.27.223354",
  "pdf": "https://www.biorxiv.org/content/10.1101/2020.07.27.223354v2.full.pdf",
  "status": "reviewed",
  "authorLine": "Valentin Quiniou, Pierre Barennes ... David Klatzmann",
  "title": "Human thymopoiesis produces polyspecific CD8<sup>+</sup> α/β T cells responding to multiple viral antigens",
  "indexContent": "* Immunology and Inflammation (https://elifesciences.org/subjects/immunology-inflammation)\\n\\n\\n** Human thymopoiesis produces polyspecific CD8^+ α/β T cells responding to multiple viral antigens\\n------------------------------------------------------------\\n1. Valentin Quiniou\\n2. Pierre Barennes\\n3. Vanessa Mhanna\\n4. Paul Stys\\n5. Hélène Vantomme\\n6. Zhicheng Zhou\\n7. Federica Martina\\n8. Nicolas Coatnoan\\n9. Michèle Barbié-Sastre\\n10. Hang-Phuong Pham\\n11. Béatrice Clemenceau\\n12. Henri Vié\\n13. Mikhail Shugay\\n14. Adrien Six\\n15. Barbara Brandao\\n16. Roberto Mallone\\n17. Encarnita Mariotti-Ferrandiz\\n18. David Klatzmann\\n\\n1. Sorbonne Université, INSERM, Immunology-Immunopathology-Immunotherapy (i3)\\n\\n\\nFrance\\n2. AP-HP, Hôpital Pitié-Salpêtrière, Clinical Investigation Center for Biotherapies (CIC-BTi) and Immunology-Inflammation-Infectiology and Dermatology Department (3iD)\\n\\n\\nFrance\\n3. Université de Paris, Institut Cochin\\n\\n\\nFrance\\n\\n...show 4 more\\n* https://doi.org/10.7554/eLife.81274.1\\n\\n* Open access (https://en.wikipedia.org/wiki/Open_access)\\n* Copyright information (https://creativecommons.org/licenses/by/4.0/)\\n\\n\\n** Reviewed Preprint\\n------------------------------------------------------------\\n\\nThis preprint was published after peer review by eLife.\\n* downloadDownload (#)\\n\\nSent for peer review\\n20 July 2022\\n\\nPosted to bioRxiv\\n21 June 2022Go to bioRxiv (https://www.biorxiv.org/content/10.1101/2020.07.27.223354)\\n\\n* Full text\\n* Figures and data\\n* Peer review\\n\\n* Abstract (#abstract)\\n* eLife assessment (#assessment)\\n* INTRODUCTION (#s1)\\n* RESULTS (#s2)\\n* DISCUSSION (#s3)\\n* MATERIALS AND METHODS (#s4)\\n* Supplementary Materials (#s5)\\n* References (#references)\\n* Author Information (#author-list)\\n\\n\\n** Abstract\\n------------------------------------------------------------\\nT cell receptors (TCRs) are formed by stochastic gene rearrangements, theoretically generating >10^19 sequences. They are selected during thymopoiesis, which releases a repertoire of about 10^8 unique TCRs per individual. How evolution shaped a process that produces TCRs that can effectively handle a countless and evolving set of infectious agents is a central question of immunology. The paradigm is that a diverse enough repertoire of TCRs should always provide a proper, though rare, specificity for any given need. Expansion of such rare T cells would provide enough fighters for an effective immune response and enough antigen-experienced cells for memory. We show here that human thymopoiesis releases a large population of CD8^+ T cells harboring α/β paired TCRs that (i) have high generation probabilities and (ii) a preferential usage of some V and J genes, (iii) are shared between individuals and (iv) can each recognize and be activated by multiple unrelated viral peptides, notably from\\nEBV, CMV and influenza. These polyspecific T cells may represent a first line of defense that is mobilized in response to infections before a more specific response subsequently ensures viral elimination. Our results support an evolutionary selection of polyspecific α/β TCRs for broad antiviral responses and heterologous immunity.\\n\\neLife assessment\\n\\nThis paper reports on important observations regarding human CD8 T cells that express shared T cell receptors amongst individuals and exhibit poly-specificity directed mainly to several unrelated viral antigens. Although the majority of the claims are convincingly supported by results from both in silico and experimental approaches, mechanistic molecular details underlying poly-specificity remain incomplete. The results from these studies will enhance the ongoing debate on T cell specificity and potentially, will impact fields related to immunology, for example, immunoparasitology, cell biology, and vaccine development.\\n* Read the peer reviews (#)\\n* About eLife assessments (https://elifesciences.org/inside-elife/db24dd46)\\n\\n\\n** INTRODUCTION\\n------------------------------------------------------------\\n\\nSpecificity is considered a hallmark of the adaptive immune response. For T cells, specificity is mediated by T cell receptors (TCRs), which interact with peptides presented by major histocompatibility complex (MHC) molecules through their complementary-determining-region-3 (CDR3). TCRs are formed by rearrangements between hundreds of gene segments at the alpha and beta loci, theoretically generating >10^60 possible sequences ((1 (#c1) )–(3 (#c3) )). Each rearrangement has its probability of generation, which has been modeled to vary by about 10 orders of magnitude for the beta chain alone ((4 (#c4) )). During their development within the thymus, T cells undergo a selection largely based on the strength of their activation by thymic antigen-presenting cells that eliminates >80% of them ((5 (#c5) )–(7 (#c7) )). For each individual, this process releases a pool of T cells expressing a repertoire of approximately 10^8 unique TCRs ((8 (#c8) )).\\n\\nHow evolution shaped a process that selects cells that would efficiently respond to antigens that are not yet present, i.e. from an infectious agent to come, is a central question of immunology. The paradigm is that the production and selection of a diverse enough repertoire of TCRs should always provide a proper, though rare, specificity for any given need. Expansion of such rare T cells would then provide enough fighters for an effective immune response and later enough antigen-experienced cells for immune memory ((9 (#c9) )). Thus, it is widely accepted that “T cell-mediated immunity to infection is due to the proliferation and differentiation of rare clones in the preimmune repertoire that by chance express TCRs specific for peptide-MHC (pMHC) ligands derived from the microorganism”((10 (#c10) )).\\n\\nHowever, this theory is challenged by overlooked data questioning the essence of specificity. First, a child with an X-linked severe combined immunodeficiency who had a reverse mutation in a single T cell progenitor was protected from infections despite having a very restricted repertoire of only about 1,000 different TCRs ((11 (#c11) )). How such a repertoire (10^−5 of a normal repertoire size) could handle the numerous infections occurring during childhood awaits explanation. Second, robust experimental and epidemiological data have highlighted the importance of heterologous immunity, i.e. immunity to one pathogen afforded by the exposure to unrelated pathogens ((12 (#c12) )–(14 (#c14) )). Likewise, for example, (i) memory T cells that are specific for one virus can become activated during infection with an unrelated virus ((15 (#c15) )), (ii) there are numerous virus-specific memory phenotype T cells in unexposed individuals ((16 (#c16) )), (iii) CMV infection enhances the immune\\nresponse to influenza ((17 (#c17) )) and (iv) tumor-resident memory HBV-specific T cell responses correlate with hepatocellular carcinoma outcome(18 (#c18) ).\\n\\nWe hypothesized that high-resolution sequencing of the TCR repertoire of developing thymocytes and peripheral T cells would yield insights into repertoire selection and function towards pathogens. We focused on the development of CD8^+ T cells as they represent the main effectors against viral pathogens, those that have had most chances to influence the evolution of our immune system. We obtained samples from organ donors allowing access to thymocytes and peripheral T cells, as well as datasets from patients undergoing vaccinations or with infections; we also used TCR data available from multiple public repositories.\\n\\nWe identified a population of CD8^+ T cells harboring diversified and polyspecific α/β TCRs that each can bind to multiple unrelated viral peptides, notably those from commonly encountered viruses such as EBV, CMV or influenza. We hypothesize that these cells represent a first line of defense that is promptly mobilized in response to infections, possibly containing them before a more specific response subsequently ensures their control. Our results support an evolutionary selection of polyspecific α/βTCRs for broad antiviral responses and heterologous immunity.\\n\\n\\n** RESULTS\\n------------------------------------------------------------\\n\\n\\n** Thymopoiesis selects a large and diverse set of clustered CDR3s with high generation probabilities\\n------------------------------------------------------------\\n\\nTo investigate how TCR diversity influences immune response to infectious agents, we started by analyzing the TCR repertoire dynamics of developing thymocytes. We first focused on the hypervariable CDR3 region of the TCR that interacts with the antigenic peptide, while CDR1 and CDR2 usually interact with HLA molecules ((19 (#c19) )). CDR3 analyses can therefore be used to investigate the sharing of TCR specificities across individuals with distinct HLA molecules. We analyzed the repertoire of purified CD4^+CD8^+CD3^− (DPCD3^−), CD4^+CD8^+CD3^+ (DPCD3^+) and CD4^− CD8^+CD3^+ (CD8^+) thymocytes (Fig. S1A (#figS1) ). DPCD3^− thymocytes represent the earliest stage of TCR β-chain gene recombination, and their repertoire embodies the unaltered outcome of the TCR generation process; DPCD3^+ thymocytes are at an early stage of the selection process and their repertoire should be minimally modified; CD8^+ thymocytes have passed the selection process and bear a fully selected repertoire. We analyzed\\nand represented the structure of these repertoires by connecting CDR3s (nodes) differing by at most one single amino acid (AA) (Levenshtein distance less than or equal to one: LD≤1). LD≤1 connected CDR3s have been described to most often bind the same peptide ((20 (#c20) )–(26 (#c26) )) (Fig. S1B (#figS1) ). In such networks, connected CDR3s are designated as clustered nodes and the others as dispersed nodes. For normalization, we represented the first 18,000 most expressed β or α CDR3s from each sample.\\n\\nWe observed a significant increase in the number of clustered βCDR3s from DPCD3^− to CD8^+ thymocytes (Fig. 1A (#fig1) and B (#fig1) ) (p<0.0001), which was remarkably consistent among all individuals studied, independently of their age, sex or HLA (Fig. S2 (#figS2) ). Node’s degree, i.e., its number of CDR3 neighbors based on LD≤1, was also significantly increased during T cell differentiation for clustered βCDR3s (Fig. 1C (#fig1) and D (#fig1) ) (p<0.0001). Similar results were found for the αCDR3s (Fig. S3A-B (#figS3) ). These observations suggest a positive selection during thymopoiesis of TCRs with close CDR3 sequences, and therefore with shared recognition properties.\\nFigure 1.sciency picture\\n\\n\\n** Thymocyte differentiation produces clustered CDR3s with high generation probability and preferential TRB VJ gene combinations.\\n------------------------------------------------------------\\n\\nThe probability of generation (Pgen) of a given TCR varies enormously from one TCR to the other. The clustered TCRs from both DPCD3^+ and CD8^+ thymocytes have a significantly higher Pgen (p<0.0001) than the dispersed ones (Fig. 1E (#fig1) ). Pgen also increased significantly (p<0.0001) from DPCD3^+ to CD8^+ thymocytes (Fig. 1E (#fig1) ). Moreover, there is a robust and remarkable correlation between βCDR3 generation probability and their number of connections (p<0.0001) (Fig. 1F (#fig1) and Fig. S3C (#figS3) ).\\n\\nClustered βCDR3s belong to TCRs that have a preferential usage of V and J genes, with a significant (p<0.01) overrepresentation of Vβ 12-3, 27, 5-1, and 7-9 and of JB 1-1 and 2-7 (Fig. S3D-E (#figS3) ). This results in a clear separation of clustered versus dispersed TCRs in a principal component analysis of VJ usages (Fig. 1G (#fig1) ).\\n\\n\\n** Clustered CDR3s are enriched for publicness\\n------------------------------------------------------------\\n\\nClustered βCDR3s are also enriched in public sequences, i.e. being shared between at least 2 individuals (p<0.0001) (Fig. 2A (#fig2) ). The significant increase of public βCDR3s in CD8^+ versus DPCD3^+ thymocytes (p<0.0001) is mostly that of the clustered βCDR3s. For CD8^+ thymocytes, up to 31.7% of clustered βCDR3s are public compared to barely 1% of the dispersed ones (Fig. 2A (#fig2) , Fig. S4A (#figS4) ). Public βCDR3 have a significantly higher generation probability than the private ones (p<0.0001) (Fig. 2B (#fig2) ), which is robust across all the patients (Fig. S4B (#figS4) , Table S1 (#tblS1) ). Noteworthily, the number of public βCDR3 shared between individuals is independent of the number of shared HLA Class I alleles (Fig. 2C (#fig2) ). Finally, clustered βCDR3s of one individual can be connected to those of other individuals (up to twelve), and more frequently in CD8^+ versus DPCD3^+ thymocytes (Fig. 2D (#fig2) and E (#fig2) ), indicating a convergence of specificities between\\nindividuals’ clustered repertoires. Altogether, these results indicate that the mechanisms for TCR generation and for their further thymic selection are biased to shape a public repertoire of connected βCDR3s with shared recognition properties.\\nFigure 2.sciency picture\\n\\n\\n** Thymocyte differentiation produces clustered CDR3s with high publicness.\\n------------------------------------------------------------\\n\\n\\n** Clustered public CDR3s are enriched in viral specificities\\n------------------------------------------------------------\\n\\nThe preferential selection of clustered public CDR3s that could represent over 8% of the sampled repertoire (Fig. 2A (#fig2) ) raises the question of their specificities. As the main function of CD8^+ T cells is cytotoxicity towards virally infected cells, we investigated whether the clustered CDR3s could be associated with virus recognition. We curated two databases of βCDR3s from TCRs specific for human infectious pathogens ((27 (#c27) ), (28 (#c28) )) to retain only a set of 5,437 βCDR3 that had been identified by the binding of soluble multimeric MHC/peptide complexes i.e. tetramers or dextramers ((29 (#c29) )). We detected an enrichment of these virus-specific βCDR3s in clustered versus dispersed CD8^+ thymocytes (p<0.0001) and in CD8^+ versus DPCD3^+ thymocytes (p<0.0001) (Fig. 3A (#fig3) ). Moreover, these virus-specific βCDR3s were significantly enriched in βCDR3s with the highest Pgen and node degree (Fig. 3B (#fig3) and C (#fig3) , Fig. S5A (#figS5) , Table S2 (#tblS2) ). They\\nwere also highly shared between individuals (Fig. 3D (#fig3) ) and they contained a high representation of CMV, EBV and influenza specificities (Fig. S5B (#figS5) ). To better represent the contribution of virus-specific CDR3s to the global repertoire of CD8^+ cells, we connected them to all CD8^+ cell CDR3s of the 12 individuals using either a perfect matching (LD=0) (Fig. 3E (#fig3) left panel) or an LD≤1 (Fig. 3E (#fig3) right panel). In the latter representation, the 13,557 connected CDR3s (i) covered most of the clustered CDR3s of all individuals (Fig. 3E (#fig3) , Fig. S6A (#figS6) ), (ii) amounted to up to 7.4% and 12.3% of the DPCD3^+ and CD8^+ cells CDR3 repertoires, respectively (Fig. 3F (#fig3) ), and (iii) were highly shared between individuals (Fig. S6B (#figS6) ).\\nFigure 3.sciency picture\\n\\n\\n** Clustered public TCRs are enriched for virus-specific TCRs.\\n------------------------------------------------------------\\n\\nAltogether, these results indicate that the selection of clustered CDR3s with high generation probabilities and high inter-individual sharing corresponds, at least in part, to the selection of virus-specific TCRs whose CDR3s are remarkably conserved between individuals independently of their HLA restriction and form what could be referred to as a “paratopic network”.\\n\\n\\n** Identification of polyspecific TCRs\\n------------------------------------------------------------\\n\\nAfter thymic selection, an in-silico estimation indicated up to 12% of the TCR repertoire as specific for the small set of 30 tested peptides derived from 7 viruses that was used for the analysis (Fig. 3F (#fig3) ). This appears hardly compatible with the fact that the TCR repertoire should contain TCRs that react specifically to countless antigens. Actually, we observed that a single cluster of βCDR3s from CD8 thymocytes could comprise unique βCDR3s from TCRs assigned to different viral specificities in independent experiments, for example to CMV, influenza, EBV and YFV (Yellow Fever Virus). This observation is puzzling, as clustered CDR3s are likely to respond to similar antigens (Fig. S1B (#figS1) and ((20 (#c20) )–(26 (#c26) ))). It suggested that some virus-associated TCRs could have a “fuzzy” specificity that could allow the recognition of peptides from different viruses. We explored the public databases of virus-specific TCRs ((27 (#c27) ), (28 (#c28) )) in more detail and discovered\\nthat numerous single CDR3s had been assigned to multiple specificities, for example, single CDR3s binding both CMV and influenza tetramers (Fig. S7A (#figS7) ). In addition, among the 13,557 virus-associated βCDR3s that we previously estimated in CD8^+ thymocytes (Fig. 3E (#fig3) , “LD≤1”), almost 7% (958/13557) are in silico assigned (LD≤1) as specific for at least two distinct viruses (Fig. S7B (#figS7) ).\\n\\n\\n** Binding properties of polyspecific TCRs\\n------------------------------------------------------------\\n\\nWe further investigated the potential T cell specificities of CD8+ thymocytes by using the GLIPH2 algorithm to analyze a combined dataset of 216,000 CDR3β sequences from our CD8^+ thymocytes and from 32,496 tetramer-specific sequences from the curated VDJdb database. This algorithm groups together CDR3s that have structural characteristics that make them likely to recognize the same antigens, hence called “specificity groups” ((24 (#c24) )). We identified 93,182 such specificity groups. We then analyzed the presence among these groups of TCRs from the VDJdb database with a known viral specificity. Noteworthy, 31.6% of the specificity groups contained at least one CDR3 with a known specificity, an already surprising observation given that the VDJdb database relates to a quite limited sample of the universe of specificities. Even more surprisingly, 6.8% of the clusters identified by GLIPH2 contained CDR3s with more than one specificity, and up to 9 different ones (Fig. 4A (#fig4) ).\\nFigure 4.sciency picture\\n\\n\\n** Identification of polyspecific TCRs.\\n------------------------------------------------------------\\n\\nWe further analyzed the CDR3β repertoires identified with GLIPH2 as specific for at least one of 16 EBV peptides (Fig. 4B (#fig4) ). The analysis of these CDR3s based on the Morisita-Horn (MH) dissimilarity index identifies peptides recognized by overlapping repertoires. Noteworthy, the presence of shared CDR3β EBV specific repertoire is observed in both a match/mismatch HLA context. The MDS representation of MH dissimilarity index for EBV repertoire (Fig. S7C (#figS7) ) show the convergence of these shared CDR3β EBV specific repertoire across patients.\\n\\nAs these observations are made only from studying unpaired CDR3s, we aimed to confirm them with paired α and β virus-specific CDR3s obtained from single-cell TCR sequencing. These sequences were obtained from 160,914 blood CD8^+ T cells isolated from four healthy donors and incubated simultaneously with dextramers complexed with peptides from CMV, EBV, HIV, HPV, HTLV and influenza. We could identify numerous single cells harboring TCRs that could bind to multiple dextramers. As an example, single-cell TCRs that bind dextramers matching the HLA of a given individual loaded with EBV or CMV peptides are shown (Fig. 4C (#fig4) ). Projecting the binding of EBV dextramers onto a t-SNE representation based on single-cell specificity identified a few distinct regions that contained positive cells (Fig. 4C (#fig4) , left t-SNE). Repeating the same analysis with CMV dextramers identified binding in these same regions, and often on the same cells (Fig. 4C (#fig4) , right t-SNE). Thus, single TCRs\\nappear to bind to both EBV and CMV HLA-matched dextramers.\\n\\nActually, unique TCRs could recognize multiple unrelated peptides from the same virus as well as peptides from different viruses. We represented on chord diagram the binding of TCRs to HLA-matched EBV dextramers loaded with different peptides (Fig. 4D (#fig4) left). For example, one half of the TCRs that bind to the RAKFKQLL peptide also bind the FLRGRAYGL peptide. Furthermore, some TCRs recognizing this RAKFKQLL peptide can also bind peptides from CMV (red), EBV (green) or HIV (dark blue) (Fig. 4D (#fig4) right).\\n\\nFinally, we analyzed in more detail the binding scores of TCRs from 2 patients that all use the same CASSIRSSYEQYF βCDR3 and that were associated with different ⍺CDR3s. This represented 664 cells harboring 55 unique TCRs and 1410 cells harboring 91 unique TCRs, respectively (altogether 2074 cells expressing 131 unique TCRs). We represented the binding score of these CDR3s for 49 different dextramers. Noteworthily, these 2074 TCRs all had the highest binding score for a matched HLA-A*0201 dextramer bound to an influenza peptide (Fig. S8 (#figS8) ). However, they also had a high binding score for a series of peptides from CMV and EBV bound to HLA-A*0301 and A*1101 dextramers. Most importantly, there was no significant binding to most of the dextramers, indicating that the binding of these few dextramers was specific. These results suggest that polyspecificity is biased towards recognition of common viruses.\\n\\n\\n** Polyspecific T cells are activated in vitro by multiple viral peptides\\n------------------------------------------------------------\\n\\nThese peculiar properties of polyspecific T cell (psT) TCRs led us to assess their functional relevance. We first evaluated the in vitro cross-activation of psT cells with different peptides. Human effector memory CD8^+ T cells were purified according to their binding of CMV or EBV HLA-matched dextramers (Fig S9 (#figS9) ); the sorted cells were then stimulated by either the peptide that was used to purify them, or by different ones, and their activation was measured by their IFN-γ production (Fig. 5A (#fig5) ). All T cells were efficiently non-specifically activated by PMA/ionomycin. T cells that did not bind any dextramers could not be stimulated by any peptide. In contrast, dextramer-sorted cells could be activated by their cognate peptide and almost as well by the other (Fig. 5B (#fig5) ).\\nFigure 5.sciency picture\\n\\n\\n** Polyreactivity of polyspecific TCRs.\\n------------------------------------------------------------\\n\\nWe also tested the response of bulk T cells developed as cell therapy products for the treatment of CMV infections. These cells had been selected through 18 days of stimulation in the presence of a peptide pool covering the complete sequence of the pp65 protein of CMV. Upon stimulation by their cognate peptides, over 85% of the CD8+ T cells produced IFNγ (Fig. S10A (#figS10) ). Surprisingly, a small fraction of the same cells produced interferon upon stimulation with unrelated CMV-IE1 peptides, and a large fraction upon stimulation with a peptide pool which covers the sequence of the BZLF-1 protein of EBV (Fig. S10A (#figS10) ). There was no interferon production upon stimulation of the same cells by a peptide pool which covers the EBNA1 protein of EBV (Fig. S10A (#figS10) ). The stimulation with EBV peptides requires a 100-fold higher but still physiological concentration of peptides (Fig. S10B (#figS10) ).\\n\\nFinally, we directly confirmed the polyspecificity of unique TCRs upon their cloning and re-expression. We used a 5KC murine T-hybridoma cell line devoid of endogenous TCR, and transduced with a ZsGreen fluorescent reporter under the control of nuclear factor of activated T cells (NFAT) and with human CD8 ((30 (#c30) )). These 5KC transductants were then stimulated with K562 cells transduced with either HLA-A*02:01 or HLA-A*03:01 as antigen presenting cells, in the presence of individual peptides at increasing concentrations. From the single cell sequencing dataset, we selected TCRs that could bind dextramers loaded with Flu, CMV and EBV peptides. TCR#35-13 responded strongly to HLA-A*02:01-transduced K562 cells loaded with Flu MP 58-66 (EC50: 2.02×10-9 M) and CMV IE1-184-192 (EC50: 7.99×10-7 M), and poorly to EBV BMLF1 280-288 (EC50: 9.37×10-3 M) (Fig. 5C (#fig5) upper left). TCR#36-150 responded strongly to HLA-A*02:01- transduced K562 cells loaded with EBV BMLF1 280-288 (EC50: 9.99×10-11\\nM) and Flu MP 58-66 (EC50: 7.57×10-7 M) and poorly to CMV IE1 184-192 (EC50: 2.58×10-3 M) (Fig. 5C (#fig5) bottom left). None of the TCRs responded to peptide-pulsed K562 expressing HLA-A*03:01. In contrast, a control D222D TCR ((31 (#c31) )) known as specific for a ZnT8 186-194 peptide responded to this peptide (EC50: 2.68×10-7 M), but not to the Flu, EBV or CMV peptides (Fig. 5C (#fig5) upper right). We then further analyzed TCRs derived from single-sorted CD8+ T cells stained with tetramers loaded with pancreatic self-peptides. TCRs with known specificities were also cloned and expressed in the reporter cell line. We analyzed their response to a set of peptides comprising their cognate peptide and peptides with no significant structural commonalities, selected by testing combinatorial peptide libraries((30 (#c30) )). We also observed a marked polyspecificity of these TCRs. As an example, a TCR identified as responding to the VMNILLQYV peptide from the Glutamic Acid Decarboxylase protein\\nresponded even better to the structurally unrelated SLYNPAIVYA peptide from human chondroitin sulfate N-acetylgalactosaminyltransferase 2 (Fig 5D (#fig5) ).\\n\\n\\n** DISCUSSION\\n------------------------------------------------------------\\n\\nOur work brings to attention an overlooked phenomenon hidden in the literature. In a simple curation of public datasets of antiviral TCRs that were assigned to respond to known viruses - retaining only those from cells that could bind or respond to a known peptide - we found a surprisingly frequent representation of CDR3s that had been assigned to different viral specificities from independent experiments. Within the 40,939 curated βCDR3, 24% were from TCRs that could bind at least two totally unrelated viral peptides. This observation is highly relevant, as it arises in large part from datasets of full TCRs from single-cell sequencing. Noteworthily, in these latter experiments, cells are co-incubated with multiple dextramers bearing a large set of unrelated peptides; although this dataset is widely available, researchers have missed (or dismissed) that a single cell could bind multiple dextramers (sometimes a dozen). In the methodology description, the technology provider recommends\\ndetermination of the specificity of a given T cell by the identity of the dextramer that has the highest binding counts on that cell. This is a rather crude readout, as the highest count is often marginally so. Furthermore, it should be realized that, as there are limited numbers of HLA molecules available per cell, there is competition between dextramers for binding at the cell surface. That a single cell binds multiple dextramers bearing unrelated peptides is in our view highly meaningful. As the binding of multimeric HLA/peptide complexes is a paradigmatic method to define specificity, multiple binding indicates multiple specificities. We thus defined TCRs binding multiple HLA/peptide complexes as polyspecific, and by extension called the cells harboring these TCRs as polyspecific T cells (psT cells).\\n\\nTCRs are notoriously “cross-reactive,” and it is estimated that each TCR could potentially recognize >10^6 different peptide/MHC combinations ((32 (#c32) )–(35 (#c35) )). Indeed, the HLA/peptide/TCR ménage à trois leaves room for mimotopic cross-reactivity, i.e. the fact that two unrelated peptides can bind differently to a given HLA molecule, but altogether generate a globally similar structure that would be recognized by the same TCR. Also, it was recently shown that peptides need to share only five residues at specific positions to bind the same TCR ((35 (#c35) ), (36 (#c36) )). This latter observation has functional relevance as bacterial-derived peptides sharing such 5 residues with a tissue-restricted MOG self-antigen were shown (i) to activate a known MOG-specific TCR as well as a MOG peptide and (ii) to trigger an autoimmune attack against brain tissues upon mouse immunization ((36 (#c36) ), (37 (#c37) )). Thus, if many peptides could interact with a given TCR, it is because they\\nshare a structural conservation of their TCR interaction surface ((33 (#c33) )).The functional relevance of these observations were described as that “TCR cross-reactivity enables effective surveillance of diverse self and foreign antigens without necessitating degenerate recognition of non-homologous peptides”((33 (#c33) )).\\n\\nIn contrast to this mimotopic cross-reactivity, we did not observe any specific amino acid sharing structure for the multiple peptides recognized by polyspecific TCRs. Thus, polyspecificity appears to be what was described as “degenerate recognition of non-homologous peptides” ((33 (#c33) )). We prefer to describe polyspecificity as defining a fuzziness (rather than “degeneration”) in TCR recognition that makes it capable of interacting with multiple unrelated peptides. In this regard, it is noteworthy that B cells have a machinery for somatic mutations of their BCRs that ultimately allows them to generate antibodies with increased affinity (specificity) for antigens. While TCR generation and BCR generation share many common mechanisms, the fact that T cells did not evolve to use such somatic mutations suggest that T cell recognition has been selected to be more fuzzy than stringent.\\n\\nAs TCRs have been essentially selected during thymocyte differentiation for their ability to bind HLA molecules presented by thymic antigen-presenting cells, it could have been that polyspecificity represents some loose remnant of that property. However, it should be emphasized that a single cell does not bind randomly to any homologous-HLA/peptide complexes (Supplementary Fig. 7 (#figS7) ). Indeed, each polyspecific TCR has its own binding pattern regarding a large set of dextramers, with most that do not bind. Moreover, when two polyspecific TCRs bind to a given dextramer, they have a similar binding score for others that they also bind to. Thus, this binding is not just “non-specific” and must obey some structural rules that remain to be defined.\\n\\nPolyspecific TCR binding properties are distinct from those of innate-like MAIT and NKT cells ((38 (#c38) ), (39 (#c39) )). These have a restricted diversity, with an invariant TCRα chain and a constrained TCRβ repertoire, and are MR1- or CD1-restricted, respectively. In contrast, the repertoire of polyspecific TCRs is highly diverse for both the TCR α and β chains, although with a specific usage of VDJ/VJ recombination. Also, polyspecific T cells found in adults cannot be the remnant of fetal/neonatal T cells that have been described as having a promiscuous repertoire, as these cells have repertoires enriched in germline-encoded TCRs((40 (#c40) ), (41 (#c41) )).\\n\\nThe polyspecific nature of these TCRs has a functional relevance, as we show here that cloned polyspecific TCRs indeed trigger cell activation in response to multiple peptides, although with different efficiencies. In agreement with our results, the analysis of the TCR repertoire of lung tumor infiltrating T cells using GLIPH2, as we did here, recently identified a key TCR that, after cloning and expression, could bind and respond to a tumor-specific self-antigen as well as to a peptide from E. coli and one from EBV ((42 (#c42) )). In the same line, a recent study of multiple sclerosis pathogenesis identified autoreactive CD4+ T cell clones that can respond to self-peptides as well as peptides from EBV and from the bacteria Akkermansis muciniphila((43 (#c43) )). This further establishes the existence of psT cells that respond to multiple antigens from different microbes. Also, in the development of the T-scan platform aimed at characterizing the specificity of TCRs((44 (#c44) )), the\\nauthors performed a set-up experiment with CD8 cells activated by the immunodominant NLV peptide from the pp65 protein of CMV. While T-scan could identify two hits related to NLV overlapping peptides, they also detected two hits related to the unrelated CMV I1E CMV protein. Actually, tetramer staining revealed that while 25% of the T cells in the NLV-expanded population bind NLV tetramers, 2% of the T cells bind IE1 tetramers((44 (#c44) )). Moreover, the fold enrichment of the IE1 specific cells was close to that of NLV specific cells (60 vs 80, respectively). Thus, activation with a single peptide results in a major expansion of cells with TCRs that can also respond to an unrelated peptide.\\n\\nThe fact that CMV, EBV and influenza specificities are highly represented in polyspecific binding patterns likely reflects the biased representation of these specificities in the databases (15.9%, 16.2%, 50.6%, respectively), but also highlights that the detection of the diverse viral specificities of psT cells is largely underestimated due to the very low number of CDR3s with known viral specificities for viruses other than these. Our results led us to estimate that polyspecific TCRs could represent at least 1/5 of the CD8 selected TCR repertoire. Altogether, our results define peculiar binding properties of polyspecific TCRs. This warrants to study their physicochemical characteristics, with a special interest in solving the structure of such TCRs bound to two unrelated peptides.\\n\\n\\n** Ideas and speculations\\n------------------------------------------------------------\\n\\nOur findings have important implications for the study of the adaptive immune response in health, diseases and immunotherapies. In the field of infectious diseases and vaccination, they prompt reconsideration of the paradigm of highly diverse adaptive immune repertoires providing a highly antigen-specific antiviral immune response. Indeed, there is an intrinsic weakness in the view that a highly diverse TCR repertoire is ideal to protect us from a countless repertoire of constantly evolving viruses. As best illustrated by the deadly outcome of flu in the elderly or young infants, there is a very limited amount of time for the immune system to react against rapidly replicating deadly viruses. For life-threatening situations, the initial recruitment of frequent polyspecific effector T cells might be more efficient and rapid than having to rely on rare cells with stringent specificity that would need a period of expansion to provide enough fighters. In the race between virus replication and\\nthe mounting of the immune response, this early response of polyspecific T cells could provide some control of the viral spread that will allow time for the development of an immunologically fittest response to ensure the final control of the infection. This would explain how a very restricted repertoire of only about 1,000 different TCRs arising from a single T cell progenitor was sufficient to cope with viral infections in a child ((11 (#c11) )). They would also explain why children vaccinated against measles in underdeveloped countries have a better life expectancy than unvaccinated ones (when excluding measles-related events), which could be linked to an overall better response to infections with other pathogens ((48 (#c48) ), (49 (#c49) )).\\n\\nWhile our findings do not challenge that there are specific TCRs nor that there are specific immune responses, they highlight another mechanism of preparedness of the immune system, reminiscent of the role of (i) other unconventional T cells like MAIT and NKT cells((45 (#c45) )), (ii) TCR activation by bacterial superantigen ((46 (#c46) )) and (iii) natural antibodies specific for microbial determinants ((47 (#c47) )).\\n\\nAltogether, polyspecific TCRs form a paratopic network, made of TCRs that have a high probability of generation and are positively selected during thymocyte differentiation. These properties indicate that these TCRs have been positively selected during evolution, further supporting their overall beneficial effects. A fuzzy recognition by polyspecific TCRs would explain the so-called “heterologous immunity” ((50 (#c50) ), (51 (#c51) )) in which T cell responses to one pathogen can have a major impact on the course and outcome of a subsequent infection with an unrelated pathogen ((17 (#c17) )). We speculate that individual histories of fuzzy immune responses may thus create patient-specific “antigenic sins” that might be responsible for the diverse quality of immune responses to viruses, from inapparent infection to fulminant immunopathology ((52 (#c52) )–(54 (#c54) )). Further studies will have to evaluate the contribution of fuzzy immune responses to the efficacy but also the\\nimmunopathology of antimicrobial responses and to autoimmunity. We speculate that the origin of many immune diseases should be sought in the repeated activation of polyspecific T cells.\\n\\n\\n** MATERIALS AND METHODS\\n------------------------------------------------------------\\n\\n\\n** Patients and samples\\n------------------------------------------------------------\\n\\nThirteen human thymus samples were obtained from organ donors undergoing surgery (Department of Cardiac Surgery, Pitié-Salpêtrière Hospital, France) after approval by the Agence de Biomédecine and the Ministry of Research. Their age at the time of sampling ranged from 19 to 65 years old. The male-to-female sex ratio was 2.6.\\n\\nFor cross-activation experiments, six leukapheresis samples were freshly collected from healthy donors at EFS Paris Saint-Antoine-Crozatier (Etablissement Français du Sang, Paris, France) after informed consent and according to institutional guidelines. Donor selection was based on matching HLA-A2 class I allele.\\n\\n\\n** Isolation of thymocytes and extraction of RNA\\n------------------------------------------------------------\\n\\nSingle-cell suspensions were prepared from the thymus by mechanical disruption through nylon mesh (cell strainer). Single-cell suspensions from whole thymus were stained with antibodies anti-CD3 (AF700), anti-CD4 (APC), anti-CD8 (FITC). Cells were sorted by fluorescent activated cell sorting (Becton Dickinson^TM FACSAria II) with purity >95% to collect populations based on the following labeling: DPCD3^− were gated as CD3^−CD4^+CD8^+, DPCD3^+ were gated as CD3^+CD4^+CD8^+ and CD8^+ were gated as CD3^+CD4^−CD8^+. RNA was isolated from sorted populations by means of lysis buffer with the RNAqueous-Kit (Invitrogen®) extraction kit, according to the manufacturer’s protocol.\\n\\n\\n** TCR repertoire library preparation and sequencing\\n------------------------------------------------------------\\n\\nTCR repertoire library preparation and sequencing was performed has previously described((55 (#c55) )). Briefly, T cell receptor (TCR) alfa and beta libraries were prepared on 100 ng of RNA from each sample with the SMARTer Human TCR a/b Profiling Kit (Takarabio®) following the provider’s protocol. Briefly, the reverse transcription was performed using TRBC reverse primers and further extended with a template-switching oligonucleotide (SMART-Seq® v4). cDNAs were then amplified following two semi-nested PCRs: a first PCR with TRBC and TRAC reverse primers as well as a forward primer hybridizing to the SMART-Seqv4 sequence added by template-switching and a second PCR targeting the PCR1 amplicons with reverse and forward primers including Illumina Indexes allowing for sample barcoding. PCR2 were then purified using AMPure beads (Beckman-Coulter®). The cDNA samples were quantified and their integrity was checked using DNA electrophoresis performed on an Agilent 2100 Bioanalyzer System in\\ncombination with the Agilent DNA 1000 kit, according to the manufacturer’s protocol. Sequencing was performed with Hiseq 2500 (Illumina®) SR-300 protocols using the LIGAN-PM Genomics platform (Lille, France).\\n\\n\\n** TCR deep sequencing data processing\\n------------------------------------------------------------\\n\\nFASTQ raw data files were processed for TRA and TRB sequences annotation using MiXCR ((56 (#c56) )) software (v2.1.10) with RNA-Seq parameters. MiXCR extracts TRAs and TRBs and provides corrections of PCR and sequencing errors.\\n\\n\\n** Network generation and representation\\n------------------------------------------------------------\\n\\nTo construct a network, we computed a distance matrix of pairwise Levenshtein distances between CDR3s using the “stringdist”((57 (#c57) )) R package. When two sequences were similar under the defined threshold, LD>1 (i.e., at most one amino acid difference), they were connected and designated as “clustered” nodes. CDR3s with more than one amino acid difference from any other sequences are not connected and were designated as “dispersed” nodes.\\n\\nLayout of networks for fig. 1C (#fig1) , 2D were obtained by using the graphopt algorithm of the “Igraph”((58 (#c58) )) R package and plotted in 2D with “ggplot2” to generate figures ((59 (#c59) )). Only clustered nodes are represented, edges are not shown and colors represent the node degree (log scale). Layouts of detailed networks in fig. 1A (#fig1) were done with Cytoscape((60 (#c60) )).\\n\\n\\n** Statistical analysis and visualization\\n------------------------------------------------------------\\n\\nNormalization was performed by sampling on the top α or β 18,000 CDR3s based on their frequency in each sample. The repertoires with less than 18,000 α or β CDR3s were not included in the statistical analysis. The numbers of samples included in the statistical analysis for the β repertoire were: two for DPCD3^−, ten for DPCD3^+ and twelve for CD8^+. The numbers of samples included in the statistical analysis of the α repertoire were: six for DPCD3^+ and ten for CD8^+. Statistical tests used to analyze data are included in the figure legends. Comparisons of two groups were done using the Mann-Whitney test (fig.1B-D-E (#fig1) , fig.2A-C (#fig2) , fig.3A-B-F (#fig3) ) and multiple t-test (fig. 2E (#fig2) ). The correlation coefficient was calculated using the Pearson correlation coefficient (fig. 2B (#fig2) & 2C (#fig2) , fig. 2C (#fig2) ). Enrichment of public CDR3s or virus-associated CDR3s was done using the two-tailed Chi-square test with Yates correction (Tables S1 (#tblS1) , S2 (#tblS2)\\n& S3 (#tblS3) ). Statistical comparisons and multivariate analyses were performed using Prism (GraphPad Software, La Jolla, CA) and using R software version 3.5.0 (www.r-project.org). PCA was performed on the frequency of VJ combination usage frequency within each donor using the factoextra R package. T-SNE were generated using the binding scores of each cell across all the antigens present in the dataset. The function Rtsne of the homonymous R package ((61 (#c61) )) was applied with the perplexity parameter set to 10.\\n\\n\\n** Probability of generation calculation\\n------------------------------------------------------------\\n\\nThe generation probability (Pgen) of a sequence is inferred using the Olga algorithm, which is inferred by IGoR ((63 (#c63) )), for fig. 1E (#fig1) and fig.2B (#fig2) . IGoR uses out-of-frame sequence information to infer patient-dependent models of VDJ recombination, effectively bypassing selection. From these models, the probability of a given recombination scenario can be computed. The generation probability of a sequence is then obtained by summing over all the scenarios that are compatible with it. We also used OLGA to generate a random repertoire of 500,000 sequences for each α or β repertoire and 3 down sampling (of unique sequences) to get a control repertoire equal to the size of COVID-19 BAL dataset used in fig. 7B & C. The control repertoire was parametrized by the predefined genomic templates provided with the package.\\n\\n\\n** CDR3 connections between individuals\\n------------------------------------------------------------\\n\\nIn fig. 2D (#fig2) , the top 1,500 βCDR3s were sampled from each of the 12 datasets of DPCD3^+ and CD8^+, then merged to obtain two datasets of 18,000 βCDR3s for DPCD3^+ and CD8^+. We generated and represented networks, as described above, to investigate the βCDR3 inter-individual network structure.\\n\\n\\n** Virus-specific CDR3 tetramer public databases\\n------------------------------------------------------------\\n\\nThe virus-associated CDR3 databases used for the search for specificity was compiled from the most complete previously published McPAS-TCR ((27 (#c27) )) and VDJdb ((28 (#c28) )) databases. Virus-associated βCDR3s were selected from the original datasets only when derived from a TCR of sorted CD8 T cells that were bound by a specific tetramer. A total of 5,437 such unique tetramer-associated βCDR3s were identified and used. Peptides used for tetramer sorting were from cytomegalovirus (CMV), Epstein-Barr virus (EBV), hepatitis C virus (HCV), herpes simplex virus 2 (HSV2), human immunodeficiency virus (HIV), influenza and yellow fever virus (YFV).\\n\\n\\n** Virus-specific CDR3 single-cell dextramer public dataset\\n------------------------------------------------------------\\n\\nThis dataset contains single-cell alpha/beta TCRs from 160,914 CD8^+ T cells isolated from peripheral blood mononuclear cells (PBMCs) from 4 healthy donors. Briefly, 30 dCODE™ Dextramer® reagents (Immudex®) with antigenic peptides derived from infectious diseases (9 from CMV, 12 from EBV, 1 for influenza, 1 for HTLV, 2 for HPV and 5 for HIV) were simultaneously used to mark cells. Each Dextramer® reagent included a distinct nucleic acid barcode. A panel of fluorescently labeled antibodies was used to sort pure Dextramer®-positive cells within the CD8^+ T cell population using an MA900 Multi-Application Cell Sorter (Sony Biotechnology) in a reaction mix containing RT Reagent Mix and Poly dT RT primers. The Chromium Single Cell V(D)J workflow generates single cell V(D)J and Dextramer® libraries from amplified DNA derived from Dextramer®-conjugated barcode oligonucleotides, which are bound to TCRs. Chromium Single Cell V(D)J enriched libraries and cell surface protein libraries were\\nquantified, normalized, and sequenced according to the user guide for Chromium Single Cell V(D)J reagent kits with feature barcoding technology for cell surface protein. We used this dataset to study the presence of multiple specificities in TCR and CDR3. There were 139,378 unambiguous TCRs (with only one α and one β chain). We set the threshold defining positive binding at UMI counts greater than 10 for any given dextramer. This identified 15,195 unique virus-specific TCRs with at least one binding.\\n\\n\\n** Cross-activation experiment\\n------------------------------------------------------------\\n\\nPBMCs were separated on Ficoll gradient. CD8+ T cells were isolated from PBMCs by positive isolation using the DYNABEADS® CD8 Positive Isolation Kit (Thermo Fisher Scientific) according to the manufacturer’s instructions. emCD8 T cells were purified after staining with CD3-AF700, CD8-KO, CD45RA-PeCy7 according to the manufacturer’s instructions. The samples were also stained either with CMV pp65 NLVPMVATV or with EBV BMLF-1 GLCTLVAML PE-conjugated Dextramers (Immudex®). emCD8^+Dex^+ cells were sorted by FACS (FACS Aria II®; BD Biosciences) with a purity >95%. Sorted cells were cultured at a maximum of 5 × 10^5 cells/mL in round-bottom 96-well plates in RPMI 1640 medium supplemented with 10% FCS, 1% penicillin/streptomycin and glutamate at 37°C with 5% CO[2]. In vitro stimulation was performed 24 hours after cell sorting. Sorted cells were stimulated for 6 hours with either nothing or 1 μg/mL of SIINFEKL ovalbumin peptide (OVA), NLVPMVATV cytomegalovirus pp65 peptide (CMV) or GLCTLVAML\\nEpstein-Barr virus BMLF-1 peptide (Ozyme®). The positive control (Ctl PMA/Iono) was performed with 50 ng/mL phorbol myristate acetate (PMA) and 1 mM ionomycin. Intracellular IFN-γ production with an IFN-γ-FITC antibody (BD Pharmingen) was detected in the presence of Golgi-Plug (BD Pharmingen®) after fixation and permeabilization (BD Cytofix/Cytoperm). Data were acquired using a Navios flow cytometer and analyzed with Kaluza analysis software (Beckman Coulter).\\n\\n\\n** In vitro CMVpp65 CTL selection\\n------------------------------------------------------------\\n\\nPeripheral blood mononuclear cells (PBMCs) were obtained from blood donors at the Etablissement Français du Sang (EFS) with informed consent (Blood products transfer agreement relating to biomedical research protocol 97/5-B—DAF 03/4868). CMV+ donor PBMCs were resuspended in the serum-free culture medium TexMacs (Miltenyi-Biotech) at 10^7 cells/mL and at a density of 5 × 10^6 cells/cm^2. Then, 20 µl PepTivator-CMVpp65 (Miltenyi-Biotech (130-093-435), 30 nmol of each peptide and approximately 140 peptides were added per mL of cell suspension. The final concentration of PepTivator-CMVpp65 was 0.6 nmol (approximately 1 µg of each peptide/mL). With these stimulation conditions, PBMCs were incubated for 4 hours and then transferred to culture flasks at 10^6 cells/mL in RPMI medium with 8% human serum (EFS Pays de la Loire, France) and 50 IU IL-2/mL. CTL were maintained in culture for 25 days.\\n\\n\\n** Detection of CMV pp65-specific T cells by intracellular staining with anti-INF-γ-PE\\n------------------------------------------------------------\\n\\nCMVpp65 selected CTL were stimulated for 6 hours in TexMacs medium (without human serum and IL-2) with 20 µL PepTivator-CMVpp65 per mL of cell suspension. Brefeldin-A was added at 10 µg/ml. Negative control (CTL without stimulation) and positive control (CTL stimulated with PMA-ionomycin) were also included. Stimulation with irrelevant peptides was also performed with PepTivator-CMV IE-1 (Miltenyi (130-093-494) and PepTivator-EBV BZLF1 (Miltenyi (130-093-612). Cells were then stained with anti-CD8-FITC, fixed, permeabilized and intracellularly stained with anti-INF-γ-PE.\\n\\n\\n** Peptide dose-response of TCR transductants\\n------------------------------------------------------------\\n\\nTCR transductants were generated as described [Mann, Zhou, Front Immunol 2020]. Briefly, 5KC T-hybridoma cells (kindly provided by M. Nakayama, Barbara Davis Center, Aurora, CO) were transduced with the NFAT-driven fluorescent reporter ZsGreen-1 along with human CD8 by spinoculation with retroviral supernatant produced from phoenix-eco cells (ATCC CRL-3214). These cells were subsequently transduced with retroviral vectors encoding a chimeric TCR alpha gene followed by a porcine teschovirus-1 2A (P2A) peptide and a chimeric TCR beta gene synthesized by TwistBioscience. K562 cells (ATCC CCL-243) were transduced with lentiviral vectors (TakaraBio) encoding HLA-A*02:01 or HLA-A*03:01 by spinoculation with ultracentrifuge concentrated viral particles produced from 293T-HEK-TN cells (System biosciences), followed by sorting of cells stained with anti-human HLA-A, B, C antibody conjugated with PE-Cy7 (clone W6/32, BioLegend).\\n\\nTCR transductants (20,000 cells per well) were stimulated for 18 h with individual peptides at different concentrations (9 10-fold serial dilutions from 100 μM) in the presence of HLA-A*02:01+ or HLA-A*03:01+ K562 cells (50,000 cells per well), followed by analysis of ZsGreen-1 expression. Peptides (from Synpeptide) tested for the response by TCRs are GILGFVFTL (Flu MP 58–66), GLCTLVAML (EBV BMLF1 280-288), KLGGALQAK (CMV IE1 280-288), VMNILLQYV (GAD65 114-122), VAANIVLTV (ZnT8 186-194) and other sequences selected by testing a GAD 114-122-reactive TCR by combinatorial peptide libraries, as described((30 (#c30) )) EC50 values were calculated using the nonlinear regression log (agonist) vs. response (three parameters) equation model in GraphPad Prism 9.\\n\\n\\n** Supplementary Materials\\n------------------------------------------------------------\\n\\nFig. S1. Thymocytes cell sorting dot plot.\\n\\nFig. S2. ßCDR3 network during thymopoiesis.\\n\\nFig. S3. Properties of thymocytes’ TCRs.\\n\\nFig. S4. Publicness of thymocytes’ CDR3s.\\n\\nFig. S5. Virus specificities of thymocytes’ CDR3s.\\n\\nFig. S6. Sharing of virus specific thymocytes’ CDR3s.\\n\\nFig. S7. Binding properties of single cell TCRs.\\n\\nFig. S8. βCDR3s drive polyspecificity.\\n\\nFig. S9. Gating strategy for sorting effector memory (emCD8) Dextramer positive cells.\\n\\nFig. S10. Polyspecific properties of anti-CMV cytotoxic cells.\\n\\nTable S1. Enrichment of public βCDR3s in CD8+ thymocytes vs DPCD3+.\\n\\nTable S2. Enrichment of virus-specific βCDR3s from databases^14,15 in clustered CD8+ thymocytes.\\n\\nTable S3. List of peptides represented on the chord plot. Related to 4I.\\n\\n\\n** References\\n------------------------------------------------------------\\n*\\n1. Dupic T.\\n2. Marcou Q.\\n3. Walczak A. M.\\n4. Mora T.\\n2018Genesis of the αβ T-cell receptorbioRxiv https://doi.org/10.1101/353128\\n*\\n1. Murphy K.\\n2. Weaver C.\\n2012Janeway’s immunobiology. Garland Science.(2016)The Quarterly Review of Biology 87:266–267\\n*\\n1. Murugan A.\\n2. Mora T.\\n3. Walczak A. M.\\n4. Callan C. G.\\n2012Statistical inference of the generation probability of T-cell receptors from sequence repertoiresProceedings of the National Academy of Sciences 109:16161–16166\\n*\\n1. Bradley P.\\n2. Thomas P. G.\\n2019Using T Cell Receptor Repertoires to Understand the Principles of Adaptive Immune RecognitionAnnual Review of Immunology 37:547–570\\n*\\n1. Klein L.\\n2. Kyewski B.\\n3. Allen P. M.\\n4. Hogquist K. A.\\n2014Positive and negative selection of the T cell repertoire: what thymocytes see (and don’t see)Nat Rev Immunol 14:377–391\\n*\\n1. Sinclair C.\\n2. Bains I.\\n3. Yates A. J.\\n4. Seddon B.\\n2013Asymmetric thymocyte death underlies the CD4:CD8 T-cell ratio in the adaptive immune systemProceedings of the National Academy of Sciences 110:\\n*\\n1. Vrisekoop N.\\n2. Monteiro J. P.\\n3. Mandl J. N.\\n4. Germain R. N.\\n2014Revisiting Thymic Positive Selection and the Mature T Cell Repertoire for AntigenImmunity 41:181–190\\n*\\n1. Qi Q.\\n2. Liu Y.\\n3. Cheng Y.\\n4. Glanville J.\\n5. Zhang D.\\n6. Lee J.-Y.\\n7. Olshen R. A.\\n8. Weyand C. M.\\n9. Boyd S. D.\\n10. Goronzy J. J.\\n2014Diversity and clonal selection in the human T-cell repertoireProceedings of the National Academy of Sciences 111:13139–13144\\n*\\n1. Davis M. M.\\n1988T-cell antigen receptor genes and T-cell recognition\\n*\\n1. Jenkins M. K.\\n2. Chu H. H.\\n3. McLachlan J. B.\\n4. Moon J. J.\\n2010On the Composition of the Preimmune Repertoire of T Cells Specific for Peptide–Major Histocompatibility Complex LigandsAnnu. Rev. Immunol 28:275–294\\n*\\n1. Bousso P.\\n2. Wahn V.\\n3. Douagi I.\\n4. Horneff G.\\n5. Pannetier C.\\n6. Le Deist F.\\n7. Zepp F.\\n8. Niehues T.\\n9. Kourilsky P.\\n10. Fischer A.\\n11. de Saint Basile G.\\n2000Diversity, functionality, and stability of the T cell repertoire derived in vivo from a single human T cell precursorProceedings of the National Academy of Sciences 97:274–278\\n*\\n1. Roth A.\\n2. Gustafson P.\\n3. Nhaga A.\\n4. Djana Q.\\n5. Poulsen A.\\n6. Garly M.-L.\\n7. Jensen H.\\n8. Sodemann M.\\n9. Rodriques A.\\n10. Aaby P.\\n2005BCG vaccination scar associated with better childhood survival in Guinea-BissauInternational Journal of Epidemiology 34:540–547\\n*\\n1. Watkin L. B.\\n2. Mishra R.\\n3. Gil A.\\n4. Aslan N.\\n5. Ghersi D.\\n6. Luzuriaga K.\\n7. Selin L. K.\\n2017Unique influenza A cross-reactive memory CD8 T-cell receptor repertoire has a potential to protect against EBV seroconversionJournal of Allergy and Clinical Immunology 140:1206–1210\\n*\\n1. Welsh R. M.\\n2. Selin L. K.\\n2002No one is naive: the significance of heterologous T-cell immunityNature Reviews Immunology 2:417–426\\n*\\n1. Verhoeven D.\\n2. Teijaro J. R.\\n3. Farber D. L.\\n2008Heterogeneous Memory T Cells in Antiviral Immunity and ImmunopathologyViral Immunology 21:99–114\\n*\\n1. Su L. F.\\n2. Kidd B. A.\\n3. Han A.\\n4. Kotzin J. J.\\n5. Davis M. M.\\n2013Virus-Specific CD4+ Memory-Phenotype T Cells Are Abundant in Unexposed AdultsImmunity 38:373–383\\n*\\n1. Furman D.\\n2. Jojic V.\\n3. Sharma S.\\n4. Shen-Orr S. S.\\n5. Angel C. J. L.\\n6. Onengut-Gumuscu S.\\n7. Kidd B. A.\\n8. Maecker H. T.\\n9. Concannon P.\\n10. Dekker C. L.\\n11. Thomas P. G.\\n12. Davis M. M.\\n2015Cytomegalovirus infection enhances the immune response to influenzaScience Translational Medicine 7:281–281\\n*\\n1. Cheng Y.\\n2. Gunasegaran B.\\n3. Singh H. D.\\n4. Dutertre C.-A.\\n5. Loh C. Y.\\n6. Lim J. Q.\\n7. Crawford J. C.\\n8. Lee H. K.\\n9. Zhang X.\\n10. Lee B.\\n11. Becht E.\\n12. Lim W. J.\\n13. Yeong J.\\n14. Chan C. Y.\\n15. Chung A.\\n16. Goh B. K. P.\\n17. Chow P. K. H.\\n18. Chan J. K. Y.\\n19. Ginhoux F.\\n20. Tai D.\\n21. Chen J.\\n22. Lim S. G.\\n23. Zhai W.\\n24. Choo S. P.\\n25. Newell E. W.\\n2021Non-terminally exhausted tumor-resident memory HBV-specific T cell responses correlate with relapse-free survival in hepatocellular carcinomaImmunity 54:1825–1840\\n*\\n1. Rossjohn J.\\n2. Gras S.\\n3. Miles J. J.\\n4. Turner S. J.\\n5. Godfrey D. I.\\n6. McCluskey J.\\n2015T Cell Antigen Receptor Recognition of Antigen-Presenting MoleculesAnnual Review of Immunology 33:169–200\\n*\\n1. Dash P.\\n2. Fiore-Gartland A. J.\\n3. Hertz T.\\n4. Wang G. C.\\n5. Sharma S.\\n6. Souquette A.\\n7. Crawford J. C.\\n8. Clemens E. B.\\n9. Nguyen T. H. O.\\n10. Kedzierska K.\\n11. La Gruta N. L.\\n12. Bradley P.\\n13. Thomas P. G.\\n2017Quantifiable predictive features define epitope-specific T cell receptor repertoiresNature 547:89–93\\n*\\n1. Klinger M.\\n2. Pepin F.\\n3. Wilkins J.\\n4. Asbury T.\\n5. Wittkop T.\\n6. Zheng J.\\n7. Moorhead M.\\n8. Faham M.\\n2015Multiplex Identification of Antigen-Specific T Cell Receptors Using a Combination of Immune Assays and Immune Receptor SequencingPLOS ONE 10:\\n*\\n1. Madi A.\\n2. Poran A.\\n3. Shifrut E.\\n4. Reich-Zeliger S.\\n5. Greenstein E.\\n6. Zaretsky I.\\n7. Arnon T.\\n8. Laethem F. V.\\n9. Singer A.\\n10. Lu J.\\n11. Sun P. D.\\n12. Cohen I. R.\\n13. Friedman N.\\n2017T cell receptor repertoires of mice and humans are clustered in similarity networks around conserved public CDR3 sequenceseLife 6:https://doi.org/10.7554/eLife.22057\\n*\\n1. Chen G.\\n2. Yang X.\\n3. Ko A.\\n4. Sun X.\\n5. Gao M.\\n6. Zhang Y.\\n7. Shi A.\\n8. Mariuzza R. A.\\n9. Weng N.\\n2017Sequence and Structural Analyses Reveal Distinct and Highly Diverse Human CD8 + TCR Repertoires to Immunodominant Viral AntigensCell Reports 19:569–583\\n*\\n1. Glanville J.\\n2. Huang H.\\n3. Nau A.\\n4. Hatton O.\\n5. Wagar L. E.\\n6. Rubelt F.\\n7. Ji X.\\n8. Han A.\\n9. Krams S. M.\\n10. Pettus C.\\n11. Haas N.\\n12. Arlehamn C. S. L.\\n13. Sette A.\\n14. Boyd S. D.\\n15. Scriba T. J.\\n16. Martinez O. M.\\n17. Davis M. M.\\n2017Identifying specificity groups in the T cell receptor repertoireNature 547:94–98\\n*\\n1. Qi Q.\\n2. Cavanagh M. M.\\n3. Le Saux S.\\n4. NamKoong H.\\n5. Kim C.\\n6. Turgano E.\\n7. Liu Y.\\n8. Wang C.\\n9. Mackey S.\\n10. Swan G. E.\\n2016Diversification of the antigen-specific T cell receptor repertoire after varicella zoster vaccinationScience translational medicine 8:332–332\\n*\\n1. Meysman P.\\n2. De Neuter N.\\n3. Gielis S.\\n4. Bui Thi D.\\n5. Ogunjimi B.\\n6. Laukens K.\\n2019On the viability of unsupervised T-cell receptor sequence clustering for epitope preferenceBioinformatics 35:1461–1468\\n*\\n1. Tickotsky N.\\n2. Sagiv T.\\n3. Prilusky J.\\n4. Shifrut E.\\n5. Friedman N.\\n2017McPAS-TCR: a manually curated catalogue of pathology-associated T cell receptor sequencesBioinformatics 33:2924–2929\\n*\\n1. Shugay M.\\n2. Bagaev D. V.\\n3. Zvyagin I. V.\\n4. Vroomans R. M.\\n5. Crawford J. C.\\n6. Dolton G.\\n7. Komech E. A.\\n8. Sycheva A. L.\\n9. Koneva A. E.\\n10. Egorov E. S.\\n11. Eliseev A. V.\\n12. Van Dyk E.\\n13. Dash P.\\n14. Attaf M.\\n15. Rius C.\\n16. Ladell K.\\n17. McLaren J. E.\\n18. Matthews K. K.\\n19. Clemens E. B.\\n20. Douek D. C.\\n21. Luciani F.\\n22. van Baarle D.\\n23. Kedzierska K.\\n24. Kesmir C.\\n25. Thomas P. G.\\n26. Price D. A.\\n27. Sewell A. K.\\n28. Chudakov D. M.\\n2018VDJdb: a curated database of T-cell receptor sequences with known antigen specificityNucleic Acids Research 46:\\n*\\n1. Dolton G.\\n2. Lissina A.\\n3. Skowera A.\\n4. Ladell K.\\n5. Tungatt K.\\n6. Jones E.\\n7. Kronenberg-Versteeg D.\\n8. Akpovwa H.\\n9. Pentier J. M.\\n10. Holland C. J.\\n11. Godkin A. J.\\n12. Cole D. K.\\n13. Neller M. A.\\n14. Miles J. J.\\n15. Price D. A.\\n16. Peakman M.\\n17. Sewell A. K.\\n2014Comparison of peptidemajor histocompatibility complex tetramers and dextramers for the identification of antigenspecific T cellsClinical and Experimental Immunology 17:\\n*\\n1. Mann S. E.\\n2. Zhou Z.\\n3. Landry L. G.\\n4. Anderson A. S.\\n5. Alkanani A. K.\\n6. Fischer J.\\n7. Peakman M.\\n8. Mallone R.\\n9. Campbell K.\\n10. Michels A. W.\\n11. Nakayama M.\\n2020Multiplex T Cell Stimulation Assay Utilizing a T Cell Activation Reporter-Based Detection SystemFrontiers in Immunology 11:17\\n*\\n1. Culina S.\\n2. Lalanne A. I.\\n3. Afonso G.\\n4. Cerosaletti K.\\n5. Pinto S.\\n6. Sebastiani G.\\n7. Kuranda K.\\n8. Nigi L.\\n9. Eugster A.\\n10. Østerbye T.\\n11. Maugein A.\\n12. McLaren J. E.\\n13. Ladell K.\\n14. Larger E.\\n15. Beressi J.-P.\\n16. Lissina A.\\n17. Appay V.\\n18. Davidson H. W.\\n19. Buus S.\\n20. Price D. A.\\n21. Kuhn M.\\n22. Bonifacio E.\\n23. Battaglia M.\\n24. Caillat-Zucman S.\\n25. Dotta F.\\n26. Scharfmann R.\\n27. Kyewski B.\\n28. Mallone R.\\n29. undefined undefined\\n2018Islet-reactive CD8 + T cell frequencies in the pancreas, but not in blood, distinguish type 1 diabetic patients from healthy donorsSci. Immunol. 3:\\n*\\n1. Adams J. J.\\n2. Narayanan S.\\n3. Birnbaum M. E.\\n4. Sidhu S. S.\\n5. Blevins S. J.\\n6. Gee M. H.\\n7. Sibener L. V.\\n8. Baker B. M.\\n9. Kranz D. M.\\n10. Garcia K. C.\\n2016Structural interplay between germline interactions and adaptive recognition determines the bandwidth of TCR-peptide-MHC cross-reactivityNature Immunology 17:87–94\\n*\\n1. Birnbaum M. E.\\n2. Mendoza J. L.\\n3. Sethi D. K.\\n4. Dong S.\\n5. Glanville J.\\n6. Dobbins J.\\n7. Özkan E.\\n8. Davis M. M.\\n9. Wucherpfennig K. W.\\n10. Garcia K. C.\\n2014Deconstructing the Peptide-MHC Specificity of T Cell RecognitionCell 157:1073–1087\\n*\\n1. Mason D.\\n1998A very high level of crossreactivity is an essential feature of the T-cell receptorImmunology Today 19:395–404\\n*\\n1. Wooldridge L.\\n2. Ekeruche-Makinde J.\\n3. van den Berg H. A.\\n4. Skowera A.\\n5. Miles J. J.\\n6. Tan M. P.\\n7. Dolton G.\\n8. Clement M.\\n9. Llewellyn-Lacey S.\\n10. Price D. A.\\n11. Peakman M.\\n12. Sewell A. K.\\n2012A Single Autoimmune T Cell Receptor Recognizes More Than a Million Different PeptidesJournal of Biological Chemistry 287:1168–1177\\n*\\n1. Nelson R. W.\\n2. Beisang D.\\n3. Tubo N. J.\\n4. Dileepan T.\\n5. Wiesner D. L.\\n6. Nielsen K.\\n7. Wüthrich M.\\n8. Klein B. S.\\n9. Kotov D. I.\\n10. Spanier J. A.\\n11. Fife B. T.\\n12. Moon J. J.\\n13. Jenkins M. K.\\n2015T Cell Receptor Cross-Reactivity between Similar Foreign and Self Peptides Influences Naive Cell Population Size and AutoimmunityImmunity 42:95–107\\n*\\n1. Wucherpfennig K. W.\\n2. Strominger J. L.\\n1995Molecular mimicry in T cell-mediated autoimmunity: Viral peptides activate human T cell clones specific for myelin basic proteinCell 80:695–705\\n*\\n1. Toubal A.\\n2. Nel I.\\n3. Lotersztajn S.\\n4. Lehuen A.\\n2019Mucosal-associated invariant T cells and diseaseNat Rev Immunol 19:643–657\\n*\\n1. Mori L.\\n2. Lepore M.\\n3. De Libero G.\\n2016The Immunology of CD1- and MR1-Restricted T CellsAnnu. Rev. Immunol 34:479–510\\n*\\n1. Rudd B. D.\\n2020Neonatal T Cells: A ReinterpretationAnnu. Rev. Immunol 38:229–247\\n*\\n1. Davenport M. P.\\n2. Smith N. L.\\n3. Rudd B. D.\\n2020Building a T cell compartment: how immune cell development shapes functionNat Rev Immunol 20:499–506\\n*\\n1. Chiou S.-H.\\n2. Tseng D.\\n3. Reuben A.\\n4. Mallajosyula V.\\n5. Molina I. S.\\n6. Conley S.\\n7. Wilhelmy J.\\n8. McSween A. M.\\n9. Yang X.\\n10. Nishimiya D.\\n11. Sinha R.\\n12. Nabet B. Y.\\n13. Wang C.\\n14. Shrager J. B.\\n15. Berry M. F.\\n16. Backhus L.\\n17. Lui N. S.\\n18. Wakelee H. A.\\n19. Neal J. W.\\n20. Padda S. K.\\n21. Berry G. J.\\n22. Delaidelli A.\\n23. Sorensen P. H.\\n24. Sotillo E.\\n25. Tran P.\\n26. Benson J. A.\\n27. Richards R.\\n28. Labanieh L.\\n29. Klysz D. D.\\n30. Louis D. M.\\n31. Feldman S. A.\\n32. Diehn M.\\n33. Weissman I. L.\\n34. Zhang J.\\n35. Wistuba I. I.\\n36. Futreal P. A.\\n37. Heymach J. V.\\n38. Garcia K. C.\\n39. Mackall C. L.\\n40. Davis M. M.\\n2021Global analysis of shared T cell specificities in human non-small cell lung cancer enables HLA inference and antigen discoveryImmunity 54:586–602\\n*\\n1. Wang J.\\n2. Jelcic I.\\n3. Mühlenbruch L.\\n4. Haunerdinger V.\\n5. Toussaint N. C.\\n6. Zhao Y.\\n7. Cruciani C.\\n8. Faigle W.\\n9. Naghavian R.\\n10. Foege M.\\n11. Binder T. M. C.\\n12. Eiermann T.\\n13. Opitz L.\\n14. Fuentes-Font L.\\n15. Reynolds R.\\n16. Kwok W. W.\\n17. Nguyen J. T.\\n18. Lee J.-H.\\n19. Lutterotti A.\\n20. Münz C.\\n21. Rammensee H.-G.\\n22. Hauri-Hohl M.\\n23. Sospedra M.\\n24. Stevanovic S.\\n25. Martin R.\\n2020HLA-DR15 Molecules Jointly Shape an Autoreactive T Cell Repertoire in Multiple SclerosisCell 183:1264–1281\\n*\\n1. Kula T.\\n2. Dezfulian M. H.\\n3. Wang C. I.\\n4. Abdelfattah N. S.\\n5. Hartman Z. C.\\n6. Wucherpfennig K. W.\\n7. Lyerly H. K.\\n8. Elledge S. J.\\n2019T-Scan: A Genome-wide Method for the Systematic Discovery of T Cell EpitopesCell 178:1016–1028\\n*\\n1. Godfrey D. I.\\n2. Uldrich A. P.\\n3. McCluskey J.\\n4. Rossjohn J.\\n5. Moody D. B.\\n2015The burgeoning family of unconventional T cellsNat Immunol 16:1114–1123\\n*\\n1. Hayday A. C.\\n2. Vantourout P.\\n1970A. C.Hayday, P.Vantourout, Annu. Rev. Immunol., in press, doi:10.1146/annurev-immunol-102819-023144.Annu. Rev. Immunol. https://doi.org/10.1146/annurev-immunol-102819-023144\\n*\\n1. Panda S.\\n2. Ding J. L.\\n2015Natural Antibodies Bridge Innate and Adaptive ImmunityJ.I 194:13–20\\n*\\n1. Aaby P.\\n2. Bhuiya A.\\n3. Nahar L.\\n4. Knudsen K.\\n5. de Francisco A.\\n6. Strong M.\\n2003The survival benefit of measles immunization may not be explained entirely by the prevention of measles disease: a community study from rural BangladeshInternational Journal of Epidemiology 32:106–115\\n*\\n1. Aaby P.\\n2. Martins C. L.\\n3. Garly M.-L.\\n4. Bale C.\\n5. Andersen A.\\n6. Rodrigues A.\\n7. Ravn H.\\n8. Lisse I. M.\\n9. Benn C. S.\\n10. Whittle H. C.\\n2010Non-specific effects of standard measles vaccine at 4.5 and 9 months of age on childhood mortality: randomised controlled trialBMJ 341:\\n*\\n1. Welsh R. M.\\n2. Selin L. K.\\n2002No one is naive: the significance of heterologous T-cell immunityNature Reviews Immunology 2:417–426\\n*\\n1. Sewell A. K.\\n2012Why must T cells be cross-reactive?Nature Reviews Immunology 12:669–677\\n*\\n1. Peteranderl C.\\n2. Herold S.\\n3. Schmoldt C.\\n2016Human Influenza Virus InfectionsSemin Respir Crit Care Med 37:487–500\\n*\\n1. Bertoletti A.\\n2. Ferrari C.\\n2016Adaptive immunity in HBV infectionJournal of Hepatology 64:\\n*\\n1. Tay M. Z.\\n2. Poh C. M.\\n3. Rénia L.\\n4. MacAry P. A.\\n5. Ng L. F. P.\\n2020The trinity of COVID-19: immunity, inflammation and interventionNat Rev Immunol https://doi.org/10.1038/s41577-020-0311-8\\n*\\n1. Barennes P.\\n2. Quiniou V.\\n3. Shugay M.\\n4. Egorov E. S.\\n5. Davydov A. N.\\n6. Chudakov D. M.\\n7. Uddin I.\\n8. Ismail M.\\n9. Oakes T.\\n10. Chain B.\\n11. Eugster A.\\n12. Kashofer K.\\n13. Rainer P. P.\\n14. Darko S.\\n15. Ransier A.\\n16. Douek D. C.\\n17. Klatzmann D.\\n18. Mariotti-Ferrandiz E.\\n2020Benchmarking of T cell receptor repertoire profiling methods reveals large systematic biasesNat Biotechnol https://doi.org/10.1038/s41587-020-0656-3\\n*\\n1. Bolotin D. A.\\n2. Poslavsky S.\\n3. Mitrophanov I.\\n4. Shugay M.\\n5. Mamedov I. Z.\\n6. Putintseva E. V.\\n7. Chudakov D. M.\\n2015MiXCR: software for comprehensive adaptive immunity profilingNature Methods 12:380–381\\n*\\n1. van der Loo M. P. J.\\n1970The stringdist package for approximate string matching6:111–122\\n*\\n1. Csardi G.\\n2. Nepusz T.\\n1970The igraph software package for complex network research\\n*\\n1. Wickham H.\\n2016ggplot2: elegant graphics for data analysis\\n*\\n1. Shannon P.\\n2003Cytoscape: A Software Environment for Integrated Models of Biomolecular Interaction NetworksGenome Research 13:2498–2504\\n*\\n1. Krijthe J. H.\\n2015Rtsne: T-distributed stochastic neighbor embedding using Barnes-Hut implementation\\n*\\n1. Sethna Z.\\n2. Elhanati Y.\\n3. Mora T.\\n1970OLGA: fast computation of generation probabilities of B- and T-cell receptor amino acid sequences and motifs\\n*\\n1. Marcou Q.\\n2. Mora T.\\n3. Walczak A. M.\\n2018High-throughput immune repertoire analysis with IGoRNature Communications 9:https://doi.org/10.1038/s41467-018-02832-w\\n\\n\\n** Author information\\n------------------------------------------------------------\\n1.\\n** Valentin Quiniou\\n------------------------------------------------------------\\nSorbonne Université, INSERM, Immunology-Immunopathology-Immunotherapy (i3), France, AP-HP, Hôpital Pitié-Salpêtrière, Clinical Investigation Center for Biotherapies (CIC-BTi) and Immunology-Inflammation-Infectiology and Dermatology Department (3iD), France\\n2.\\n** Pierre Barennes\\n------------------------------------------------------------\\nSorbonne Université, INSERM, Immunology-Immunopathology-Immunotherapy (i3), France, AP-HP, Hôpital Pitié-Salpêtrière, Clinical Investigation Center for Biotherapies (CIC-BTi) and Immunology-Inflammation-Infectiology and Dermatology Department (3iD), France\\n3.\\n** Vanessa Mhanna\\n------------------------------------------------------------\\nSorbonne Université, INSERM, Immunology-Immunopathology-Immunotherapy (i3), France\\n4.\\n** Paul Stys\\n------------------------------------------------------------\\nSorbonne Université, INSERM, Immunology-Immunopathology-Immunotherapy (i3), France\\n5.\\n** Hélène Vantomme\\n------------------------------------------------------------\\nSorbonne Université, INSERM, Immunology-Immunopathology-Immunotherapy (i3), France, AP-HP, Hôpital Pitié-Salpêtrière, Clinical Investigation Center for Biotherapies (CIC-BTi) and Immunology-Inflammation-Infectiology and Dermatology Department (3iD), France\\n6.\\n** Zhicheng Zhou\\n------------------------------------------------------------\\nUniversité de Paris, Institut Cochin, France\\n7.\\n** Federica Martina\\n------------------------------------------------------------\\nAP-HP, Hôpital Pitié-Salpêtrière, Clinical Investigation Center for Biotherapies (CIC-BTi) and Immunology-Inflammation-Infectiology and Dermatology Department (3iD), France\\n8.\\n** Nicolas Coatnoan\\n------------------------------------------------------------\\nAP-HP, Hôpital Pitié-Salpêtrière, Clinical Investigation Center for Biotherapies (CIC-BTi) and Immunology-Inflammation-Infectiology and Dermatology Department (3iD), France\\n9.\\n** Michèle Barbié-Sastre\\n------------------------------------------------------------\\nAP-HP, Hôpital Pitié-Salpêtrière, Clinical Investigation Center for Biotherapies (CIC-BTi) and Immunology-Inflammation-Infectiology and Dermatology Department (3iD), France\\n10.\\n** Hang-Phuong Pham\\n------------------------------------------------------------\\nILTOO pharma, Statistical department, France\\n11.\\n** Béatrice Clemenceau\\n------------------------------------------------------------\\nCRCINA, INSERM, CNRS, Université d’Angers, Université de Nantes, France\\n12.\\n** Henri Vié\\n------------------------------------------------------------\\nCRCINA, INSERM, CNRS, Université d’Angers, Université de Nantes, France\\n13.\\n** Mikhail Shugay\\n------------------------------------------------------------\\nCenter of Life Sciences\\n14.\\n** Adrien Six\\n------------------------------------------------------------\\nSorbonne Université, INSERM, Immunology-Immunopathology-Immunotherapy (i3), France\\n15.\\n** Barbara Brandao\\n------------------------------------------------------------\\nUniversité de Paris, Institut Cochin, France\\n16.\\n** Roberto Mallone\\n------------------------------------------------------------\\nUniversité de Paris, Institut Cochin, France, Assistance Publique Hôpitaux de Paris, Service de Diabétologie et Immunologie Clinique, Cochin Hospital, France\\n17.\\n** Encarnita Mariotti-Ferrandiz\\n------------------------------------------------------------\\nSorbonne Université, INSERM, Immunology-Immunopathology-Immunotherapy (i3), France\\n18.\\n** David Klatzmann\\n------------------------------------------------------------\\nSorbonne Université, INSERM, Immunology-Immunopathology-Immunotherapy (i3), France, AP-HP, Hôpital Pitié-Salpêtrière, Clinical Investigation Center for Biotherapies (CIC-BTi) and Immunology-Inflammation-Infectiology and Dermatology Department (3iD), France\\n\\n\\n** Figures and data\\n------------------------------------------------------------\\nFigure 1.sciency picture\\n\\n\\n** Thymocyte differentiation produces clustered CDR3s with high generation probability and preferential TRB VJ gene combinations.\\n------------------------------------------------------------\\n\\nFigure 2.sciency picture\\n\\n\\n** Thymocyte differentiation produces clustered CDR3s with high publicness.\\n------------------------------------------------------------\\n\\nFigure 3.sciency picture\\n\\n\\n** Clustered public TCRs are enriched for virus-specific TCRs.\\n------------------------------------------------------------\\n\\nFigure 4.sciency picture\\n\\n\\n** Identification of polyspecific TCRs.\\n------------------------------------------------------------\\n\\nFigure 5.sciency picture\\n\\n\\n** Polyreactivity of polyspecific TCRs.\\n------------------------------------------------------------\\n\\n\\n** Editors\\n------------------------------------------------------------\\n* Senior Editor\\nTadatsugu Taniguchi\\nUniversity of Tokyo, Japan\\n* Reviewing Editor\\nUrszula Krzych\\nWalter Reed Army Institute of Research, United States\\n\\nReviewer #1 (Public Review):\\n\\nIn this paper, Quiniou and colleagues show via orthogonal methods human thymopoiesis releases a large population of CD8+ T cells harboring a/b paired TCRs that (i) have high generation probabilities and (ii) a preferential usage of some V and J genes, (iii) are shared between individuals and (iv) can each recognize and be activated by multiple unrelated viral peptides, notably from EBV, CMV and influenza.\\n\\nMajor strengths of the paper:\\n\\nQuiniou et al. generated single-cell sequencing datasets of the earliest stages of TCR beta chain gene recombination. And then showed that a subset of them is highly clustered also having high generation probability.\\n\\nThey show that these T cells can bind multiple antigens, both via the use of public antigen-specific datasets as well as corroborating experimental TCR expression and binding essays.\\n\\nMinor weaknesses:\\n\\nTo what extent is TCR clustering and high pgen and cross-individual sharing correlated? What is the pgen of the sequences clustered with the high pgen cells? Can you comment on the correlation between these three phenomena? In other words, to what extent is this surprising to see that highly clustered TCRs have higher pgen and are more shared?\\n\\nPotential Impact of the paper:\\n\\nThis work highlights an intrinsic property of the adaptive immune response: to generate TCRs with high generation probability that can efficiently bind multiple antigens. This finding has, therefore important impact on drug discovery and vaccine design.\\n\\nReviewer #2 (Public Review):\\n\\nThis study analyses the T cell receptor (TCR) repertoire of double positive human thymocytes, and compares this to mature single positive CD8 cells. The first major finding is that the repertoire post-selection is enriched for groups of TCRs with high generation probabilitites, similar sequences, and for TCRs previously annotated for viral specificity. This data is clearly presented and convincing. The extent of analysis of the human thymocyte repertoire is still very limited, and the paper adds significantly to this important question.\\n\\nThe second major finding is much more controversial. The authors first investigate the publicly available databases and show that there is a substantial proportion of TCRs which have been annotated to multiple viral specificities, a fact which is well-known to the specialists in the field, but not previously addressed. The authors acknowledge that this in silico analysis is mostly based on unpaired alpha/beta sequence data, and that the chain pairing may influence specificity. They, therefore, perform a number of functional assays, demonstrating examples of T cells which respond by interferon gamma production to more than one peptide.\\n\\nThe paper is mostly very clearly written and presented and provides some fascinating novel perspectives on T cell cross-reactivity. The findings will surely be of interest to a broad readership - indeed anyone interested in how adaptive immunity works. The link between the different sections of the paper is the weakest aspect. The relationship between thymic selection and polyspecificity, and also the real relationship between in silico \"cross-reactivity\" as evidenced by multiple annotations and the functional polyspecific T cells remains unclear. The mechanistic molecular details underlying polyspecificity also remain unclear. But overall, lots of interesting new data, and some very intriguing hypotheses for the community to follow up on.\\n\\nReviewer #3 (Public Review):\\n\\nIn this manuscript, the authors propose that there is a special, previously unrecognized, high-frequency population of a/b TCRs that are shared between people, have high generation probabilities, and react to many unrelated viral epitopes. Here is the main flow of the results, with comments on the strengths of the conclusions:\\n\\n\"Thymopoiesis selects a large and diverse set of clustered CDR3s with high generation probabilities\" – this seems correct and has been noted in earlier work by Mora and Walczak and others. Selection leads to a focusing of the CDR3 length which likely increases the degree of clustering and increases Pgen.\\n\\n\"Clustered CDR3s are enriched for publicness\" This also seems correct and again it makes sense: publicness is equivalent to having been independently rearranged (and sequenced) in another individual, which is determined by Pgen, and clustering is also determined to a large extent by Pgen (the factors that contribute to Pgen, shorter CDR3s for example, are largely shared between neighbor TCRs).\\n\\n\"Clustered public CDR3s are enriched in viral specificities\" – This claim is not justified by the data, which comes from sequence matching against literature-derived databases. Rather, what is true is that \"Clustered public CDR3s are enriched in public viral specificities\". But this might be a simple consequence of the previous observation, that \"clustered CDR3s are enriched for publicness\". One would need experimental specificity data on the very same datasets to make a conclusion about viral specificities in general.\\n\\n\"Identification of polyspecific TCRs\" – In this section, the authors report that some of the CDR3 clusters contain CDR3 sequences from literature-derived TCRs with multiple specificities. They conclude that these must represent polyspecific TCRs. The problem with this conclusion is that even having the same CDR3beta, let alone similar CDR3beta sequences, does not imply the same specificity. One can see the problem if one imagines a very deeply sequenced dataset, and focuses on a short CDR3 length with high frequency. WIth sufficient sampling, one will be able to navigate from nearly any single CDR3beta to any other CDR3beta of the same or similar length by jumping between single-mismatch variants. But this doesn't imply that all the TCRs from which these CDR3s were sampled, which likely have many different Vbeta genes and completely different TCRalpha sequences, must all bind the same thing.\\n\\n\"Binding properties of polyspecific TCRs\" – Here the authors look to validate these results with paired TCR sequences. They analyze a public dataset made available by 10X genomics, featuring single-cell gene expression, TCR sequencing, and dextramer UMI counts for ~150,000 T cells. This is an amazing dataset with lots of interesting features, but, like any large high-throughput dataset, it needs to be analyzed with care. The authors claim to see evidence for large-scale cross-reactivity. This comes mainly from a set of dextramers for A*03 and A*11-restricted peptides. But these dextramers appear to be binding in a uniquely non-specific manner (by comparison with the other dextramers) and non-TCR-dependent manner in this experiment. One can see this, for example, by comparing the consistency of binding within expanded clonotypes: for a specific dextramer like A*02-GIL(Flu), positive binding for one cell in a clonotype greatly increases the likelihood of binding for other cells in the\\nclonotype, suggesting that the binding is mediated by the TCR. This is not true for the A*03 and A*11 dextramers (except for a few expanded clonotypes in an A*11 donor). TCR sequence doesn't appear to be the determining factor for binding to these dextramers; rather it may be expression of KIR genes or other surface proteins that can interact with MHC.\\n\\n\"Polyspecific T cells are activated in vitro by multiple viral peptides\" Here the authors explore polyspecificity experimentally. First they report that polyclonal populations of T cells, sorted for binding to one dextramer, can also produce IFNgamma upon stimulation with a distinct peptide, albeit more weakly than for the cognate peptide. But it's not clear that the concentrations of the peptides are appropriate for stringently detecting cross-reactivity. Then the authors actually synthesize and characterize individual TCRs. Here what is seen is consistent with expectation and does not seem to support the idea of substantial fuzzy cross-reactivity: binding to the cognate peptide is 3-4 orders of magnitude stronger than to the alternative peptides. The only exception is the GAD 114-122 TCR, where the different peptides appear to be closer in binding strength. But in this case, the authors state that they \"analyzed their response to a set of peptides comprising their cognate peptide and\\npeptides with no significant structural commonalities, selected by testing combinatorial peptide libraries\". If the competitor peptides came from peptide library screening then the observation of strong binding to alternative peptides does not seem as surprising as a TCR that binds well to a Flu peptide, say, and also a CMV peptide, selected from a smallish set of possibilities.\\n\\nIt is pretty well established that TCRs are cross-reactive, both for nearby peptides and also for sequence-dissimilar peptides. The question is whether widespread, functionally relevant (not just dextramer binding at some concentration) poly-reactivity to diverse viral peptides is a defining feature of a large fraction of the TCR repertoire. The paper does not appear to present sufficiently strong evidence to support this claim.",
  "stage": "published",
  "published": "2022-10-20T03:00:00Z",
  "reviewedDate": "2022-10-20T03:00:00Z",
  "versionDate": "2022-10-20T03:00:00Z",
  "statusDate": "2022-10-20T03:00:00Z",
  "subjects": [
    {
      "id": "immunology-inflammation",
      "name": "Immunology and Inflammation"
    }
  ]
}
