{
  "id": "81727",
  "doi": "10.1101/2022.07.21.500925",
  "pdf": "https://www.biorxiv.org/content/10.1101/2022.07.21.500925v1.full.pdf",
  "status": "reviewed",
  "authorLine": "Phuong T. Nguyen, Hai M. Nguyen ... Vladimir Yarov-Yarovoy",
  "title": "Computational design of peptides to target Na<sub>V</sub>1.7 channel with high potency and selectivity for the treatment of pain",
  "indexContent": "* Structural Biology and Molecular Biophysics (https://elifesciences.org/subjects/structural-biology-molecular-biophysics)\\n\\n\\n** Computational design of peptides to target Na[V]1.7 channel with high potency and selectivity for the treatment of pain\\n------------------------------------------------------------\\n1. Phuong T. Nguyen\\n2. Hai M. Nguyen\\n3. Karen M. Wagner\\n4. Robert G. Stewart\\n5. Vikrant Singh\\n6. Parashar Thapa\\n7. Yi-Je Chen\\n8. Mark W. Lillya\\n9. Anh Tuan Ton\\n10. Richard Kondo\\n11. Andre Ghetti\\n12. Michael W. Pennington\\n13. Bruce Hammock\\n14. Theanne N. Griffith\\n15. Jon T. Sack\\n16. Heike Wulff\\n17. Vladimir Yarov-Yarovoy\\n\\n1. Department of Physiology and Membrane Biology, University of California Davis\\n\\n\\nUSA\\n2. Department of Pharmacology, University of California Davis\\n\\n\\nUSA\\n3. Department of Entomology and Nematology & Comprehensive Cancer Center, University of California Davis\\n\\n\\nUSA\\n\\n...show 4 more\\n* https://doi.org/10.7554/eLife.81727.1\\n\\n* Open access (https://en.wikipedia.org/wiki/Open_access)\\n* Copyright information (https://creativecommons.org/licenses/by/4.0/)\\n\\n\\n** Reviewed Preprint\\n------------------------------------------------------------\\n\\nThis preprint was published after peer review by eLife.\\n* downloadDownload (#)\\n\\nPosted to bioRxiv\\n22 July 2022Go to bioRxiv (https://www.biorxiv.org/content/10.1101/2022.07.21.500925)\\n\\nSent for peer review\\n21 July 2022\\n\\n* Full text\\n* Figures and data\\n* Peer review\\n\\n* Abstract (#abstract)\\n* eLife assessment (#assessment)\\n* Introduction (#s1)\\n* Results (#s2)\\n* Discussion (#s3)\\n* Methods (#s4)\\n* References (#references)\\n* Author Information (#author-list)\\n\\n\\n** Abstract\\n------------------------------------------------------------\\nThe voltage-gated sodium Na[V]1.7 channel plays a key role as a mediator of action potential propagation in C-fiber nociceptors and is an established molecular target for pain therapy. ProTx-II is a potent and moderately selective peptide toxin from tarantula venom that inhibits human Na[V]1.7 activation. Here we used available structural and experimental data to guide Rosetta design of potent and selective ProTx-II-based peptide inhibitors of human Na[V]1.7 channels. Functional testing of designed peptides using electrophysiology identified the PTx2-3127 and PTx2-3258 peptides with IC[50]s of 7 nM and 4 nM for hNa[V]1.7 and more than 1,000-fold selectivity over human Na[V]1.1, Na[V]1.3, Na[V]1.4, Na[V]1.5, Na[V]1.8, and Na[V]1.9 channels. PTx2-3127 inhibits Na[V]1.7 currents in mouse and human sensory neurons and shows efficacy in rat models of chronic and thermal pain when administered intrathecally. Rationally-designed peptide inhibitors of human Na[V]1.7 channels have transformative\\npotential to define a new class of biologics to treat pain.\\n\\neLife assessment\\n\\nThe authors of this manuscript set out to improve on a peptide, ProTxII, which had been previously put forward as a promising blocker of Nav1.7 channels and thus offers a possible non-opiate way to block pain. They develop a useful computational workflow that is based on in silico manipulations of the interaction of ProTxII with a Na channel structure determined previously and evaluation of the predicted mutations with electrophysiology. The authors succeed in producing two peptides with improved selectivity for Nav1.7 over other subtypes and capable of producing ion channel block at low concentrations and the experimental evidence presented is solid, and the general applicability of the method is compelling.\\n* Read the peer reviews (#)\\n* About eLife assessments (https://elifesciences.org/inside-elife/db24dd46)\\n\\n\\n** Introduction\\n------------------------------------------------------------\\n\\nMore than 25 million Americans suffer from chronic pain (Nahin, 2015 (#c53) ). Chronic pain originates from tissue or nervous system damage and persists longer than three months (Treede et al., 2015 (#c72) ). The many causes of chronic pain include surgery, chemotherapy, complex regional pain syndrome, and back pain. People with chronic pain experience higher anxiety, depression, sleep disturbances, and gain weight due to decreased physical activity. Non-opioid treatment options for chronic pain are limited (Seal, Becker, Tighe, Li, & Rife, 2017 (#c65) ). Inhibitors of neuronal ion channels are important alternatives that have not demonstrated addiction liability. Non-selective Na[V] channel inhibitors, including carbamazepine, lacosamide, and lamotrigine are used among initial options to treat patients with chronic pain (Beyreuther et al., 2007 (#c9) Wiffen, Derry, & Moore, 2011 (#c76) Wiffen, Derry, Moore, & Kalso, 2014 (#c77) ). For example, intravenous infusion of the local anesthetic\\nlidocaine, a non-specific Na[V] channel inhibitor, reduces chronic pain in some patients (Hutson, Backonja, & Knurr, 2015 (#c37) Iacob et al., 2018 (#c38) Kandil, Melikman, & Adinoff, 2017 (#c42) van der Wal et al., 2016 (#c73) ). However, lidocaine treatments have serious side effects including cardiac arrest, abnormal heartbeat, and seizures. Patients with chronic pain who are not responding to Na[V] channel inhibitors can be prescribed opioids, but the severe side effects of opioids such as constipation, respiratory depression, and addiction limit their utility. Intrathecal infusion of the voltage-gated calcium channel inhibitor ziconotide is also effective against chronic pain (Backryd, 2018 (#c4) Deer et al., 2018 (#c21) ) but accompanied by serious psychiatric side effects (Backryd, 2018 (#c4) ). Consequently, the treatment of chronic pain remains a major unmet medical need. Na[V] channels have been thoroughly clinically validated as pharmacological targets for pain treatment, but\\ncurrently available therapies are limited by incomplete efficacy and significant side effects (Bhattacharya, Wickenden, & Chaplan, 2009 (#c10) Dib-Hajj, Cummins, Black, & Waxman, 2010 (#c23) Kaczorowski, McManus, Priest, & Garcia, 2008 (#c41) Liu & Wood, 2011 (#c47) Mulroy, 2002 (#c51) Walia, Khan, Ko, Raza, & Khan, 2004 (#c74) ).\\n\\nNociceptive signals originate in peripheral nerve fibers that transduce chemical, mechanical, or thermal stimuli into action potentials that propagate along their axons to the synaptic nerve terminals in the spinal dorsal horn (Basbaum, Bautista, Scherrer, & Julius, 2009 (#c5) Dib-Hajj et al., 2010 (#c23) Dib-Hajj, Yang, Black, & Waxman, 2013 (#c24) Waxman & Zamponi, 2014 (#c75) ). Voltage-gated sodium (Na[V]) channels are key molecular determinants of action potential generation and propagation in excitable cells. Of the nine known human Na[V] (hNa[V]) channel subtypes (Catterall, Goldin, & Waxman, 2005 (#c16) ), genetic and functional studies identified three subtypes as important for pain signaling: Na[V]1.7, Na[V]1.8, and Na[V]1.9, which are predominantly expressed in peripheral neurons (Bennett, Clark, Huang, Waxman, & Dib-Hajj, 2019 (#c8) Black, Nikolajsen, Kroner, Jensen, & Waxman, 2008 (#c12) Cox et al., 2006 (#c19) Cummins, Dib-Hajj, & Waxman, 2004 (#c20) Dib-Hajj et al., 2010\\n(#c23) Dib-Hajj et al., 2013 (#c24) Estacion et al., 2009 (#c28) Fertleman et al., 2006 (#c29) Goldberg et al., 2012 (#c33) Nassar et al., 2004 (#c54) Reimann et al., 2010 (#c61) Shields et al., 2012 (#c69) Yang et al., 2012 (#c82) Yang et al., 2004 (#c83) ). Na[V]1.7 possesses a slow closed-state inactivation compared to other channels (Herzog, Cummins, Ghassemi, Dib-Hajj, & Waxman, 2003 (#c35) ), making it uniquely important for setting the threshold for action potential firing, and thus the gain in pain signaling neurons (Dib-Hajj, Cummins, Black, & Waxman, 2007 (#c22) Rush, Cummins, & Waxman, 2007 (#c62) ). In accordance with this, loss-of-function mutations in hNa[V]1.7 have been identified in families with congenital insensitivity to pain (Cox et al., 2006 (#c19) ). Gain-of-function mutations in hNa[V]1.7 lead to inherited pain disorders; families with inherited erythromelalgia have hNa[V]1.7 mutations that shift its voltage-dependence of activation to hyperpolarized voltages, leading\\nto hyperexcitability in dorsal root ganglion (DRG) neurons and chronic neuropathic pain (Cummins et al., 2004 (#c20) Yang et al., 2004 (#c83) ); patients with paroxysmal extreme pain disorder have defects in hNa[V]1.7 fast inactivation resulting in persistent sodium currents and episodic burning pain (Fertleman et al., 2006 (#c29) ). These and other studies have validated hNa[V]1.7 as a prime target for the treatment of pain (Dib-Hajj et al., 2010 (#c23) Dib-Hajj et al., 2013 (#c24) Waxman & Zamponi, 2014 (#c75) ).\\n\\nMammalian Na[V] channels are composed of four homologous domains (I through IV), each containing six transmembrane segments (S1 through S6), with segments S1-S4 of the channel forming the voltage-sensing domain (VSD) and segments S5 and S6 forming the pore (Ahern, Payandeh, Bosmans, & Chanda, 2016 (#c2) Payandeh, Scheuer, Zheng, & Catterall, 2011 (#c59) Shen, Liu, Wu, Lei, & Yan, 2019a (#c66) Shen et al., 2017 (#c68) ). The binding of local anesthetics to a receptor site formed within the pore inner cavity can directly block ion conduction through the Na[V] channels (Ragsdale, McPhee, Scheuer, & Catterall, 1994 (#c60) Yarov-Yarovoy et al., 2001 (#c84) Yarov-Yarovoy et al., 2002 (#c85) ). However, because of the high conservation of residues forming this local anesthetic receptor site among the different isoforms, all currently available therapeutic drugs targeting Na[V] channels are non-specific.\\n\\nThere is a growing trend in industry and academia to target ion channels with biologics (Bosmans & Swartz, 2010 (#c13) Neff & Wickenden, 2021 (#c55) Payandeh & Hackos, 2018 (#c58) Wulff, Christophersen, Colussi, Chandy, & Yarov-Yarovoy, 2019 (#c79) ). More than ten years ago scientists at Merck demonstrated that a peptide from the venom of the Peruvian green velvet tarantula Thrixopelma pruriens, termed Protoxin-II (ProTx-II), selectively targeted the Na[V]1.7 channel subtype and blocked action potential propagation in nociceptors (Schmalhofer et al., 2008 (#c64) ). Amgen also developed peptide inhibitors of Na[V]1.7 and identified a novel peptide toxin from the venom of the Chilean tarantula Grammostola porteria, termed GpTx-1, which was a less potent inhibitor of human Na[V]1.7, compared to ProTx-II, but had 20-fold and 1,000 fold selectivity against Na[V]1.4 (predominantly expressed in muscle) and Na[V]1.5 (predominantly expressed in the heart) (Murray et al., 2015 (#c52) ). Using the\\nGpTx-1 NMR structure as a guide, Amgen scientists created a variant with improved potency and selectivity compared to the wild-type toxin, concluding that GpTx-1 variants can potentially be further developed as peptide therapeutics (Murray et al., 2015 (#c52) ). The most advanced reported preclinical development of Na[V]-selected peptides is from Janssen Biotech, which demonstrated that ProTx-II exerted a strong analgesic effect following intrathecal injection in rat models of thermal and chemical nociception. While efficacious, ProTx-II had a narrow therapeutic window, and induced profound motor effects at moderately higher doses, consistent with inhibition of Na[V] channel subtypes present on motor neurons (Na[V]1.1 and Na[V]1.6) (Flinspach et al., 2017 (#c31) ). Janssen Biotech pursued resource-intensive optimization of ProTx-II, but without a structure to guide optimization. This blind optimization process produced 1,500 ProTx-II variants, including a peptide, named JNJ63955918, with at\\nleast 100-fold selectivity for Na[V]1.7 over all other Na[V] channel subtypes tested. However, JNJ63955918 had ∼10-fold reduced affinity for Na[V]1.7 (Flinspach et al., 2017 (#c31) ). The in vivo safety window for JNJ63955918 was 7-16-fold, limited by motor deficits and muscle weakness, consistent with insufficient selectivity against off-target Na[V] channels (Flinspach et al., 2017 (#c31) ). More recently, Merck developed ProTx-II analogues with improved selectivity for Na[V]1.7, reduced ability to cause mast cell degranulation, and enhanced in vivo profile (Adams et al., 2022 (#c1) ).\\n\\nWhile these prior and ongoing efforts have not succeeded in developing peptides with a sufficiently wide in vivo safety window, the premise that Na[V] channel blocking peptide affinity and selectivity could be further optimized remains valid (Payandeh & Hackos, 2018 (#c58) ). Furthermore, several high-resolution structures of peptide toxins complexes with human Na[V] channels were solved recently (Clairfeuille et al., 2019 (#c18) Pan et al., 2019 (#c56) Shen, Liu, Wu, Lei, & Yan, 2019b (#c67) Xu et al., 2019 (#c81) ), providing essential templates for the structure-guided design of novel therapeutics. These structures revealed key molecular determinants of ProTx-II interaction with the hNa[V]1.7 channel in both deactivated and activated states (Shen et al., 2019b (#c67) Xu et al., 2019 (#c81) ). To overcome past issues with peptide optimization, we used the Rosetta computational protein redesign approach, available experimental data, and functional testing of designed peptides using\\nelectrophysiological assays, mouse and human sensory neurons, stability assays, and efficacy testing in animal models of pain to generate high-affinity, selective inhibitors of human Na[V]1.7 channels. Our lead peptides have better potency and selectivity than Janssen’s most potent and selective ProTx-II variant. Our lead peptide inhibits sodium current in human and mouse sensory neurons, is stable in artificial cerebrospinal fluid, and is active in rat models of thermal and chronic pain.\\n\\n\\n** Results\\n------------------------------------------------------------\\n\\n\\n** Design of ProTx-II based peptides targeting hNa[V]1.7\\n------------------------------------------------------------\\n\\nTo optimize potency and selectivity of ProTx-II based peptides to target hNa[V]1.7, we analyzed x-ray and cryoEM structures of ProTx-II – hNa[V]1.7 complexes (Shen et al., 2019a (#c66) Xu et al., 2019 (#c81) ), explored available experimental data on hNa[V]1.7 interactions with ProTx-II and its homologs (Moyer et al., 2018 (#c50) Murray et al., 2015 (#c52) Park et al., 2014 (#c57) Wu et al., 2018 (#c78) Xu et al., 2019 (#c81) Zeng et al., 2007 (#c86) ), modeled specific interactions of ProTx-II substitutions with hNa[V]1.7, and designed new ProTx-II variants using Rosetta (Bender et al., 2016 (#c7) Kuhlman et al., 2003 (#c44) ). Our interdisciplinary and iterative peptide optimization approach is described below and outlined in Figure 1 (#fig1) .\\nFigure 1.sciency picture\\n\\nThe ProTx-II based peptide optimization approach. Top, transmembrane (left) and extracellular (right) views of the wild-type ProTx-II – hNav1.7 structure in a deactivated state (Xu et al., 2019 (#c81) ) Key residues on the wild-type ProTx-II are shown in stick representation and labeled. Bottom, interdisciplinary peptide optimization approach involving Rosetta design, molecular dynamics (MD) simulations, peptide synthesis and folding, electrophysiological testing, peptide stability testing, efficacy in mouse and human DRG neurons, and efficacy in animal models of pain.\\n\\n\\n** 1st optimization round\\n------------------------------------------------------------\\n\\nDuring the first round of optimization, we introduced multiple ProTx-II substitutions guided by available experimental data and insights from the cryoEM structure of the ProTx-II – Na[V]Ab/hNa[V]1.7 chimera complex in a deactivated state (PDB: 6N4R) (Xu et al., 2019 (#c81) ). To improve potency in all of our ProTx-II based peptides, we used the C-terminal amidation based on previously published data (Park et al., 2014 (#c57) ). The ProTx-II – Na[V]Ab/hNa[V]1.7 structure revealed that ProTx-II residues W5 and M6 are positioned in the membrane hydrophobic core and make contact with the unique residue F813 on the S3 segment of hNa[V]1.7 VSD-II (F812 in the Na[V]Ab/hNa[V]1.7 structure) (Xu et al., 2019 (#c81) ) (Figure 1 (#fig1) and Figure 1—figure supplement 1 (#fig1S1) ). We introduced the W5A and M6F substitutions in ProTx-II with the insight from an Amgen’s study showing that the double mutant F5A/M6F on GpTx-1 (ProTx-II homolog) improved selectivity for hNa[V]1.7 over hNa[V]1.4 (Murray et\\nal., 2015 (#c52) ) and reasoning that optimized interactions with F813 may improve ProTx-II based peptide selectivity. In addition, the ProTx-II – Na[V]Ab/hNa[V]1.7 structure revealed that the hydrophobic residue V20 is positioned in a hydrophilic environment and faces the hNa[V]1.7 VSD-II S3-S4 loop region (Figure 1 (#fig1) and Figure 1—figure supplement 1 (#fig1S1) ). Based on the sequence comparison of ProTx-II to other highly potent peptide toxins targeting the hNa[V]1.7 VSDII S3-S4 loop region (see Figure 1—figure supplement 2 (#fig1S2) ), we noticed that ProTx-III (hNa[V]1.7 IC[50] = 11.5 nM) has Lysine and JzTx-V (hNa[V]1.7 IC[50] = 0.6 nM) has Arginine (Cardoso et al., 2015 (#c15) Moyer et al., 2018 (#c50) ) at the position equivalent to the V20 in ProTx-II. Rosetta modeling of the ProTx-II V20R mutant suggested that arginine could form a salt bridge with D816 on the hNa[V]1.7 VSD-II S3-S4 loop region (Figure 2A (#fig2) and B (#fig2) ). Because D816 is only present in the hNa[V]1.7\\nand hNa[V]1.6 subtypes among all human Na[V] channels (see Figure 2—figure supplement 1 (#fig2S1) ), we made the V20R substitution to potentially improve selectivity for hNa[V]1.7. A Genentech study demonstrated that substituting R22 with nor-arginine (norR) and K26 with arginine improves ProTx-II potency to below IC[50] = 0.1 nM for hNa[V]1.7 (Xu et al., 2019 (#c81) ). Amgen’s study demonstrated that substituting K28 with glutamate improves the selectivity of JzTx-V for hNa[V]1.7 over Na[V]1.4 and Na[V]1.5 (Moyer et al., 2018 (#c50) ). Based on these data, we substituted ProTx-II R22 with norR, K26 with arginine, and K28 with glutamate (Figure 2A (#fig2) and B (#fig2) ). We also substituted M19 with leucine to improve peptide stability by preventing methionine-dependent oxidation.\\nFigure 2.sciency picture\\n\\nThe first optimization round. (A) Sequence alignment of the wild-type ProTx-II with PTx2-2954 and PTx2-2955 peptides. (B) Transmembrane (left panel) and extracellular (right panel) views of the PTx2-2955 – hNa[V]1.7 model. Key residues on the PTx2-2955 and hNa[V]1.7 are shown in stick representation and labeled. Nitrogen atoms are colored in blue and oxygen atoms are colored in red. Hydrogen bonds between donor and acceptor atoms are shown by blue dash line. (C) Block of whole-cell hNa[V]1.7 sodium currents by application of increasing concentrations of PTx2-2955 and followed by 1 mM of wild-type ProTx-II as indicated. (D) Inhibition of hNa[V]1.7 currents was measured as shown in C and plotted as a function of WT ProTx-2 or PTx2-2955 concentration. Fitting the Hill equation to the data yielded IC[50] values (95% confidence interval) of 1.7 [0.5, 2.9] nM (n = 3) for WT ProTx-II and 185.0 [152.1, 217.9] nM (n = 5) for PTx2-2955, respectively.\\n\\nWe incorporated these substitutions into two designed ProTx-II variants named PTx2-2954 and PTx2-2955 (Figure 2A (#fig2) ). Specifically, PTx2-2954 contains the W5A, M6F, M19L, V20R, R22norR, and K28E substitutions and the PTx2-2955 variant contains the W5A, M6F, M19L, V20R, R22norR, K26R, and K28E substitutions (Figure 2A (#fig2) ). The potency of PTx2-2954 and PTx2-2955 for hNa[V]1.7 was determined using whole-cell voltage-clamp recordings in HEK 293 cells as described in the Methods. PTx2-2955 inhibited hNa[V]1.7 currents with an IC[50] of 185 nM (Figure 2C (#fig2) and D (#fig2) ). However, PTx2-2954 had no effect on hNa[V]1.7 currents at 5 µM despite having only an arginine versus lysine difference at position 26 (Figure 2A (#fig2) ). We speculate that the PTx2-2954 peptide may have been misfolded. Based on these results, PTx2-2955 peptide was selected as the most potent peptide from the 1^st optimization round.\\n\\n\\n** 2nd optimization round\\n------------------------------------------------------------\\n\\nWhile the potency of PTx2-2955 was not in the low nanomolar range, the molecular interactions revealed by computational modeling were useful for further rounds of optimization. R26 in PTx2-2955 has extensive contacts with VSD-II and forms a salt bridge with E811 (Figure 3A (#fig3) and B (#fig3) ). In addition, a hydrogen-bonding network is formed between residues R20, E28 on PTx2-2955 with D816 on VSD-II, a unique residue in hNa[V]1.7 and hNa[V]1.6 (Figure 2—figure supplement 1 (#fig2S1) ). We reasoned that such interactions are important for selectivity and given that the ProTx-II – VSD-II protein-protein interface is highly polar, room for further optimization of the molecular interface of ProTx-II and VSD-II may be limited. We preserved these interactions in this round of optimization and explored substitutions at other positions.\\nFigure 3.sciency picture\\n\\nThe second optimization round. (A) Sequence alignment of the wild-type ProTx-II with PTx2-2955 and PTx2-2963 - PTx2-2967 peptides. (B) Transmembrane (left panel) and extracellular (right panel) views of the PTx2-3066 – hNa[V]1.7 model. Key residues on the PTx2-3066 and hNa[V]1.7 are shown in stick representation and labeled. Nitrogen atoms are colored in blue and oxygen atoms are colored in red. Hydrogen bonds between donor and acceptor atoms are shown by blue dash line. (C) Block of whole-cell hNa[V]1.7 sodium currents by application of increasing concentrations of PTx2-3066. (D) Inhibition of hNa[V]1.7 currents was measured as shown in C and plotted as a function concentration of PTx2-2955 or its derivatives. Fitting the Hill equation to the data yielded IC[50] values (95% confidence interval) of 185.0 [152.1, 217.9] nM (n = 5), 154.0 [39.9, 268.1] nM (n = 3), nM, 52.6 [7.0, 98.2] nM (n = 3), 73.9 [55.8, 92.0] nM (n = 4), 30.8 [27.9, 33.7] nM (n = 6), and 48.3 [29.5, 67.1] nM (n = 4) for\\nPTx2-2955, PTx2-3063, PTx2-3064, PTx2-3065, PTx2-3066, and PTx2-3067, respectively.\\n\\nSpecifically, we designed PTx2-3063 based on PTx2-2955 with an extra substitution E12A which was reported to improve the potency of ProTx-II for hNa[V]1.7 (Park et al., 2014 (#c57) ). Notably, in the presence of R26, Norarginine at position 22 does not form a salt bridge with D816 on VSD-II despite being in proximity based on the PTx2-2955 model (Figure 3B (#fig3) ). We mutated the Norarginine back to Arginine to promote the hydrogen bond with D816 as it appeared in the wt ProTx-II (Figure 1 (#fig1) ) and incorporated this into the design of PTx2-3064. In the presence of R22, the hydrogen bond network at the interacting interface is expanded to E28, R20, and R22 on ProTx-II and D816 on VSDII (Figure 3B (#fig3) ). We further used Rosetta computational design to explore sequence variants at the non-interface positions of ProTx-II, explicitly looking for substitutions that can stabilize the ProTx-II scaffold or the interface hydrogen bond network while taking into account potential favorable\\ninteractions with lipids (see Methods). We also changed the double mutants W5A/M6F back to the wild-type residues in the design process due to the lack of superior engagement with F813 (VSD-II) shown in the PTx2-2955 model. We used Rosetta FastDesign (Maguire et al., 2021 (#c48) ) to introduce ProTx-II substitutions and design new peptide variants as described in Methods. Among the ProTx-II based peptide consensus sequences designed by Rosetta (Figure 3—figure supplement 1 (#fig3S1) ), we selected the double mutant S11K/E12D and W7Q to introduce in this round. S11K/E12D allows a salt bridge to be formed between K and D while Q7 forms a hydrogen bond with a backbone carbonyl atom on ProTx-II, thus potentially stabilizing the ProTx-II scaffold and the hydrogen bond network between E28, R20, and R22 on ProTx-II and D816 on VSD-II (Figure 3B (#fig3) ). We combined these substitutions with other substitutions previously reported to improve potency or selectivity. In particular, the Rosetta\\nsuggested substitution W7Q in addition to Y1Q, and W30L was shown to improve selectivity while M19F improved potency for hNa[V]1.7 (Flinspach M, Neff R, Liu Y, & al., 2015; (Neff & Wickenden, 2021 (#c55) )). To reduce the potential of misfolding due to multiple substitutions, we strategically introduced these changes into three designed variants PTx2-3065, PTx2-3066, and PTx2-3067.\\n\\nPTx2-3063 and PTx2-3064 peptides containing the same W5A and M6F mutations as PTx2-2955 inhibited hNa[V]1.7 currents with IC[50]s of 154 and 52.6 nM, respectively (Figure 3C (#fig3) and D (#fig3) ). PTx2-3065, PTx2-3066, and PTx2-3067 peptides containing the wild-type W5 and M6 residues inhibited hNa[V]1.7 current with IC[50] values equal to 73.9, 30.8, and 48.3 nM, respectively (Figure 3D (#fig3) ). We further tested the selectivity of PTx2-3064 and PTx2-3066 peptides for hNa[V]1.7 versus other Na[V] channels (Figure 3—figure supplement 2 (#fig3S2) ). PTx2-3064 and PTx2-3066 peptides blocked hNa[V]1.2 current by ∼92 and ∼41% at 10 µM, respectively. PTx2-3064 and PTx2-3066 peptides blocked hNa[V]1.5 current by ∼25 and ∼1% at 10 µM, respectively. PTx2-3064 and PTx2-3066 peptides blocked hNa[V]1.4 current by ∼66% and ∼34% at 10 µM, respectively (Figure 3—figure supplement 2 (#fig3S2) ). Based on these results, PTx2-3066 peptide was selected as the most potent and selective peptide from the 2\\n^nd optimization round.\\n\\n\\n** 3rd optimization round\\n------------------------------------------------------------\\n\\nBuilding on the design of PTx2-3066, we explored other combinations of Rosetta suggested substitutions and the reportedly improved potency/selectivity substitutions. Y1Q and M19F from the design of PTx2-3067 were merged into PTx2-3066 with and without the double mutant W5A/M6F to generate new designs PTx2-3126 and PTx2-3127, respectively. In another design, PTx2-3128, we explored whether the scaffold stabilizing double mutant suggested by Rosetta, S11K/E12D, is indeed important for selectivity by introducing the potency improving substitution E12A, which was used in the previous round (Figure 4A (#fig4) and B (#fig4) ).\\nFigure 4.sciency picture\\n\\nThe third optimization round. (A) Sequence alignment of the wild-type ProTx-II with PTx2-3066 and PTx2-3127 - PTx2-3128 peptides. (B) Transmembrane (left panel) and extracellular (right panel) views of the PTx2-3127 – hNa[V]1.7 model. Key residues on the PTx2-3127 and hNa[V]1.7 are shown in stick representation and labeled. Nitrogen atoms are colored in blue and oxygen atoms are colored in red. Hydrogen bonds between donor and acceptor atoms are shown by blue dash line. (C) Block of whole-cell hNa[V]1.7 sodium currents by application of increasing concentrations of PTx2- 3127. (D) Inhibition of hNa[V]1.7 currents was measured as shown in C and plotted as a function concentration of PTx2-3066 or its derivatives. Fitting the Hill equation to the data yielded the IC[50] values (95% confidence interval) of 30.8 [27.9, 33.7] nM (n = 6), 2.3 [1.9, 2.7] µM (n = 3), 6.9 [6.7, 7.1] nM (n = 3), and 5.0 [4.6, 5.4] nM (n = 3) for PTx2-3066, PTx2-3126, PTx2-3127, PTx2-3128, respectively.\\n\\nThe PTx2-3126 peptide containing the W5A and M6F mutations from PTx2-2955 and other mutations from PTx2-3066 inhibited hNa[V]1.7 currents with an IC[50] = 2.3 µM (Figure 4D (#fig4) ). PTx2-3127 and PTx2-3128 containing the wild-type W5 and M6 residues and other mutations from PTx2-3066 inhibited hNa[V]1.7 current with IC[50]s equal to 6.9 and 5.0 nM, respectively (Figure 4D (#fig4) ). We tested the selectivity of PTx2-3127 and PTx2-3128 for hNa[V]1.7 versus other Na[V] channels (see Figure 4—figure supplement 1 (#fig4S1) ). PTx2-3127 inhibited other Na[V] channels with the following IC[50] values: 17 µM (hNa[V]1.1), 5 µM (hNa[V]1.2), 20 µM (rNa[V]1.3), 12 µM (hNa[V]1.4), >137 µM (hNa[V]1.5), 608 nM (hNa[V]1.6), >150 µM (hNa[V]1.8), and 150 µM (hNa[V]1.9) (see Tables 1 (#tbl1) and 2 (#tbl2) ). The data show that PTx2-3127 is at least 1,000-fold selective for hNa[V]1.7 versus hNa[V]1.1, hNa[V]1.3, hNa[V]1.4, hNa[V]1.5, hNa[V]1.8, and hNa[V]1.9. Notably, PTx2-3127 peptide exhibits similar\\neffects on steady-state activation and inactivation on hNav1.7 currents (Figure 4—figure supplement 2 (#fig4S2) ), suggesting that it retains a similar mechanism of action as ProTx-II and other published ProTx-II derivatives (Flinspach et al., 2017 (#c31) Schmalhofer et al., 2008 (#c64) Smith, Cummins, Alphy, & Blumenthal, 2007 (#c71) Xiao, Blumenthal, Jackson, Liang, & Cummins, 2010 (#c80) ). However, further improvement is needed for the optimized peptide selectivity for hNa[V]1.7 versus hNa[V]1.2 and hNa[V]1.6. PTx2-3128 inhibited other Na[V] channels with the following IC[50] values: 3.3 µM (hNa[V]1.1), 570 nM (hNa[V]1.2), 23 µM (rNa[V]1.3), 22 µM (hNa[V]1.4), 34 µM (hNa[V]1.5), 358 nM (hNa[V]1.6), 10 µM (hNa[V]1.8), and 8 µM (hNa[V]1.9). Based on these results, PTx2-3127 peptide was selected as the most potent and selective peptide from the 3^rd optimization round.\\nTable 1.sciency picture\\n\\n\\n** Selectivity profile of PTx2-3127 and PTx2-3258 peptides for hNav1.7 versus all other human Nav channels.\\n------------------------------------------------------------\\nTable 2.sciency picture\\n\\n\\n** Comparison of selectivity profiles of PTx2-3127 and PTx2-3258 peptides for hNav1.7 versus hNav1.2, hNav1.4, hNav1.5, and hNav1.6 channels.\\n------------------------------------------------------------\\n\\n\\n** 4th optimization round\\n------------------------------------------------------------\\n\\nIn the final optimization round, we sought to improve the design of PTx2-3127 by introducing substitution Y1H into the design PTx2-3258 (Figure 5A (#fig5) ). Histidine appeared most frequently in the top Rosetta designs at position 1 (see Figure 3—figure supplement 1 (#fig3S1) ). The structural model showed a hydrogen bond formed with a backbone carbonyl atom on ProTx-II (Figure 5B (#fig5) ) thus potentially stabilizing the ProTx-II scaffold. Building upon PTx2-3258, we replaced Methionine at position 6 by Norleucine to prevent oxidation and incorporated the change in the design of PTx2-3061. All previously tested substitutions selected by Rosetta were hydrogen bond promoting substitutions. In the design of PTx2-3259, we tested if the Q3L substitution suggested by Rosetta (see Figure 3—figure supplement 1 (#fig3S1) ) could create an additional stabilizing effect. We selected the third most frequently observed amino acid at this position, Leu based on an experimental design protocol with the\\nmembrane scoring function (Alford, Fleming, Fleming, & Gray, 2020 (#c3) ). Lastly, we attempted to explore non-canonical amino acids at positions 27 and 29 to examine whether the selectivity of PTx2-3258 can be improved further given that these positions are near F813 (VSD-II). This resulted in the design of PTx2-3260 with 2,4-dimethyl-phenylalanine and tert-butyl-cysteine at positions 27 and 29, respectively.\\nFigure 5.sciency picture\\n\\nThe fourth optimization round. (A) Sequence alignment of the wild-type ProTx-II with PTx2-3127, PTx2-3258, PTx2-3259, PTx2-3260, and PTx2-3361 peptides. (B) Transmembrane (left panel) and extracellular (right panel) views of the PTx2-3258 – hNa[V]1.7 model. Key residues on the PTx2-3258 and hNa[V]1.7 are shown in stick representation and labeled. Nitrogen atoms are colored in blue and oxygen atoms are colored in red. Hydrogen bonds between donor and acceptor atoms are shown by blue dash line. (C) Block of whole-cell hNa[V]1.7 sodium currents by application of increasing concentrations of PTx2-3258 and followed by 1 mM of wild-type ProTx-II as indicated. (D) Inhibition of hNa[V]1.7 currents was measured as shown in C and plotted as a function concentration of PTx2-3127 or its derivatives. Fitting the Hill equation to the data yielded the IC[50] values (95% confidence interval) of 6.9 [6.7, 7.1] nM (n = 3), 3.8 [0.3, 7.3] nM (n = 5), 41.8 [16.5, 67.1] nM (n = 3), 20.8 [12.4, 29.2] nM (n = 3),\\n8.6 [5.6, 11.6] nM (n = 3), nM for PTx2-3127, PTx2-3258, PTx2-3259, PTx2-3260, and PTx2-3361, respectively.\\n\\nFunctional characterization of the activity of the peptides PTx2-3258 – PTx2-3260 and PTx2-3361 on the wild-type hNa[V]1.7 expressed in HEK 293 cells analyzed by whole-cell voltage-clamp was performed as described in Methods. The ProTx-II variants inhibited the hNa[V]1.7 channel with the following IC[50] values: PTx2-3258 (3.8 nM), PTx2-3259 (41.8 nM), PTx2-3260 (21.0 nM), and PTx2-3361 (9.0 nM) (see Figure 5C (#fig5) and D, Figure 5—figure supplement 1 (#fig5S1) , and Tables 1 (#tbl1) and 2 (#tbl2) ).\\n\\nWe tested the broader selectivity of PTx2-3127 and PTx2-3258 on hERG channels. The ProTx-II variants inhibited the hERG channel with the following IC[50] values: PTx2-3127 (1.9 µM) and PTx2-3258 (1.9 µM) (see Table 1 (#tbl1) ). Therefore, PTx2-3127 has 272-fold and PTx2-3258 has 496-fold selectivity for hNa[V]1.7 versus hERG.\\n\\n\\n** Stability of designed peptides in artificial cerebrospinal fluid\\n------------------------------------------------------------\\n\\nTo access the biologically relevant stability of the wild-type ProTx-II, PTx2-3127, and PTx2-3258, peptides were incubated in artificial cerebrospinal fluid (aCSF) as described in Methods and their stability was determined by HPLC. Notably, the wild-type ProTx-II, PTx2-3127, and PTx2-3258 were found to be stable in aCSF at 37°C for more than 50 hours (Figure 5—figure supplement 2 (#fig5S2) ).\\n\\n\\n** Efficacy of designed peptides on mouse nociceptor DRG neurons\\n------------------------------------------------------------\\n\\nNa[V]1.7 is important for pain signaling in mice (Gingras et al., 2014 (#c32) Nassar et al., 2004 (#c54) ). As mice are valuable preclinical models for therapeutic development it is important to know whether mouse endogenous Na[V]1.7 is responsive to any therapeutic candidate (Beckley et al., 2021 (#c6) Shiers, Klein, & Price, 2020 (#c70) ). We studied the effects of PTx2-3127 on Na[V] currents of genetically-identified mouse nociceptor sensory neurons. MrgprD^+ nonpeptidergic nociceptors were identified by fluorescence in MrgprD^GFP mice (Zylka, Rice, & Anderson, 2005 (#c89) ). MrgprD^GFP DRG neurons from adult mice have significant expression of mRNA for Na[V]1.7, Na[V]1.8 and Na[V]1.9 with other Na[V] transcripts in much lower abundance (Na[V]1.8 ∼ Na[V]1.9 > Na[V]1.7 >> Na[V]1.6 >> Na[V]1.1) (Zheng et al., 2019 (#c88) ). Presence of Na[V]1.7 protein in DRG neurons of the MrgprD^GFP mouse line used for electrophysiology was confirmed by observation of anti-Na[V]1.7 immunofluorescence in\\nMrgprD^GFP DRG neuron cell bodies and axonal processes (Figure 6A (#fig6) ), consistent with prior reports of Na[V]1.7 localization to small, unmyelinated neurons (Black, Frezel, Dib-Hajj, & Waxman, 2012 (#c11) ). Anti-Na[V]1.7 immunofluorescence was variable in MrgprD^GFP DRG neurons with some exhibiting high and others low density of Na[V]1.7 protein (Figure 6A (#fig6) , DRG inset arrows and arrowhead, respectively)\\nFigure 6.sciency picture\\n\\nEfficacy of designed Na[V]1.7-selective inhibitor (PTx2-3127) on Na[V] channels of mouse nonpeptidergic nociceptor neurons. (A) Immunofluorescence from MrgprD^GFP labeled NP1 nociceptors (AB_300798, green) and Na[V]1.7 (AB_2877500, magenta) in a mouse L5 spinal section. Orientation of left DRG was moved during sectioning. Lower panels are zoomed in images to highlight colocalization (white) in dorsal horn nociceptor terminals, dorsal root fibers and DRG cell bodies. NP1 nociceptor DRG cell bodies show both high (arrow) and low (arrowhead) immunofluorescence for Na[V]1.7. Top image, dorsal horn and DRG zoom images are a z-projection of 3 confocal images spanning 10.06 µm. Zoom in image of dorsal root fibers is a z-projection of 9 airyscan images spanning 3.18 µm. Scale bar in the top image is 500 µm. Scale bars in the dorsal horn, dorsal root and DRG zoom in panels are 100, 20 and 100 µm respectively. (B) Voltage clamp recordings of Na[V] currents from dissociated NP1 nociceptors showing\\nimpact of PTx2-3127 (red) and subsequent application of TTX (green). Fast- inactivating Na[V] component revealed by subtraction of 1 µM PTx2-3127 trace from total Na[V] current. Black dotted line represents 0 pA of current. (C) Left: Mean current density from 0.4-1 ms of PTx2-3127 sensitive current and vehicle sensitive current. Middle: Mean current density from 0.4-1 ms of TTX sensitive current after application of PTx2-3127 or vehicle. Right: Peak current density of TTX resistant current after application of PTx2-3127 or vehicle and TTX. Point colors represent the same neuron (N = 4 mice). p values calculated by Students T-Test. (D) Peak time of PTx2-3127 sensitive and resistant currents as well as peak time of TTX sensitive and resistant currents. Point colors correspond to the same neurons and is consistent with points shown in C. p values calculated by Students T-Test. (E) Current clamp recording of NP1 action potentials and failures with 3 Hz stimuli in vehicle, 1 µM PTx2-3127 and 1\\nµM TTX. (F) Average remaining NP1 action potentials (APs) versus frequency in PTx2-3127 (red points, n = 8 neurons, N = 4 mice) or in vehicle control (blue points, n = 8 neurons, N = 4 mice). Average remaining APs after PTx2-3127 or vehicle control in 1 µM TTX (red circle green fill and blue circle green fill respectively). Neurons with no sensitivity to TTX were excluded from this analysis. (G) Rheobase of NP1 neurons before PTx2-3127, in PTx2-3127 and in TTX (left). Rheobase of NP1 neurons before vehicle, in vehicle and in TTX (right). p values calculated by Students T-test.\\n\\nApplication of 1 µM PTx2-3127 to dissociated MrgprD^GFP neurons under voltage clamp resulted in elimination of a fast-inactivating Na[V] component (Figure 6B (#fig6) , black trace). Blinded, interleaved experiments with either 1 µM PTx2-3127 or vehicle revealed that PTx2-3127 inhibited 48 ± 17 pA/pF (mean ± SEM) of inward current 0.4-1.0 ms after neurons were stepped from -80 to 0 mV, while vehicle had little effect, inhibiting 2 ± 6 pA/pF (Figure 6C (#fig6) , left). Subsequent application of 1 µM TTX to the vehicle controls inhibited 37 ± 12 pA/pF of inward current, similar to the density inhibited by PTx2-3127. Subsequent application of 1 µM TTX to PTx2-3127 had had little effect, 2.1 ± 2.8 pA/pF, showing PTx2-3127 inhibits TTX-sensitive currents in MrgprD^GFP neurons (Figure 6C (#fig6) , middle). The density of inhibitor-resistant peak current was similar for TTX ± PTx2-3127 (Figure 6C (#fig6) , right). Comparison of Na[V] current peak times substantiated the observation that\\nPTx2-3127-sensitive currents were faster than PTx2-3127-resistant currents (Figure 6D (#fig6) ). In vehicle controls TTX-sensitive peak currents were faster than TTX-resistant peak currents, consistent with a prior study of MrgprD^GFP neurons (Dussor, Zylka, Anderson, & McCleskey, 2008 (#c26) ). Overall, the similar effects of either PTx2-3127 or TTX on Na[V] currents suggests PTx2-3127 targets the TTX-sensitive channels of MrgprD^GFP neurons. As MrgprD^GFP neurons express Na[V]1.7, which is TTX-sensitive (Klugbauer, Lacinova, Flockerzi, & Hofmann, 1995 (#c43) ), and have much lower transcript abundances of the other TTX-sensitive channels, Na[V]1.1, 1.2, 1.3, 1.4, 1.6 (Zheng et al., 2019 (#c88) ), we conclude that PTx2-3127 inhibits Na[V]1.7 channels in mouse MrgprD^+nociceptors.\\n\\nThe impact of the designed peptide on action potential firing of dissociated MrgprD^GFP neurons was assessed with current-clamp recording. Action potentials were recorded in vehicle, then 1 µM PTx2-3127, then 1 µM TTX. Blinded interleaved controls were conducted with vehicle replacing PTx2-3127. When stimulated with 20 ms current injections at 150% of rheobase, the step current required to evoke a single action potential, at 1, 3, and 10 Hz, PTx2-3127 suppressed repetitive firing of most neurons (Figure 6E (#fig6) ). In 27% of neurons, no block of action potentials was observed by TTX (Figure 6—figure supplement 1 (#fig6S1) ), and these TTX-insensitive neurons were not included in further analyses. In all TTX-sensitive neurons, action potentials were blocked by PTx2-3127, and subsequent application of TTX had a little additional effect (Figure 6F (#fig6) ). Rheobase was increased by PTx2-3127 (Figure 6G (#fig6) ). Our data demonstrate that PTx2-3127 is effective at inhibiting mouse\\nnociceptor excitability and action potentials.\\n\\n\\n** Efficacy of designed peptides on human DRG neurons\\n------------------------------------------------------------\\n\\nWe studied the effects of PTx2-3127 on the inhibition of single and multiple action potentials properties generated in adult human DRG neurons isolated from a human organ donor. The DRG neurons in culture were treated for 24 hrs with 50 μM oxaliplatin to model chemotherapy-induced neuropathy (Braden, Stratton, Salvemini, & Khanna, 2022 (#c14) Chang et al., 2018 (#c17) Li et al., 2018 (#c46) ). We chose this model as it has been previously shown that pharmacological targeting of Na[V]1.7 reduces neuropathic pain in this model (Chang et al., 2018 (#c17) Dustrude et al., 2016 (#c27) Li et al., 2018 (#c46) ). We found that rheobase increased with increasing concentrations of PTx2-3127 (Figure 7A (#fig7) and Table 3 (#tbl3) ). We then measured action potentials induced by a train of 10 to 120 individual current steps delivered at 0.1, 1, 3, and 10 Hz, using current injection at 150% of baseline rheobase. The percentage of action potentials remaining was calculated as the number of action\\npotentials in the presence of PTx2-3127 divided by the number of action potentials obtained under control conditions (without drug) at the same frequency. The number of remaining action potentials was reduced in a dose-dependent manner at 0.01, 0.1, and 1 µM PTx2-3127 at different frequencies following 24 hours of incubation with Oxaliplatin (Figure 7B (#fig7) and Table 3 (#tbl3) ). Our data demonstrate that PTx2-3127 is effective at reducing excitability and action potentials firing in human sensory neurons in an in vitro model of chemotherapy-induced neuropathy.\\nFigure 7.sciency picture\\n\\nEfficacy of PTx2-3127 on rheobase and action potentials in human DRG neurons. (A) Rheobase of NP1 neurons before PTx2-3127, in PTx2-3127 and in TTX (left). Rheobase of NP1 neurons before vehicle, in vehicle and in TTX (right). p values calculated by Students T-test. (B) Efficacy of PTx2-3127 on rheobase in human DRG neurons following 24h incubation with Oxaliplatin (50μM). Rheobase after perfusion of the compound is normalized to baseline. (I) Efficacy of PTx2-3127 on action potentials (APs) in human DRG neurons following 24h incubation with Oxaliplatin (50μM). Action potential inhibition after perfusion of the compound is normalized to baseline. APs were elicited at 150% of baseline rheobase. Results are presented as mean ± SEM.\\nTable 3.sciency picture sciency picture\\n\\n\\n** Rheobase and number of action potentials following perfusion of PTx2-3127 following 24h incubation with Oxaliplatin.\\n------------------------------------------------------------\\n\\n\\n** Efficacy of designed peptides in animal models of pain\\n------------------------------------------------------------\\n\\nTo study the efficacy of PTx2-3127 in animal models of pain, we tested it initially in naïve female and male rats to assess the thermal nociceptive responses and monitor open field activity. Whereas mouse sensory neurons are a useful model in vitro due to their genetic tractability, rats have been proposed to provide more reliable behavioral responses in pain models (Mogil, 2009 (#c49) ). Doses were selected referencing the in vivo data available for ProTx-II. Merck’s study found that ProTx-II had a laming effect via intrathecal administration at 2.4 µg but no effect on nociceptive assays at 0.24 µg i.t. (Schmalhofer et al., 2008 (#c64) ). Janssen’s study reported that 2 µg of ProTx-II in 10 µL was the maximum tolerated dose in rats (Flinspach et al., 2017 (#c31) ). Based on this information we chose a conservative dose of 1.2 and 1.6 µg in 10 µL for intrathecal administration to naïve rats. Intrathecal administration was performed via implanted cannulas which were surgically placed in the\\nsubarachnoid space of the spinal cord between L4 and L5. After recovery from surgery (∼7 days) the rats were assessed for gait and mobility prior to peptide dosing.\\n\\nThe 1.6 versus 1.2 µg dose resulted in robust analgesia with several rats reaching the cutoff latency (30 seconds) for a number of hours on a 52.1 °C hotplate assessed once per hour (Figure 8A (#fig8) and B) (Two Way Repeated Measures ANOVA, Holm-Sidak method post hoc, p<0.001 PTx2-3127 n=11 vs. vehicle n=9). Importantly, this dose did not lame or significantly alter motor activity of the rats. Rats that timed out per the cutoff were immediately ambulatory after being removed from the hot plate. The same dose was administered to a group of rats with oxaliplatin induced neuropathy (Figure 8C (#fig8) ). These rats with induced chronic pain were assessed on the 52.1 °C hotplate to compare to results from naïve rats. Again the 1.6 µg i.t. dose of PTx2-3127 resulted in robust analgesia, however with a slightly different time course of action (Two Way Repeated Measures ANOVA, Holm-Sidak method post hoc, p=0.029 PTx2-3127 n=5 vs. vehicle n=4).\\nFigure 8.sciency picture\\n\\nEfficacy of PTx2-3127 on thermal pain and CIPN neuropathy. PTx2-3127 exhibited dose dependent analgesia on a 52.1°C hotplate increasing the duration of effect as well as number reaching the latency cutoff with doses of 1.2 ug i.t. (A) to 1.6 ug i.t. (B) in naïve female and male rats. The analgesia mediated by PTx2-3127 was significant compared to vehicle controls for both doses (1.2 ug, p ≤ 0.002) and the 1.6 ug dose several rats reached the hotplate latency cutoff (30 seconds to prevent injury) for several hours’ duration (1.6 ug, p < 0.001 and p = 0.013 at indicated time points). (C) PTx2-3127 was also effective against oxaliplatin chemotherapy induced neuropathic pain (CIPN) with responses also significant compared to vehicle controls (p < 0.001) and reaching the latency cutoff. (A-C, Two Way Repeated Measures ANOVA, Holm-Sidak method post hoc, treated versus control).\\n\\n\\n** Discussion\\n------------------------------------------------------------\\n\\nOur study provides valuable insights into the development of natural peptide-based therapeutics to treat chronic pain. First, natural peptides, such as ProTx-II, constitute useful starting protein scaffolds for further optimization of selectivity, potency, stability, and bioavailability. Second, high-resolution structures of natural peptide – protein receptor complexes, such as the ProTx-II – hNa[V]1.7-Na[V]Ab chimera (Xu et al., 2019 (#c81) ), and available experimental data on peptide – protein receptor interactions, such as studies by Amgen, Genentech, and Janssen in the case of ProTx-II (Flinspach et al., 2017 (#c31) Moyer et al., 2018 (#c50) Xu et al., 2019 (#c81) ), provide essential data for the rational design of peptide-based therapeutics. Third, computational structural biology-based protein design using Rosetta allows rational exploration of peptide substitutions in silico guided by high-resolution structures of peptide – protein receptor complexes (Bender et al., 2016 (#c7)\\nLeman et al., 2020 (#c45) ).\\n\\nThe previous state-of-the-art ProTx-II based peptide optimization by Janssen identified a peptide variant (named JNJ63955018) that achieved in vitro selectivity for hNa[V]1.7 versus other human Na[V] channels ranging from 100-fold (vs hNa[V]1.6) to more than 1,000-fold (vs hNa[V]1.5) (Flinspach et al., 2017 (#c31) ). However, the in vivo safety window for JNJ63955018 peptide was only 7-16 fold (Flinspach et al., 2017 (#c31) ). Therefore, further improvement of in vitro selectivity for hNa[V]1.7 versus other human Na[V] channels to achieve >1,000-fold is necessary to expand the in vivo safety window to at least 100-fold (Schmalhofer et al., 2008 (#c64) ). Our structure-guided peptide optimization facilitated efficient identification of promising combinations of substitutions and tested only dozens of top candidates compared to the previous comprehensive mutagenesis efforts which synthesized and screened up to 1,500 peptide variants (Flinspach M et al., 2015; (Flinspach et al., 2017 (#c31) );\\n(Neff & Wickenden, 2021 (#c55) )). Redesign of ProTx-II peptide using Rosetta identified novel and confirmed previously reported substitutions that improved selectivity for hNa[V]1.7 versus other human Na[V] channels while preserving low nanomolar potency. Rosetta introduced substitutions of ProTx-II residues facing the membrane environment (Y1H), facing the protein-protein interface environment (M6norLeu), and facing the water-soluble environment (S11K and E12D). Rosetta also confirmed previously reported ProTx-II substitutions facing the membrane environment (Y1Q and W7Q, reported by Janssen (Flinspach et al., 2017 (#c31) )), facing the protein core environment (M19L, reported by Janssen (Flinspach M et al., 2015; (Neff & Wickenden, 2021 (#c55) ))), and facing the protein-protein interface environment (K28E, reported by Amgen (Moyer et al., 2018 (#c50) )). We designed a novel and extensive hydrogen-bonding network at the ProTx-II – hNa[V]1.7 VSD-II interface involving R20, R22, and E28\\n(on ProTx-II) and D816 (on hNa[V]1.7 VSD-II) that contributed to improvements in the lead PTx2-3127 and PTx2-3258 peptide selectivity because Aspartate at position D816 is only present in hNa[V]1.7 and hNa[V]1.6 (see Figure 2—figure supplement 1 (#fig2S1) ). Our top designed peptides are highly potent PTx2-3127 (IC[50] = 6.9 nM) and PTx2-3258 (IC[50] = 3.8 nM) and highly selective for hNa[V]1.7 versus other human Na[V] channels. PTx2-3127 has 730-, 1,671-, and 19,868-fold selectivity for hNa[V]1.7 versus hNa[V]1.2, hNa[V]1.4 and hNa[V]1.5, respectively. PTx2-3258 has 894-, 2,336-, and 10,082-fold selectivity for hNa[V]1.7 versus hNa[V]1.2, hNa[V]1.4 and hNa[V]1.5, respectively. However, the potency and selectivity of our top peptides, PTx2-3127 and PTx2-3258, are superior to Janssen’s JNJ63955918 peptide (Flinspach et al., 2017 (#c31) ), underscoring the power of our structure-guided optimization approach.\\n\\nEndogenous Na[V] channels do not always share the same pharmacology as recombinantly expressed channels, which could result from differences due to endogenous auxiliary subunits, interacting partners, or posttranslational modifications in native cells absent in heterologous systems (Zhang et al., 2013 (#c87) ). Here, we demonstrate the efficacy of PTx2-3127 in targeting endogenous Na[V]1.7 channels from both mice (Figure 6 (#fig6) ) and human neurons (Figure 7 (#fig7) ). Experiments in genetically identified mouse nonpeptidergic nociceptors show that PTx2-3127 inhibits the endogenous fast inward conductance consistent with Na[V]1.7. PTx2-3127 also inhibits excitability and action potential firing in these neurons. These results suggest that mice have value as a preclinical model for developing PTx2 derivatives as pain therapeutics. Furthermore, in human DRG neurons treated with the chemotherapeutic oxaliplatin, PTx2-3127 also reduced neuronal excitability. Oxaliplatin is a chemotherapeutic\\nagent commonly used to treat colorectal cancers (Graham, Mushin, & Kirkpatrick, 2004 (#c34) ) and is known to increase sensory neuron excitability to induce both neuropathic mechanical and cold allodynia. However, there is a debate regarding the mechanisms and Na[V] subtypes through which this occurs. We provide evidence that 1) PTx2-3127 can reduce action potential discharges in an in vitro model of oxaliplatin-induced neuropathy, and 2) Na[V]1.7 contributes to human neuronal hyperexcitability in this model. This important result is consistent with PTx2-3127 retaining activity against endogenous human Na[V]1.7 channels and suggests engineered PTx2 variants have potential to suppress human nociception in the clinic. The dual efficacy of PTx2-3127 in murine and human DRG neurons also demonstrates the value of combining the genetic power of mouse models with the translational relevance of in vitro experiments on human DRG neurons to validate future PTx2 variants during the preclinical\\noptimization (Shiers et al., 2020 (#c70) ).\\n\\nPTx2-3127 demonstrated acute analgesia in keeping with a previous report of Na[V] channel blockade with ProTx-II and other targeted Na[V]1.7 blocking approaches (Flinspach et al., 2017 (#c31) ). Intrathecal administration of the peptide to otherwise naïve rats blocked pain sensitivity in the suprathreshold hotplate assay over a duration of several hours. After this hotplate assay rats were placed into an open field apparatus where the animals were ambulatory and explorative despite reaching a latency cutoff on the hotplate. The open field was not quantified in this setting because of the supra-stimulation of the hotplate assay directly preceding it. However, our observations correlate with published reports that Na[V] channel blockade in preclinical models parallels the human genetic mutant phenotype of pain insensitivity without motor function decrements (Gingras et al., 2014 (#c32) ). Importantly PTx2-3127 was also effective against CIPN-induced neuropathy with intrathecal administration\\n(Figure 8 (#fig8) ). The chronic pain of CIPN is often difficult to treat, but using the 52.1°C hotplate we demonstrated potent analgesia using PTx2-3127 in this model. It will be essential to characterize the expression levels and contribution of Na[V]1.7 versus Na[V]1.8 to the CIPN pain, as well as the pain modality (i.e. heat/cold, mechanical or chemical stimuli) where this highly selective Na[V]1.7 blocking peptide is the most potent, however in this initial investigation, intrathecal PTx2-3127 administration resulted in significant analgesia.\\n\\nIn summary, our interdisciplinary approach demonstrates the power of structure-guided peptide design and represents a major step toward the efficient development of potent and selective natural peptide-based inhibitors of human Na[V]1.7 channels as prototypes of analgesic drug candidates for treating chronic pain. Additional work will be necessary to address the following limitations of our study and translate Na[V]1.7 targeted peptides to the clinic. First, a significant improvement in the selectivity of our lead peptides for hNa[V]1.7 versus hNa[V]1.6 is needed to avoid affecting the function of motor neurons within a therapeutic concentration range (Schmalhofer et al., 2008 (#c64) ). Second, optimization of the duration of peptide efficacy in vivo beyond several hours will be necessary to prolong the therapeutic effect in the clinic, either through increasing stability or continuous administration via an intrathecal pump. Third, the development of peptide formulations will be useful to\\npotentially enable peptide bioavailability through subcutaneous, intranasal or oral administration routes as are already in clinical use for GLP-1 (Glucagon-Like Peptide 1) receptor agonists (Drucker, 2020 (#c25) ).\\n\\n\\n** Methods\\n------------------------------------------------------------\\n\\n\\n** Key Resource Table\\n------------------------------------------------------------\\nsciency picture\\n\\n\\n** Design of ProTx-II based peptides targeting hNav1.7\\n------------------------------------------------------------\\n\\n\\n** Molecular dynamics simulation of ProTx-II - NavAb/Nav1.7 chimera complex\\n------------------------------------------------------------\\n\\nWe ran a molecular dynamics simulation of the cryo-EM structure of NavAb/Nav1.7 in a complex with ProTx-II in a deactivated state (PDB ID: 6N4R) (Xu et al., 2019 (#c81) ) to obtain a closer look at the interaction of ProTx-II with lipid membrane at the residue level. CHARMM-GUI (Jo, Kim, Iyer, & Im, 2008 (#c40) ) was used to embed the structure in a lipid bilayer of POPC with explicit TIP3P water molecules at a concentration of 150 mM NaCl. The system contained approximately 90,000 atoms and was parametrized with the CHARMM36 forcefield (Huang & MacKerell, 2013 (#c36) ). Neutral pH was used to assign the protonation state as default, and the C-terminal of ProTx-II is in the amidated form. The simulation was run on our local GPU cluster using NAMD version 2.12 (Jiang et al., 2011 (#c39) ). After 10,000 steps of steepest descent minimization, 1 fs timestep equilibrations were started with harmonic restraints initially applied to protein-heavy atoms and lipid tail dihedral angles as suggested\\nby CHARMM-GUI (Jo et al., 2008 (#c40) ). These restraints were gradually released over 2 ns. Harmonic restraints (0.1 kcal/mol/Å^2) were applied only to protein backbone heavy atoms. The systems were equilibrated further for 20 ns using 2 fs timestep with all bonds to hydrogen atoms constrained by the SHAKE algorithm (Ryckaert, Ciccotti, & Berendsen, 1977 (#c63) ). The equilibrations were performed in NPT ensemble with semi-isotropic pressure coupling to maintain the correct area per lipid, and a constant temperature of 303.15 K. Particle Mesh Ewald (PME) method was used to compute electrostatic interactions. Non-bonded pair lists were updated every 10 steps with a list cutoff distance of 16 Å and a real space cutoff of 12 Å with energy switching starting at 10 Å. The production run was conducted for 100 ns without applied protein backbone restraints.\\n\\nWe analyzed the 100 ns simulation for interactions of ProTx-II residues with the surrounding environment, categorized into different groups: lipid head, lipid tail, water and VSDII (hNav1.7/NavAb chimera structure (PDB ID: 6N4R) (Xu et al., 2019 (#c81) )). Fractional contact is defined as the frequency of forming contact (3.5 Å as a cutoff) of heavy atoms belonging to the associated groups normalized over the course of simulation and across interacting chains, A-E, B-F, C-G, D-H of the structure.\\n\\n\\n** Computational design of ProTx-II variants\\n------------------------------------------------------------\\n\\nFirst, the cryo-EM structure of ProTx-II in complex with hNav1.7/NavAb in a deactivated state (PDB ID: 6N4R) was further refined in Rosetta (Leman et al., 2020 (#c45) ) using Rosetta cryo-EM refinement protocol (Wang et al., 2016) (see the Methods section below entitled “Rosetta Scripts for refinement of ProTx-II - hNav1.7/NavAb complex”). We generated 1,000 refined models and extracted the top 10 scoring models for visual inspection. We carefully examined how well ProTx-II fits into the electron density across multiple interacting chains A-E, B-F, C-G, and D-H of the top models and eventually selected chain A-E for the subsequent modeling.\\n\\nRosetta FastDesign (Maguire et al., 2021 (#c48) ) was used to introduce ProTx-II substitutions and design new peptide variants. A small deviation of backbone conformation is inherently sampled in FastDesign by ramping cycles of reduced repulsive forces. We seek to sample higher degrees of backbone flexibility during the design process by further incorporating Rosetta Small mover and Roll mover. Small mover performs small random changes in the backbone torsional space while Roll mover invokes small rigid body perturbation between ProTx-II and VSD-II. Both movers were implemented in Rosetta XML scripts prior to the FastDesign mover (see XML scripts in the Methods section below entitled “Rosetta Scripts for refinement of ProTx-II - hNav1.7/NavAb complex”).\\n\\nFastDesign was used in conjunction with sequence profile constraints to control amino acid identity substitutions. In the computational design step (round 2), fixed identity was applied to positions that reflect empirical knowledge such as R20, R22, E28 for preserving the hydrogen bond network with D816 (VSD-II) and W5, M6, W24, R26, K27, L29 for forming important interactions with the channel as observed from the modeling results of prior designs. On top of that, we disallowed acidic residues for positions that have significant interactions with lipid heads or lipid tails observed from the fractional contacts derived from the MD simulation of the ProTx-II – hNav1.7/NavAb chimera. Other positions, except disulfides, were allowed to freely mutate. However, we used Rosetta FavorSequenceProfile mover to slightly bias new substitutions towards native residues on ProTx-II because of the lack of secondary structure elements for the majority of ProTx-II fold in combination with a higher degree of\\nbackbone flexibility could result in highly diverse set of amino acid substitutions with FastDesign. We generated 1,000 designs and extracted the 100 top designs by total score followed by selecting the top 20 designs by Rosetta DDG. The consensus designed sequence was constructed from the top 20 designs using sequence logo presentation (see Figure 3—figure supplement 1 (#fig3S1) ) and analyzed in combination with available experimental data during each optimization round as described in the main text.\\n\\n\\n** Peptide synthesis and folding\\n------------------------------------------------------------\\n\\nThe ProTx-II variants were produced synthetically using Fmoc automated solid-phase synthesis performed on Liberty Blue peptide synthesizer from CEM Inc using a microwave assisted synthesis strategy employing diisopropyl carbodiimide and Oxyma for the activation chemistry. Pre-loaded ChemMatrix (Sigma Aldrich) Wang resins were used to produce ProTx-II variants with C-terminal acids. Acidolytic cleavage and deprotection of the completed peptide resins was performed with 9.5 ml trifluoroacetic acid (TFA), 0.5 ml H[2]0, 0.5 ml Anisole, 0.5 ml thioanisole, 0.25 ml of DODT (3,6-dioxa-1,8-octanedithiol), 0.25 ml triisopropyl silane per gram of resin for 2 h at room temperature. Cleaved peptides were precipitated with 5-fold excess of diethyl ether added directly to the pre-filtered cleavage solution, isolated, and re-solubilized in TFA. Linear peptides were purified by preparative HPLC using a Phenomenex Luna C18(2), 100 Å pore size, 10 μ particle size, 250 mm x 21.2 mm column and a 15–48% linear\\ngradient of acetonitrile with 0.05% TFA over 40 min. Molecular weights were confirmed by LC/MS and fractions were pooled for folding. Purified linear fractions were added directly to 20 mM Tris, 2 M Urea, 1:2 oxidized/reduced glutathione, and pH was adjusted to 7.8–8.0 using acetic acid. Final peptide concentration was approximately 0.1 – 0.2 mg/ml. Solutions were stirred for 24–48 h at room temperature. Folded peptides were purified using a Phenomenex Luna C18(2), 100 Å pore size, 10 μ particle size, 250 mm x 21.2 mm column with a 15–48% linear gradient of acetonitrile with 0.05% TFA over 40 min. Main peak fractions were analyzed by HPLC and LC/MS. Peptide fractions with a purity >95% were pooled, flash-frozen and subsequently lyophilized. Peptide content for each product was determined by absorbance at 280 nm using the calculated extinction coefficient. Percent purity was determined by HPLC using a Phenomenex Luna C18(2) analytical column, 250 mm x 4.6 mm, 100 Å pore size, 5 μ particle\\nsize. Peptide mass and oxidation were confirmed by LC/MS using a Waters 2965 separations module coupled to a Waters Micromass ZQ electrospray mass spectrometer.\\n\\n\\n** Testing of designed peptides potency and selectivity using electrophysiological assays on recombinant channel cell lines\\n------------------------------------------------------------\\n\\nHEK-293 cells stably expressing human Na[V]1.1, Na[V]1.4, Na[V]1.5, Na[V]1.6 and Na[V]1.7 were obtained from Dr. Chris Lossin. Rat Na[V]1.3 expressing HEK-293 cells were from Dr. Stephen Waxman (Yale University, New Haven, CT). These cell lines were cultured in complete DMEM supplemented with 10% FBS, 1% penicillin/streptomycin, and G418. The human Na[V]1.8 channel (co-expressing with human Na[V]β1 and Na[V]β2 subunits) and the Nav1.9 channel (co-expressing with human Trkb, Na[V]β1, and Na[V]β2 subunits) were obtained from Dr. Neil Castle (Icagen, Durham, NC). hNa[V]1.8 cells cultured with G418 (0.4 mg/mL) and puromycin (0.5 ng/mL) and hNa[V]1.9 cells were cultured with G418 (0.4 mg/mL), puromycin (0.5 ng/mL), and zeocin (0.05 mg/mL). Human Na[V]1.2 were expressed transiently by transfection of the hNa[V]1.2 cDNA (from Dr. Alan L. Goldin, UC Irvine, CA) into HEK-293 cells.\\n\\nWhole-cell patch-clamp experiments on recombinant channels were conducted manually at room temperature (22–24 °C) using an EPC-10 amplifier (HEKA Electronik, Lambrecht/Pfalz, Germany). Cells were trypsinized and plated onto poly-l-lysine–coated coverslips. All recordings were done in normal Ringer external bath solution containing (in mM) 160 NaCl, 4.5 KCl, 2 CaCl[2], 1 MgCl[2], 10 HEPES (pH 7.4 and 305 mOsm) as. Patch pipettes were pulled from soda lime glass (micro-hematocrit tubes, Kimble Chase, Rochester, NY) and had resistances of 2-3 MΩ when filled with CsF-based internal solution containing (in mM) 10 NaF, 110 CsF, 20 CsCl, 10 HEPES, 2 EGTA, (pH 7.4, 310 mOsm). Data acquisition and analysis were performed with Pulse-PulseFit (HEKA Electronik GmbH, Germany), IgorPro (WaveMetrics, Portland, OR), and Origin 9.0 software (OriginLab Corporation, Northampton, MA). Cells were held at −90 mV and voltage stepped to -120 mV for 200 ms before depolarizing to -10 mV for 50 msec to elicit inward\\ncurrents. Control test currents were monitored for 5-10 min to ensure that the amplitude and kinetics of the response were stable. Series resistance was compensated to 80–90% and linear leak currents and capacitance artefacts were corrected using a P/4 subtraction method. Pulse interval was 0.1 Hz and peptides were applied to individual cells using a glass transfer pipette directly into the recording bath. For measuring inhibition, currents were allowed to saturate with repeated pulsing before addition of subsequent doses. IC[50] values were derived from measurements performed on individual cells that were tested with at least three or more concentrations of each peptide. Concentration response curves were fitted with the Hill equation and IC[50]s are reported with 95% confidence intervals.\\n\\n\\n** Testing of designed peptides stability in artificial cerebrospinal fluid\\n------------------------------------------------------------\\n\\nStability In Artificial Cerebrospinal Fluid (aCSF): The stability of the wild-type ProTx-II, PTx2-3127, and PTx2-3258 was conducted in artificial Cerebrospinal Fluid (aCSF). The aCSF was purchased from Tocris Biosciences (Catalog # 3525) and had the following ionic composition (in mM): Na^+ 150; K^+ 3.0; Ca^2+1.4; Mg^2+ 0.8; P 1.0; Cl^- 155. The wild-type ProTx-II, PTx2-3127, and PTx2-3258 were dissolved in DPBS at 200 µM (1 mg of respective peptides in 1.305 mL, 1.315 mL, and 1.315 mL of DPBS, respectively). 500 µL of dissolved peptide in DPBS and 1.500 mL of aCSF were mixed to get 50 µM peptide solution in aCSF. The samples were incubated at 37^0C and aliquots of 100 µL were removed at 0, 1 hrs, 2 hrs, 4 hrs, 8 hrs, 12 hrs, 24 hrs, and 120 hrs, respectively. The aliquots were immediately flash frozen and stored at -80^0C until further analysis. Peptides dissolved in aCSF were analyzed on a Hewlett Packard 1100 series HPLC system and monitored at 214 nm and 280 nm. The stability at various\\ntime points was determined by calculating the average Area under the curve at 214 nm and 280 nm for 2 injections of 20 µL using ChemStation Software. The peptides were run on a BioBasic^TM C18 column (150 × 4.8 mm, ThermoFisher). The mobile phases were 0.1% Trifluoroacetic Acid in water (mobile phase A) and 100 % Acetonitrile (mobile phase B).\\n\\n\\n** Testing of designed peptides efficacy on mouse sensory neurons\\n------------------------------------------------------------\\n\\n\\n** Mice\\n------------------------------------------------------------\\n\\nThis study was approved by the UC Davis Institutional Animal Care and Use Committee and conforms to guidelines established by the NIH. Mice were maintained on a 12 h light/dark cycle, and food and water were provided ad libitum. The MrgprD-GFP mouse line was a generous gift from David Ginty (Harvard University, Boston MA) (MGI: 3521853).\\n\\n\\n** Preparation of DRG sections\\n------------------------------------------------------------\\n\\nThis study was approved by the UC Davis Institutional Animal Care and Use Committee and conforms to guidelines established by the NIH. 20-week-old MrgprD-GFP mice was briefly anesthetized with 3-5% isoflurane and then decapitated. The spinal column was dissected, and excess muscle tissue removed. The spinal column was then bisected in the middle of the L1 vertebrae identified by the 13^th rib and drop fixed for 1 hour in ice cold 4% paraformaldehyde in 0.1M phosphate buffer (PB) pH adjusted to 7.4. The spine was washed 3× for 10 min each in PB and cryoprotected at 4 °C in 30% sucrose diluted in PB for 24 hours. The spine was cut into sections containing two vertebra per sample which were frozen in Optimal Cutting Temperature (OCT) compound (Fisher Cat#4585) and stored at -80 °C until sectioning. Vertebrae position relative to the 13^th rib was recorded for each frozen sample to determine the specific vertebrae position in the spinal cord. Samples were cut into 30 μm sections on a freezing\\nstage sliding microtome and were collected on Colorfrost Plus microscope slides (Fisher Scientific Cat#12-550-19). Slides were stored at -20°C or immediately used for multiplex immunofluorescence labeling.\\n\\n\\n** Multiplex immunofluorescence labeling\\n------------------------------------------------------------\\n\\nA hydrophobic barrier was drawn around tissue sections mounted on slides as described above using a hydrophobic barrier pen (Scientific Device Cat#9804-02). Sections were incubated in 4% milk in PB containing 0.2% Triton X-100 (vehicle) for 1 hour and then incubated in vehicle containing 0.1 mg/mL IgG F(ab) polyclonal IgG antibody (Abcam cat# ab6668) for 1 hour. Sections were washed 3× for 5 min each in vehicle and then incubated in vehicle containing primary Abs. (Supplemental Table Abs) for 1 hour. Sections were washed 3× for 5 min each in vehicle and then incubated in vehicle containing mouse IgG-subclass-specific goat secondary Abs (Table Abs) conjugated to Alexa Fluors (Thermo Fisher). Sections were washed 3× for 5 min each in PB and mounted with Prolong Gold (Thermo Fisher) and Deckglaser cover glass (Cat#NC1776158). All incubations and washes were done at room temperature with gentle rocking.\\n\\n\\n** Immunofluorescence imaging\\n------------------------------------------------------------\\n\\nImages were acquired with an inverted scanning imaging system (Zeiss LSM 880, 410900-247-075) run by ZEN black v2.1. Laser lines were 488 nm, 633 nm. Low-magnification images were acquired in confocal mode with a 0.8 NA 20x objective (Zeiss 420650-9901) and reconstructed as a tiled mosaic using ImageJ. High-magnification images were acquired in airy disk imaging mode with a 1.4 NA 63x oil objective (Zeiss 420782-9900-799). Linear adjustments to contrast and brightness and average fluorescence intensity z-projections were performed using ImageJ software.\\n\\n\\n** Neuron Cell Culture\\n------------------------------------------------------------\\n\\nCervical, thoracic and lumbar DRGs were harvested from 4 to 6 week old MrprD-GFP mice and transferred to Hank’s buffered saline solution (HBSS) (Invitrogen). Ganglia were treated with collagenase (2 mg/ml; Type P, Sigma-Aldrich) in HBSS for 15 min at 37°C followed by 0.05% Trypsin-EDTA (Gibco) for 2.5 min with gentle rotation. Trypsin was neutralized with culture media (MEM, with L-glutamine, Phenol Red, without sodium pyruvate) supplemented with 10% horse serum (heat-inactivated; Gibco), 10 U/ml penicillin, 10 μg/ml streptomycin, MEM vitamin solution (Gibco), and B-27 supplement (Gibco). Serum-containing media was decanted and cells were triturated using a fire-polished Pasteur pipette in MEM culture media containing the supplements listed above. Cells were plated on laminin-treated (0.05 mg/ml, Sigma-Aldrich) 5 mm Deckglaser coverslips, which had previously been washed in 70% ethanol and UV-sterilized. Cells were then incubated at 37°C in 5% CO[2]. Cells were used for electrophysiological\\nexperiments 24-38 hours after plating.\\n\\n\\n** Voltage Clamp of Endogenous Neuronal Sodium Channels\\n------------------------------------------------------------\\n\\nVoltage clamp was achieved with a dPatch amplifier (Sutter Instruments) run by Sutterpatch (Sutter Instruments). Solutions for voltage-clamp recordings: internal (in mM) 15 NaCl, 100 CsCl, 25 CsF, 1 EGTA and 10 HEPES adjusted to pH 7.3 with CsOH, 297 mOsm. Seals and whole-cell configuration were obtained in an external patching solution containing the following (in mM) 145 NaCl, 3.5 KCl, 1.5 CaCl[2], 1 MgCl[2], 10 HEPES, 10 Glucose adjusted to pH 7.4 with NaOH, 322 mOsm. For voltage-clamp neuronal recordings, the external solution contained (in mM) 44 NaCl, 106 TEA-Cl, 1.5 CaCl[2], 1 MgCl[2], 0.03 CdCl[2] 10 HEPES, 10 glucose, pH adjusted to 7.4 with TEA-OH, 315 mOsm. The calculated liquid junction potential for the internal and external recording solutions was 5.82 mV and not accounted for. Osmolality is measured with a vapor pressure osmometer (Wescor, 5520). For voltage-clamp recordings, neurons plated on the cover glass as described in the Neuron Cell Culture section were placed in a\\nrecording chamber (Warner Cat#64-0381) and were rinsed with an external patching solution using a gravity-driven perfusion system. Neurons from MrgprD^GFP mice showing intracellular GFP were then selected for patching. After the whole-cell voltage clamp was established the external patching solution was exchanged with the external recording solution using a gravity-driven perfusion system. PTx2-3127, vehicle control (external recording solution) and TTX were kept on ice and diluted in room temperature (20-22 °C) external recording solution just prior to application to neurons and manually added at a rate of approximately 1 mL/min. Experimenter was blinded to the identity of PTx2-3127 versus vehicle control solutions during recordings. PTx2-3127, vehicle control and TTX were applied to neurons using separate perfusion lines to prevent contamination. After each neuron, perfusion lines were cleared with 1 mL of 70% ethanol followed by 1 mL of milli Q water and were then filled with an external\\nrecording solution. Thin-wall borosilicate glass recording pipettes (BF150-110-10, Sutter) were pulled with blunt tips, coated with silicone elastomer (Sylgard 184, Dow Corning), heat cured, and tip fire-polished to resistances less than 3 MΩ. Series resistance of 3–8 MΩ was estimated from the whole-cell parameters circuit. Series resistance compensation between 37-77% was used to constrain voltage error to less than 15 mV, lag was 6 µs. Cell capacitances were 13–34 pF. Capacitance and Ohmic leak were subtracted using a P/4 protocol. Output was low-pass filtered at 10 kHz using the amplifier’s built-in Bessel and digitized at 50 kHz. The average current in the initial 0.14 seconds at holding potential prior to the voltage step was used to zero-subtract each recording. The mean current was the current amplitude between 0.4-1 ms into the 0 mV step. Peak current amplitude was the peak current amplitude between 0.4-8 ms into the 0 mV step. Experiments were performed on neurons with membrane\\nresistance greater than 1 GΩ assessed prior to running voltage clamp or current clamp protocols while neurons were held at a membrane potential of -80 mV. Data with predicted voltage error, V[error] ≥ 15 mV were excluded from the analysis. V[error] was tabulated using estimated series resistance post compensation and peak Na[V] current.\\n\\n\\n** Current Clamp\\n------------------------------------------------------------\\n\\nSolutions for current clamp recordings: internal (in mM) 120 K-methylsulfonate, 10 KCl, 10 NaCl, 5 EGTA, 0.5 CaCl[2], 10 HEPES, 2.5 MgATP and adjusted to pH 7.2, 289 mOsm. External solution (in mM) 145 NaCl, 5 KCl, 2 CaCl[2], 2 MgCl[2], 10 HEPES, 10 Glucose adjusted to pH 7.3 with NaOH, 308 mOsm. The calculated liquid junction potential for these solutions was 9.682 mV and not accounted for. Thin-wall borosilicate glass recording pipettes (BF150-110-10, Sutter) were pulled with blunt tips and tip fire-polished to resistances less than 3 MΩ. For current-clamp recordings, neurons plated on the cover glass as described in the Neuron Cell Culture section were placed in a recording chamber (Warner Cat#64-0381) and were rinsed with external solution using a gravity-driven perfusion system. Neurons from MrgprD-GFP mice showing intracellular GFP were then selected for patching. The same protocol for application of PTx2-3127, vehicle control (external solution) and TTX described in the Voltage Clamp\\nsection was followed. In current clamp experiments data were excluded if the resting membrane potential of a neuron rose above -40 mV.\\n\\n\\n** Experimental Design and Statistical Treatment\\n------------------------------------------------------------\\n\\nIndependent replicates (n) are individual neurons from multiple mice, details in figure legends. Statistical tests were conducted using Igor 8 (Wavemetrics Inc), details in figure legends.\\n\\n\\n** Testing of designed peptides efficacy on human sensory neurons\\n------------------------------------------------------------\\n\\nAll human tissues that were used for the study were obtained by legal consent from organ donors in the US. AnaBios Corporation’s procurement network includes only US based Organ Procurement Organizations and Hospitals. Policies for donor screening and consent are the ones established by the United Network for Organ Sharing (UNOS). Organizations supplying human tissues to AnaBios follow the standards and procedures established by the US Centers for Disease Control (CDC) and are inspected biannually by the DHHS. Distribution of donor medical information is in compliance with HIPAA regulations to protect donor’s privacy. All transfers of donor tissue to AnaBios are fully traceable and periodically reviewed by US Federal authorities. AnaBios generally obtains donor organs/tissues from adults aged 18 to 60 years old. Donor DRGs from males and females were harvested using AnaBios’ proprietary surgical techniques and tools and were shipped to AnaBios via dedicated couriers. The DRGs were then\\nfurther dissected in cold proprietary neuroplegic solution to remove all connective tissue and fat. The ganglia were enzymatically digested, and the isolated neurons put in culture in DMEM F-12 (Gemini Bio-Products CAT#: 900-955. Lot# M96R00J) supplemented with Glutamine 2 mM, Horse Serum 10% (Invitrogen #16050-130), hNGF (25 ng/ml) (Cell Signaling Technology #5221LF), GDNF (25 ng/ml) (ProSpec Protein Specialist #CYT-305) and Penicillin/Streptomycin (Thermo Fischer Scientific #15140-122).\\n\\nExternal Current Clamp solution included: 145 mM NaCl, 3 mM KCl, 1 mM MgCl[2], 2 mM CaCl[2], 10 mM dextrose, 10 mM HEPES, pH = 7.4 (with NaOH), 300 ± 5 mOsm. Internal Current Clamp solution included: 110 mM K^+ gluconate, 20 mM KCl, 10 mM EGTA, 8 mM NaCl, 4 mM Mg-ATP, 10 mM HEPES, pH = 7.3 (with KOH), 280 ± 5 mOsm. All of our compounds come from Sigma-Aldrich. PTx2-3127 was stored in 10 mM formulation in DMSO at -20°C. Oxaliplatin was stored in 50 mM formulation in DMSO at 4°C.\\n\\nDRG recordings were obtained from human DRG in culture (2 to 7 days). Human DRG neurons were incubated with Oxaliplatin (50 µM) at 37°C for 24h. Whole-cell patch-clamp recordings were conducted under current-clamp mode at room temperature (∼ 23 °C) using HEKA EPC-10 amplifier. Data were acquired on a Windows-based computer using the PatchMaster program. Pipettes (1.5 - 3.0 MΩ) (Warner Instruments #64-0792) were fabricated from 1.5 mm borosilicate capillary glass using a Sutter P-97 puller. Cells on Corning glass coverslips (Thomas Scientific #354086) were transferred to a RC-26GLP recording chamber (Warner Instruments #64-0236) containing 0.5 ml standard external solution. Extracellular solution exchange was performed with rapid exchange perfusion system (flow rate 0.5 - 1 ml/min) (Warner Instruments #64-0186). Cells for recordings were selected based on smoothness of the membrane. Cells were held at a resting membrane potential. Signals were filtered at 3 kHz, sampled at 10 kHz. Once\\nwhole-cell access was obtained the cell was allowed an equilibration time of at least 5 min. Once the cell under recording stabilized, rheobase of single action potentials were assessed. Action potentials were induced by a train of 10 individual current steps 20 ms in. duration, delivered at 0.1 Hz and 120 individual current steps delivered at 1, 3 and 10 Hz, using current injection at 150% of rheobase of baseline. Test compound concentrations were washed in for 5 minutes and step 6 and 7 were repeated for each concentration. Exclusion criteria: series resistance >15 MΩ; unstable recording configuration (15% change of rheobase or access resistance within the same concentration); time frame of drug exposure not respected.\\n\\nThe percentage of action potentials remaining was calculated as the number of action potentials divided by the number of action potentials obtained under control condition at the same frequency. One-way ANOVA (SigmaPlot v14) with Tukey, Bonferroni and Dunnett post-hoc test was used to determine the significance of difference between treatment and control (as specified in the figure and table legends).\\n\\n\\n** Testing of designed peptides efficacy in animal models of pain\\n------------------------------------------------------------\\n\\n\\n** Animals\\n------------------------------------------------------------\\n\\nAll experiments using live animals were conducted in accordance with protocols approved by the Institutional Animal Care and Use Committee of the University of California and adhered to the National Institutes of Health guide for the care and use of Laboratory animals. Great care was taken to reduce the number and minimize suffering of the animals used. Sprague–Dawley male and female rats (250 to 300 g; Charles River, Wilmington, MA, USA) were housed with free access to food and water. They were maintained under a 12 h light/dark cycle with controlled temperature and relative humidity. After acclimation, the animals were each assayed for their baseline responses and then a day later received an intrathecal port placement. After recovery from the port surgery, the rats were assessed for post-surgery behavioral testing. For peptide treatments, rats were randomly divided into groups and tested with assays performed between 9:00 a.m. and 5:00 p.m. Scientists running the experiments were blinded\\nto the treatment protocol at the time of the tests.\\n\\nFor the intrathecal cannulation briefly, the rats were anesthetized by isoflurane inhalation and the hair on the back at the surgical site shaved and the skin cleaned with ethyl alcohol and betadine per aseptic technique and incised about 1 cm in length. The muscle on the side of the L4 -L5 vertebrae was incised and retracted to place a catheter into the subarachnoid space. The tissue was incised by the tip of a bent needle, which allows escape of a small amount of cerebral spinal fluid (CSF). The caudal edge of the cut is lifted, and an intrathecal catheter, 32ga (0.8Fr) PU 18cm, fixed to a stylet with a 27ga luer stub (Instech Laboratories) was gently inserted into the intrathecal space in the midline, dorsal to the spinal cord. The catheter was inserted coinciding with the placement of the distal end of the catheter in proximity to the spinal cord the lumbar vertebrae. The exit end of the catheter is taken out through an opening in the skin and connected to an access port. Rats received\\n2 mg/kg meloxicam once post surgically and 1 mg/kg daily up to 48 hrs post-surgery if needed. The rats were allowed to recover for 7 days and then motor activity of the rats was examined for any sign of alteration. Competent rats were then randomly assigned to groups and tested with experimental compounds and assessed in behavioral assays. At necropsy after the end of the experiments, catheter placements were ensured by injection of colored dye any nonpatent catheters were excluded from the results.\\n\\nChemicals: the peptides were stored at -20°C in dry powder. The powder was weighed on an analytical balance and an amount of sterile artificial cerebral spinal fluid (ACSF, Fischer Scientific) was added to formulate concentrations of 1 mg/mL stock which was diluted to the desired concentration for each individual experiment. Stock solutions were aliquoted and stored at -20°C until further use. Peptide solutions were delivered with a Hamilton airtight syringe fit with an autoinjector (Instech laboratories) and 10 µL volume of the selected concentration or ACSF vehicle was injected intrathecally via the cannula and followed by 100 µL ACSF. The treatments were randomized to include different treatments and controls within the same day experimental setting and observers were blinded to the treatments.\\n\\nBehavioral assays: on the test day animals were first tested for their baseline score in the open field and then hotplate. The open field assay was conducted in an open-field arena (40W x 40L x 30H cm) of a 16-square grid clear acrylic open top chamber. Behavior and activity were monitored for 2 min. Activity was assessed by the number of lines each animal crosses with both hind paws and number of rears as a function of time. The purpose of the open field was to ensure there was not a significant change in motor skill due to the cannulation surgery. Open field ambulatory activity was assessed after long hotplate latency in some animals, but it was not quantified as a treatment outcome given the high stimulated state after the nociceptive tests and the difference in duration on the hotplate between treatment and control groups. Thermal nociceptive assay: The thermal nociception was assessed with a hotplate plate with the intensity set at a constant 52.1°C. Animals were placed individually on\\nthe warm metal surface and timed until their response of hind paw licking or jumping. A cutoff time limit of 30 s was imposed to prevent tissue damage. After paw licking or jump behavior is observed rats were immediately removed from the hotplate. One trial was used for baseline and timepoint assessment in order to not overstimulate or train the animals to the stimulus. Limiting exposure to the hotplate also ensured that no tissue damage occurred with animals that reached the cutoff.\\n\\nChronic pain models: Chemotherapy induced neuropathy was induced in rats with oxaliplatin after i.t catheter placement recovery with a single i.p. dose of oxaliplatin 6 mg/kg. The animals were allowed to recover for 3 days and then were assessed in the open field assay to ensure motor function and with a von Frey assay to assess allodynia to verify their pain state. The von Frey assay with an electronic aesthesiometer quantified the average baseline for a group of male and female rats to be 72.9 ±2.7 grams for the mechanical withdrawal threshold after cannulation but before CIPN model induction which fell to 27.9±2.7 grams indicating allodynia. On the day of treatment rats were assessed for baseline measures and then treated and assayed for thermal nociceptive responses.\\n\\n\\n** Rosetta Scripts for refinement of ProTx-II - hNav1.7/NavAb complex\\n------------------------------------------------------------\\n\\n\\n** Rosetta command lines\\n------------------------------------------------------------\\nsciency picture\\n\\n\\n** Rosetta XML scripts\\n------------------------------------------------------------\\nsciency picture\\n\\n\\n** Rosetta scripts for computational design of ProTx-II variants\\n------------------------------------------------------------\\n\\n\\n** Rosetta command lines\\n------------------------------------------------------------\\nsciency picture\\n\\n\\n** ProTx-II resfile\\n------------------------------------------------------------\\nsciency picture\\n\\n\\n** Rosetta XML file\\n------------------------------------------------------------\\nsciency picture sciency picture sciency picture\\n\\n\\n** Statistical analysis\\n------------------------------------------------------------\\n\\nResults are expressed as means ± SEM. Statistical analysis was performed using Sigmaplot (version 14.0, Systat Software) or Igor Pro 8 (Wavemetrics). Results of in vitro experiments were analyzed using Student’s t test (for differences between two groups). Results of in vivo experiments were analyzed using Two Way Repeated Measures ANOVA with Holm-Sidak post-hoc analysis. Differences between groups with P < 0.05 were considered statistically significant. In experiments on mice technical replicates (n) were individual neurons and biological replicates (N) were individual mice. Details on statistical analysis are included in the figure legends. We calculated the sample power for rat behavioral studies with 8 animals per group is needed to show significant differences of 20% or more. The acceptable power level was considered to be between 0.8 and 0.9. For the thermal hyperalgesia test we assumed the mean value for the control population is 7.5 seconds and we want to be able to distinguish a\\ndifference of 20% with a common standard deviation of about 10%. To test if the two populations are not equal at a significance level of 0.05, a power of 0.8 gives an n=8. The observed effect size was greater than expected and resulted in significant results with even smaller n. Investigators were blinded to identification of compound components in all studies. In brief, compound doses and vehicles were prepared and dosed on the day of the study by an independent researcher from those conducting the behavioral assessments. All treatment groups were randomized independent of baseline responses and the treatments included vehicle and positive controls were randomized on each day of assessment for blinded observers.\\n\\n\\n** References\\n------------------------------------------------------------\\n*\\n1. Adams G. L.\\n2. Pall P. S.\\n3. Grauer S. M.\\n4. Zhou X.\\n5. Ballard J. E.\\n6. Vavrek M.\\n7. Tellers D. M.\\n2022Development of ProTx-II Analogues as Highly Selective Peptide Blockers of Nav1.7 for the Treatment of Pain65:485–496https://doi.org/10.1021/acs.jmedchem.1c01570\\n*\\n1. Ahern C. A.\\n2. Payandeh J.\\n3. Bosmans F.\\n4. Chanda B\\n2016The hitchhiker’s guide to the voltage-gated sodium channel galaxy147:1–24https://doi.org/10.1085/jgp.201511492\\n*\\n1. Alford R. F.\\n2. Fleming P. J.\\n3. Fleming K. G.\\n4. Gray J. J\\n2020Protein Structure Prediction and Design in a Biologically Realistic Implicit Membrane118:2042–2055https://doi.org/10.1016/j.bpj.2020.03.006\\n*\\n1. Backryd E\\n2018Do the potential benefits outweigh the risks? An update on the use of ziconotide in clinical practice22:1193–1202https://doi.org/10.1002/ejp.1229\\n*\\n1. Basbaum A. I.\\n2. Bautista D. M.\\n3. Scherrer G.\\n4. Julius D\\n2009Cellular and molecular mechanisms of pain139:267–284https://doi.org/10.1016/j.cell.2009.09.028\\n*\\n1. Beckley J. T.\\n2. Pajouhesh H.\\n3. Luu G.\\n4. Klas S.\\n5. Delwig A.\\n6. Monteleone D.\\n7. Mulcahy J. V.\\n2021Antinociceptive properties of an isoform-selective inhibitor of Nav1.7 derived from saxitoxin in mouse models of pain162:1250–1261https://doi.org/10.1097/j.pain.0000000000002112\\n*\\n1. Bender B. J.\\n2. Cisneros A\\n3. Duran A. M.\\n4. Finn J. A.\\n5. Fu D.\\n6. Lokits A. D.\\n7. Moretti R.\\n2016Protocols for Molecular Modeling with Rosetta3 and RosettaScripts55:4748–4763https://doi.org/10.1021/acs.biochem.6b00444\\n*\\n1. Bennett D. L.\\n2. Clark A. J.\\n3. Huang J.\\n4. Waxman S. G.\\n5. Dib-Hajj S. D\\n2019The Role of Voltage-Gated Sodium Channels in Pain Signaling99:1079–1151https://doi.org/10.1152/physrev.00052.2017\\n*\\n1. Beyreuther B. K.\\n2. Freitag J.\\n3. Heers C.\\n4. Krebsfanger N.\\n5. Scharfenecker U.\\n6. Stohr T\\n2007Lacosamide: a review of preclinical properties13:21–42https://doi.org/10.1111/j.1527-3458.2007.00001.x\\n*\\n1. Bhattacharya A.\\n2. Wickenden A. D.\\n3. Chaplan S. R\\n2009Sodium channel blockers for the treatment of neuropathic pain6:663–678https://doi.org/10.1016/j.nurt.2009.08.001\\n*\\n1. Black J. A.\\n2. Frezel N.\\n3. Dib-Hajj S. D.\\n4. Waxman S. G\\n2012Expression of Nav1.7 in DRG neurons extends from peripheral terminals in the skin to central preterminal branches and terminals in the dorsal hornMol Pain 8:82https://doi.org/10.1186/1744-8069-8-82\\n*\\n1. Black J. A.\\n2. Nikolajsen L.\\n3. Kroner K.\\n4. Jensen T. S.\\n5. Waxman S. G\\n2008Multiple sodium channel isoforms and mitogen-activated protein kinases are present in painful human neuromas64:644–653https://doi.org/10.1002/ana.21527\\n*\\n1. Bosmans F.\\n2. Swartz K. J\\n2010Targeting voltage sensors in sodium channels with spider toxins31:175–182https://doi.org/10.1016/j.tips.2009.12.007\\n*\\n1. Braden K.\\n2. Stratton H. J.\\n3. Salvemini D.\\n4. Khanna R\\n2022Small molecule targeting NaV1.7 via inhibition of the CRMP2-Ubc9 interaction reduces and prevents pain chronification in a mouse model of oxaliplatin-induced neuropathic painNeurobiol Pain 11:100082https://doi.org/10.1016/j.ynpai.2021.100082\\n*\\n1. Cardoso F. C.\\n2. Dekan Z.\\n3. Rosengren K. J.\\n4. Erickson A.\\n5. Vetter I.\\n6. Deuis J. R.\\n7. Lewis R. J.\\n2015Identification and Characterization of ProTx-III [mu-TRTX-Tp1a], a New Voltage-Gated Sodium Channel Inhibitor from Venom of the Tarantula Thrixopelma pruriens88:291–303https://doi.org/10.1124/mol.115.098178\\n*\\n1. Catterall W. A.\\n2. Goldin A. L.\\n3. Waxman S. G\\n2005International Union of Pharmacology. XLVII. Nomenclature and structure-function relationships of voltage-gated sodium channels57:397–409\\n*\\n1. Chang W.\\n2. Berta T.\\n3. Kim Y. H.\\n4. Lee S.\\n5. Lee S. Y.\\n6. Ji R. R\\n2018Expression and Role of Voltage-Gated Sodium Channels in Human Dorsal Root Ganglion Neurons with Special Focus on Nav1.7, Species Differences, and Regulation by Paclitaxel34:4–12https://doi.org/10.1007/s12264-017-0132-3\\n*\\n1. Clairfeuille T.\\n2. Cloake A.\\n3. Infield D. T.\\n4. Llongueras J. P.\\n5. Arthur C. P.\\n6. Li Z. R.\\n7. Payandeh J.\\n2019Structural basis of alpha-scorpion toxin action on Nav channelsScience https://doi.org/10.1126/science.aav8573\\n*\\n1. Cox J. J.\\n2. Reimann F.\\n3. Nicholas A. K.\\n4. Thornton G.\\n5. Roberts E.\\n6. Springell K.\\n7. Woods C. G.\\n2006An SCN9A channelopathy causes congenital inability to experience pain444:894–898https://doi.org/10.1038/nature05413\\n*\\n1. Cummins T. R.\\n2. Dib-Hajj S. D.\\n3. Waxman S. G\\n2004Electrophysiological properties of mutant Nav1.7 sodium channels in a painful inherited neuropathy24:8232–8236https://doi.org/10.1523/JNEUROSCI.2695-04.2004\\n*\\n1. Deer T.\\n2. Rauck R. L.\\n3. Kim P.\\n4. Saulino M. F.\\n5. Wallace M.\\n6. Grigsby E. J.\\n7. McDowell G. C.\\n2018Effectiveness and Safety of Intrathecal Ziconotide: Interim Analysis of the Patient Registry of Intrathecal Ziconotide Management (PRIZM)18:230–238https://doi.org/10.1111/papr.12599\\n*\\n1. Dib-Hajj S. D.\\n2. Cummins T. R.\\n3. Black J. A.\\n4. Waxman S. G\\n2007From genes to pain: Na v 1.7 and human pain disorders30:555–563https://doi.org/10.1016/j.tins.2007.08.004\\n*\\n1. Dib-Hajj S. D.\\n2. Cummins T. R.\\n3. Black J. A.\\n4. Waxman S. G\\n2010Sodium channels in normal and pathological painAnnual review of neuroscience 33:325–347https://doi.org/10.1146/annurev-neuro-060909-153234\\n*\\n1. Dib-Hajj S. D.\\n2. Yang Y.\\n3. Black J. A.\\n4. Waxman S. G\\n2013The Na(V)1.7 sodium channel: from molecule to man14:49–62https://doi.org/10.1038/nrn3404\\n*\\n1. Drucker D. J\\n2020Advances in oral peptide therapeutics19:277–289https://doi.org/10.1038/s41573-019-0053-0\\n*\\n1. Dussor G.\\n2. Zylka M. J.\\n3. Anderson D. J.\\n4. McCleskey E. W\\n2008Cutaneous sensory neurons expressing the Mrgprd receptor sense extracellular ATP and are putative nociceptors99:1581–1589https://doi.org/10.1152/jn.01396.2007\\n*\\n1. Dustrude E. T.\\n2. Moutal A.\\n3. Yang X.\\n4. Wang Y.\\n5. Khanna M.\\n6. Khanna R\\n2016Hierarchical CRMP2 posttranslational modifications control NaV1.7 function113:https://doi.org/10.1073/pnas.1610531113\\n*\\n1. Estacion M.\\n2. Harty T. P.\\n3. Choi J. S.\\n4. Tyrrell L.\\n5. Dib-Hajj S. D.\\n6. Waxman S. G\\n2009A sodium channel gene SCN9A polymorphism that increases nociceptor excitability66:862–866https://doi.org/10.1002/ana.21895\\n*\\n1. Fertleman C. R.\\n2. Baker M. D.\\n3. Parker K. A.\\n4. Moffatt S.\\n5. Elmslie F. V.\\n6. Abrahamsen B.\\n7. Rees M.\\n2006SCN9A mutations in paroxysmal extreme pain disorder: allelic variants underlie distinct channel defects and phenotypes52:767–774https://doi.org/10.1016/j.neuron.2006.10.006\\n*\\n1. Flinspach M\\n2. Neff R\\n3. Liu Y\\n2015Protoxin-II variants and methods of use Patent No. US20150099705\\n*\\n1. Flinspach M.\\n2. Xu Q.\\n3. Piekarz A. D.\\n4. Fellows R.\\n5. Hagan R.\\n6. Gibbs A.\\n7. Wickenden A. D.\\n2017Insensitivity to pain induced by a potent selective closed-state Nav1.7 inhibitorSci Rep 7:39662https://doi.org/10.1038/srep39662\\n*\\n1. Gingras J.\\n2. Smith S.\\n3. Matson D. J.\\n4. Johnson D.\\n5. Nye K.\\n6. Couture L.\\n7. McDonough S. I.\\n2014Global Nav1.7 knockout mice recapitulate the phenotype of human congenital indifference to pain9:https://doi.org/10.1371/journal.pone.0105895\\n*\\n1. Goldberg Y. P.\\n2. Price N.\\n3. Namdari R.\\n4. Cohen C. J.\\n5. Lamers M. H.\\n6. Winters C.\\n7. Hayden M. R.\\n2012Treatment of Na(v)1.7-mediated pain in inherited erythromelalgia using a novel sodium channel blocker153:80–85https://doi.org/10.1016/j.pain.2011.09.008\\n*\\n1. Graham J.\\n2. Mushin M.\\n3. Kirkpatrick P\\n2004Oxaliplatin3:11–12https://doi.org/10.1038/nrd1287\\n*\\n1. Herzog R. I.\\n2. Cummins T. R.\\n3. Ghassemi F.\\n4. Dib-Hajj S. D.\\n5. Waxman S. G\\n2003Distinct repriming and closed-state inactivation kinetics of Nav1.6 and Nav1.7 sodium channels in mouse spinal sensory neuronsJ Physiol 551:741–750https://doi.org/10.1113/jphysiol.2003.047357\\n*\\n1. Huang J.\\n2. MacKerell A. D.\\n2013CHARMM36 all-atom additive protein force field: validation based on comparison to NMR data34:2135–2145https://doi.org/10.1002/jcc.23354\\n*\\n1. Hutson P.\\n2. Backonja M.\\n3. Knurr H\\n2015Intravenous lidocaine for neuropathic pain: a retrospective analysis of tolerability and efficacy16:531–536https://doi.org/10.1111/pme.12642\\n*\\n1. Iacob E.\\n2. Hagn E. E.\\n3. Sindt J.\\n4. Brogan S.\\n5. Tadler S. C.\\n6. Kennington K. S.\\n7. Junkins S. R.\\n2018Tertiary Care Clinical Experience with Intravenous Lidocaine Infusions for the Treatment of Chronic Pain19:1245–1253https://doi.org/10.1093/pm/pnx167\\n*\\n1. Jiang W.\\n2. Hardy D. J.\\n3. Phillips J. C.\\n4. Mackerell A. D.\\n5. Schulten K.\\n6. Roux B\\n2011High-performance scalable molecular dynamics simulations of a polarizable force field based on classical Drude oscillators in NAMD2:87–92https://doi.org/10.1021/jz101461d\\n*\\n1. Jo S.\\n2. Kim T.\\n3. Iyer V. G.\\n4. Im W\\n2008CHARMM-GUI: a web-based graphical user interface for CHARMM29:1859–1865https://doi.org/10.1002/jcc.20945\\n*\\n1. Kaczorowski G. J.\\n2. McManus O. B.\\n3. Priest B. T.\\n4. Garcia M. L\\n2008Ion channels as drug targets: the next GPCRs131:399–405https://doi.org/10.1085/jgp.200709946\\n*\\n1. Kandil E.\\n2. Melikman E.\\n3. Adinoff B\\n2017Lidocaine Infusion: A Promising Therapeutic Approach for Chronic Pain8:https://doi.org/10.4172/2155-6148.1000697\\n*\\n1. Klugbauer N.\\n2. Lacinova L.\\n3. Flockerzi V.\\n4. Hofmann F\\n1995Structure and functional expression of a new member of the tetrodotoxin-sensitive voltage-activated sodium channel family from human neuroendocrine cells14:1084–1090https://doi.org/10.1002/j.1460-2075.1995.tb07091.x\\n*\\n1. Kuhlman B.\\n2. Dantas G.\\n3. Ireton G. C.\\n4. Varani G.\\n5. Stoddard B. L.\\n6. Baker D\\n2003Design of a novel globular protein fold with atomic-level accuracy302:1364–1368\\n*\\n1. Leman J. K.\\n2. Weitzner B. D.\\n3. Lewis S. M.\\n4. Adolf-Bryfogle J.\\n5. Alam N.\\n6. Alford R. F.\\n7. Bonneau R.\\n2020Macromolecular modeling and design in Rosetta: recent methods and frameworks17:665–680https://doi.org/10.1038/s41592-020-0848-2\\n*\\n1. Li Y.\\n2. North R. Y.\\n3. Rhines L. D.\\n4. Tatsui C. E.\\n5. Rao G.\\n6. Edwards D. D.\\n7. Dougherty P. M.\\n2018DRG Voltage-Gated Sodium Channel 1.7 Is Upregulated in Paclitaxel-Induced Neuropathy in Rats and in Humans with Neuropathic Pain38:1124–1136https://doi.org/10.1523/JNEUROSCI.0899-17.2017\\n*\\n1. Liu M.\\n2. Wood J. N\\n2011The roles of sodium channels in nociception: implications for mechanisms of neuropathic painPain medicine 12:–99https://doi.org/10.1111/j.1526-4637.2011.01158.x\\n*\\n1. Maguire J. B.\\n2. Haddox H. K.\\n3. Strickland D.\\n4. Halabiya S. F.\\n5. Coventry B.\\n6. Griffin J. R.\\n7. Kuhlman B.\\n2021Perturbing the energy landscape for improved packing during computational protein design89:436–449https://doi.org/10.1002/prot.26030\\n*\\n1. Mogil J. S\\n2009Animal models of pain: progress and challenges10:283–294https://doi.org/10.1038/nrn2606\\n*\\n1. Moyer B. D.\\n2. Murray J. K.\\n3. Ligutti J.\\n4. Andrews K.\\n5. Favreau P.\\n6. Jordan J. B.\\n7. Miranda L. P.\\n2018Pharmacological characterization of potent and selective NaV1.7 inhibitors engineered from Chilobrachys jingzhao tarantula venom peptide JzTx-V13:https://doi.org/10.1371/journal.pone.0196791\\n*\\n1. Mulroy M. F\\n2002Systemic toxicity and cardiotoxicity from local anesthetics: incidence and preventive measures27:556–561\\n*\\n1. Murray J. K.\\n2. Ligutti J.\\n3. Liu D.\\n4. Zou A.\\n5. Poppe L.\\n6. Li H.\\n7. Miranda L. P.\\n2015Engineering potent and selective analogues of GpTx-1, a tarantula venom peptide antagonist of the Na(V)1.7 sodium channel58:2299–2314https://doi.org/10.1021/jm501765v\\n*\\n1. Nahin R. L\\n2015Estimates of pain prevalence and severity in adults: United States, 201216:769–780https://doi.org/10.1016/j.jpain.2015.05.002\\n*\\n1. Nassar M. A.\\n2. Stirling L. C.\\n3. Forlani G.\\n4. Baker M. D.\\n5. Matthews E. A.\\n6. Dickenson A. H.\\n7. Wood J. N\\n2004Nociceptor-specific gene deletion reveals a major role for Nav1.7 (PN1) in acute and inflammatory pain101:12706–12711https://doi.org/10.1073/pnas.0404915101\\n*\\n1. Neff R. A.\\n2. Wickenden A. D\\n2021Selective Targeting of Nav1.7 with Engineered Spider Venom-Based Peptides15:179–193https://doi.org/10.1080/19336950.2020.1860382\\n*\\n1. Pan X.\\n2. Li Z.\\n3. Huang X.\\n4. Huang G.\\n5. Gao S.\\n6. Shen H.\\n7. Yan N.\\n2019Molecular basis for pore blockade of human Na(+) channel Nav1.2 by the mu-conotoxin KIIIAScience https://doi.org/10.1126/science.aaw2999\\n*\\n1. Park J. H.\\n2. Carlin K. P.\\n3. Wu G.\\n4. Ilyin V. I.\\n5. Musza L. L.\\n6. Blake P. R.\\n7. Kyle D. J\\n2014Studies examining the relationship between the chemical structure of protoxin II and its activity on voltage gated sodium channels57:6623–6631https://doi.org/10.1021/jm500687u\\n*\\n1. Payandeh J.\\n2. Hackos D. H\\n2018Selective Ligands and Drug Discovery Targeting the Voltage-Gated Sodium Channel Nav1.7Handb Exp Pharmacol 246:271–306https://doi.org/10.1007/164_2018_97\\n*\\n1. Payandeh J.\\n2. Scheuer T.\\n3. Zheng N.\\n4. Catterall W. A\\n2011The crystal structure of a voltage-gated sodium channel475:353–358https://doi.org/10.1038/nature10238\\n*\\n1. Ragsdale D. S.\\n2. McPhee J. C.\\n3. Scheuer T.\\n4. Catterall W. A\\n1994Molecular determinants of state-dependent block of Na+ channels by local anesthetics265:1724–1728\\n*\\n1. Reimann F.\\n2. Cox J. J.\\n3. Belfer I.\\n4. Diatchenko L.\\n5. Zaykin D. V.\\n6. McHale D. P.\\n7. Woods C. G.\\n2010Pain perception is altered by a nucleotide polymorphism in SCN9A107:5148–5153https://doi.org/10.1073/pnas.0913181107\\n*\\n1. Rush A. M.\\n2. Cummins T. R.\\n3. Waxman S. G\\n2007Multiple sodium channels and their roles in electrogenesis within dorsal root ganglion neuronsJ Physiol 579:1–14https://doi.org/10.1113/jphysiol.2006.121483\\n*\\n1. Ryckaert J. P.\\n2. Ciccotti G.\\n3. Berendsen H. J. C\\n1977Numerical-Integration of Cartesian Equations of Motion of a System with Constraints - Molecular- Dynamics of N-Alkanes23:327–341https://doi.org/10.1016/0021-9991(77)90098-5\\n*\\n1. Schmalhofer W. A.\\n2. Calhoun J.\\n3. Burrows R.\\n4. Bailey T.\\n5. Kohler M. G.\\n6. Weinglass A. B.\\n7. Priest B. T.\\n2008ProTx-II, a selective inhibitor of NaV1.7 sodium channels, blocks action potential propagation in nociceptors74:1476–1484https://doi.org/10.1124/mol.108.047670\\n*\\n1. Seal K.\\n2. Becker W.\\n3. Tighe J.\\n4. Li Y.\\n5. Rife T\\n2017Managing Chronic Pain in Primary Care: It Really Does Take a Village32:931–934https://doi.org/10.1007/s11606-017-4047-5\\n*\\n1. Shen H.\\n2. Liu D.\\n3. Wu K.\\n4. Lei J.\\n5. Yan N\\n2019Structures of human Nav1.7 channel in complex with auxiliary subunits and animal toxins363:1303–1308https://doi.org/10.1126/science.aaw2493\\n*\\n1. Shen H.\\n2. Liu D.\\n3. Wu K.\\n4. Lei J.\\n5. Yan N\\n2019Structures of human Nav1.7 channel in complex with auxiliary subunits and animal toxinsScience https://doi.org/10.1126/science.aaw2493\\n*\\n1. Shen H.\\n2. Zhou Q.\\n3. Pan X.\\n4. Li Z.\\n5. Wu J.\\n6. Yan N\\n2017Structure of a eukaryotic voltage-gated sodium channel at near-atomic resolution355:https://doi.org/10.1126/science.aal4326\\n*\\n1. Shields S. D.\\n2. Cheng X.\\n3. Uceyler N.\\n4. Sommer C.\\n5. Dib-Hajj S. D.\\n6. Waxman S. G\\n2012Sodium channel Na(v)1.7 is essential for lowering heat pain threshold after burn injury32:10819–10832https://doi.org/10.1523/JNEUROSCI.0304-12.2012\\n*\\n1. Shiers S.\\n2. Klein R. M.\\n3. Price T. J\\n2020Quantitative differences in neuronal subpopulations between mouse and human dorsal root ganglia demonstrated with RNAscope in situ hybridization161:2410–2424https://doi.org/10.1097/j.pain.0000000000001973\\n*\\n1. Smith J. J.\\n2. Cummins T. R.\\n3. Alphy S.\\n4. Blumenthal K. M\\n2007Molecular interactions of the gating modifier toxin ProTx-II with NaV 1.5: implied existence of a novel toxin binding site coupled to activation282:12687–12697https://doi.org/10.1074/jbc.M610462200\\n*\\n1. Treede R. D.\\n2. Rief W.\\n3. Barke A.\\n4. Aziz Q.\\n5. Bennett M. I.\\n6. Benoliel R.\\n7. Wang S. J.\\n2015A classification of chronic pain for ICD-11156:1003–1007https://doi.org/10.1097/j.pain.0000000000000160\\n*\\n1. van der Wal S. E.\\n2. van den Heuvel S. A.\\n3. Radema S. A.\\n4. van Berkum B. F.\\n5. Vaneker M.\\n6. Steegers M. A.\\n7. Vissers K. C.\\n2016The in vitro mechanisms and in vivo efficacy of intravenous lidocaine on the neuroinflammatory response in acute and chronic pain20:655–674https://doi.org/10.1002/ejp.794\\n*\\n1. Walia K. S.\\n2. Khan E. A.\\n3. Ko D. H.\\n4. Raza S. S.\\n5. Khan Y. N\\n2004Side effects of antiepileptics--a review4:194–203https://doi.org/10.1111/j.1533-2500.2004.04304.x\\n*\\n1. Waxman S. G.\\n2. Zamponi G. W\\n2014Regulating excitability of peripheral afferents: emerging ion channel targets17:153–163https://doi.org/10.1038/nn.3602\\n*\\n1. Wiffen P. J.\\n2. Derry S.\\n3. Moore R. A\\n2011Lamotrigine for acute and chronic painCochrane Database Syst Rev https://doi.org/10.1002/14651858.CD006044.pub3\\n*\\n1. Wiffen P. J.\\n2. Derry S.\\n3. Moore R. A.\\n4. Kalso E. A\\n2014Carbamazepine for chronic neuropathic pain and fibromyalgia in adultsCochrane Database Syst Rev https://doi.org/10.1002/14651858.CD005451.pub3\\n*\\n1. Wu B.\\n2. Murray J. K.\\n3. Andrews K. L.\\n4. Sham K.\\n5. Long J.\\n6. Aral J.\\n7. Biswas K.\\n2018Discovery of Tarantula Venom-Derived NaV1.7-Inhibitory JzTx-V Peptide 5-Br-Trp24 Analogue AM-6120 with Systemic Block of Histamine-Induced Pruritis61:9500–9512https://doi.org/10.1021/acs.jmedchem.8b00736\\n*\\n1. Wulff H.\\n2. Christophersen P.\\n3. Colussi P.\\n4. Chandy K. G.\\n5. Yarov-Yarovoy V\\n2019Antibodies and venom peptides: new modalities for ion channelsNat Rev Drug Discov https://doi.org/10.1038/s41573-019-0013-8\\n*\\n1. Xiao Y.\\n2. Blumenthal K.\\n3. Jackson J. O\\n4. Liang S.\\n5. Cummins T. R.\\n2010The tarantula toxins ProTx-II and huwentoxin-IV differentially interact with human Nav1.7 voltage sensors to inhibit channel activation and inactivation78:1124–1134https://doi.org/10.1124/mol.110.066332\\n*\\n1. Xu H.\\n2. Li T.\\n3. Rohou A.\\n4. Arthur C. P.\\n5. Tzakoniati F.\\n6. Wong E.\\n7. Payandeh J.\\n2019Structural Basis of Nav1.7 Inhibition by a Gating-Modifier Spider ToxinCell https://doi.org/10.1016/j.cell.2018.12.018\\n*\\n1. Yang Y.\\n2. Dib-Hajj S. D.\\n3. Zhang J.\\n4. Zhang Y.\\n5. Tyrrell L.\\n6. Estacion M.\\n7. Waxman S. G\\n2012Structural modelling and mutant cycle analysis predict pharmacoresponsiveness of a Na(V)1.7 mutant channelNat Commun 3:1186https://doi.org/10.1038/ncomms2184\\n*\\n1. Yang Y.\\n2. Wang Y.\\n3. Li S.\\n4. Xu Z.\\n5. Li H.\\n6. Ma L.\\n7. Shen Y.\\n2004Mutations in SCN9A, encoding a sodium channel alpha subunit, in patients with primary erythermalgia41:171–174\\n*\\n1. Yarov-Yarovoy V.\\n2. Brown J.\\n3. Sharp E. M.\\n4. Clare J. J.\\n5. Scheuer T.\\n6. Catterall W. A\\n2001Molecular determinants of voltage-dependent gating and binding of pore-blocking drugs in transmembrane segment IIIS6 of the Na(+) channel alpha subunit276:20–27\\n*\\n1. Yarov-Yarovoy V.\\n2. McPhee J. C.\\n3. Idsvoog D.\\n4. Pate C.\\n5. Scheuer T.\\n6. Catterall W. A\\n2002Role of amino acid residues in transmembrane segments IS6 and IIS6 of the Na+ channel alpha subunit in voltage-dependent gating and drug block277:35393–35401\\n*\\n1. Zeng X.\\n2. Deng M.\\n3. Lin Y.\\n4. Yuan C.\\n5. Pi J.\\n6. Liang S\\n2007Isolation and characterization of Jingzhaotoxin-V, a novel neurotoxin from the venom of the spider Chilobrachys jingzhao49:388–399https://doi.org/10.1016/j.toxicon.2006.10.012\\n*\\n1. Zhang M. M.\\n2. Wilson M. J.\\n3. Azam L.\\n4. Gajewiak J.\\n5. Rivier J. E.\\n6. Bulaj G.\\n7. Yoshikami D.\\n2013Co-expression of Na(V)beta subunits alters the kinetics of inhibition of voltage-gated sodium channels by pore-blocking mu-conotoxins168:1597–1610https://doi.org/10.1111/bph.12051\\n*\\n1. Zheng Y.\\n2. Liu P.\\n3. Bai L.\\n4. Trimmer J. S.\\n5. Bean B. P.\\n6. Ginty D. D\\n2019Deep Sequencing of Somatosensory Neurons Reveals Molecular Determinants of Intrinsic Physiological Properties103:598–616https://doi.org/10.1016/j.neuron.2019.05.039\\n*\\n1. Zylka M. J.\\n2. Rice F. L.\\n3. Anderson D. J\\n2005Topographically distinct epidermal nociceptive circuits revealed by axonal tracers targeted to Mrgprd45:17–25https://doi.org/10.1016/j.neuron.2004.12.015\\n\\n\\n** Author information\\n------------------------------------------------------------\\n1.\\n** Phuong T. Nguyen\\n------------------------------------------------------------\\nDepartment of Physiology and Membrane Biology, University of California Davis, USA\\n2.\\n** Hai M. Nguyen\\n------------------------------------------------------------\\nDepartment of Pharmacology, University of California Davis, USA\\n3.\\n** Karen M. Wagner\\n------------------------------------------------------------\\nDepartment of Entomology and Nematology & Comprehensive Cancer Center, University of California Davis, USA\\n4.\\n** Robert G. Stewart\\n------------------------------------------------------------\\nDepartment of Physiology and Membrane Biology, University of California Davis, USA\\n5.\\n** Vikrant Singh\\n------------------------------------------------------------\\nDepartment of Pharmacology, University of California Davis, USA\\n6.\\n** Parashar Thapa\\n------------------------------------------------------------\\nDepartment of Physiology and Membrane Biology, University of California Davis, USA\\n7.\\n** Yi-Je Chen\\n------------------------------------------------------------\\nDepartment of Pharmacology, University of California Davis, USA\\n8.\\n** Mark W. Lillya\\n------------------------------------------------------------\\nDepartment of Physiology and Membrane Biology, University of California Davis, USA\\n9.\\n** Anh Tuan Ton\\n------------------------------------------------------------\\nAnaBios Corporation, USA\\n10.\\n** Richard Kondo\\n------------------------------------------------------------\\nAnaBios Corporation, USA\\n11.\\n** Andre Ghetti\\n------------------------------------------------------------\\nAnaBios Corporation, USA\\n12.\\n** Michael W. Pennington\\n------------------------------------------------------------\\nAmbiopharm Inc., USA\\n13.\\n** Bruce Hammock\\n------------------------------------------------------------\\nDepartment of Entomology and Nematology & Comprehensive Cancer Center, University of California Davis, USA\\n14.\\n** Theanne N. Griffith\\n------------------------------------------------------------\\nDepartment of Physiology and Membrane Biology, University of California Davis, USA\\n15.\\n** Jon T. Sack\\n------------------------------------------------------------\\nDepartment of Physiology and Membrane Biology, University of California Davis, USA, Department of Anesthesiology and Pain Medicine, University of California Davis, USA\\n16.\\n** Heike Wulff\\n------------------------------------------------------------\\nDepartment of Pharmacology, University of California Davis, USA\\n17.\\n** Vladimir Yarov-Yarovoy\\n------------------------------------------------------------\\nDepartment of Physiology and Membrane Biology, University of California Davis, USA, Department of Anesthesiology and Pain Medicine, University of California Davis, USA, Biophysics Graduate Group, University of California Davis, USA\\n\\n\\n** Figures and data\\n------------------------------------------------------------\\nFigure 1.sciency picture\\n\\nThe ProTx-II based peptide optimization approach. Top, transmembrane (left) and extracellular (right) views of the wild-type ProTx-II – hNav1.7 structure in a deactivated state (Xu et al., 2019 (#c81) ) Key residues on the wild-type ProTx-II are shown in stick representation and labeled. Bottom, interdisciplinary peptide optimization approach involving Rosetta design, molecular dynamics (MD) simulations, peptide synthesis and folding, electrophysiological testing, peptide stability testing, efficacy in mouse and human DRG neurons, and efficacy in animal models of pain.\\nFigure 2.sciency picture\\n\\nThe first optimization round. (A) Sequence alignment of the wild-type ProTx-II with PTx2-2954 and PTx2-2955 peptides. (B) Transmembrane (left panel) and extracellular (right panel) views of the PTx2-2955 – hNa[V]1.7 model. Key residues on the PTx2-2955 and hNa[V]1.7 are shown in stick representation and labeled. Nitrogen atoms are colored in blue and oxygen atoms are colored in red. Hydrogen bonds between donor and acceptor atoms are shown by blue dash line. (C) Block of whole-cell hNa[V]1.7 sodium currents by application of increasing concentrations of PTx2-2955 and followed by 1 mM of wild-type ProTx-II as indicated. (D) Inhibition of hNa[V]1.7 currents was measured as shown in C and plotted as a function of WT ProTx-2 or PTx2-2955 concentration. Fitting the Hill equation to the data yielded IC[50] values (95% confidence interval) of 1.7 [0.5, 2.9] nM (n = 3) for WT ProTx-II and 185.0 [152.1, 217.9] nM (n = 5) for PTx2-2955, respectively.\\nFigure 3.sciency picture\\n\\nThe second optimization round. (A) Sequence alignment of the wild-type ProTx-II with PTx2-2955 and PTx2-2963 - PTx2-2967 peptides. (B) Transmembrane (left panel) and extracellular (right panel) views of the PTx2-3066 – hNa[V]1.7 model. Key residues on the PTx2-3066 and hNa[V]1.7 are shown in stick representation and labeled. Nitrogen atoms are colored in blue and oxygen atoms are colored in red. Hydrogen bonds between donor and acceptor atoms are shown by blue dash line. (C) Block of whole-cell hNa[V]1.7 sodium currents by application of increasing concentrations of PTx2-3066. (D) Inhibition of hNa[V]1.7 currents was measured as shown in C and plotted as a function concentration of PTx2-2955 or its derivatives. Fitting the Hill equation to the data yielded IC[50] values (95% confidence interval) of 185.0 [152.1, 217.9] nM (n = 5), 154.0 [39.9, 268.1] nM (n = 3), nM, 52.6 [7.0, 98.2] nM (n = 3), 73.9 [55.8, 92.0] nM (n = 4), 30.8 [27.9, 33.7] nM (n = 6), and 48.3 [29.5, 67.1] nM (n = 4) for\\nPTx2-2955, PTx2-3063, PTx2-3064, PTx2-3065, PTx2-3066, and PTx2-3067, respectively.\\nFigure 4.sciency picture\\n\\nThe third optimization round. (A) Sequence alignment of the wild-type ProTx-II with PTx2-3066 and PTx2-3127 - PTx2-3128 peptides. (B) Transmembrane (left panel) and extracellular (right panel) views of the PTx2-3127 – hNa[V]1.7 model. Key residues on the PTx2-3127 and hNa[V]1.7 are shown in stick representation and labeled. Nitrogen atoms are colored in blue and oxygen atoms are colored in red. Hydrogen bonds between donor and acceptor atoms are shown by blue dash line. (C) Block of whole-cell hNa[V]1.7 sodium currents by application of increasing concentrations of PTx2- 3127. (D) Inhibition of hNa[V]1.7 currents was measured as shown in C and plotted as a function concentration of PTx2-3066 or its derivatives. Fitting the Hill equation to the data yielded the IC[50] values (95% confidence interval) of 30.8 [27.9, 33.7] nM (n = 6), 2.3 [1.9, 2.7] µM (n = 3), 6.9 [6.7, 7.1] nM (n = 3), and 5.0 [4.6, 5.4] nM (n = 3) for PTx2-3066, PTx2-3126, PTx2-3127, PTx2-3128, respectively.\\nTable 1.sciency picture\\n\\n\\n** Selectivity profile of PTx2-3127 and PTx2-3258 peptides for hNav1.7 versus all other human Nav channels.\\n------------------------------------------------------------\\nTable 2.sciency picture\\n\\n\\n** Comparison of selectivity profiles of PTx2-3127 and PTx2-3258 peptides for hNav1.7 versus hNav1.2, hNav1.4, hNav1.5, and hNav1.6 channels.\\n------------------------------------------------------------\\nFigure 5.sciency picture\\n\\nThe fourth optimization round. (A) Sequence alignment of the wild-type ProTx-II with PTx2-3127, PTx2-3258, PTx2-3259, PTx2-3260, and PTx2-3361 peptides. (B) Transmembrane (left panel) and extracellular (right panel) views of the PTx2-3258 – hNa[V]1.7 model. Key residues on the PTx2-3258 and hNa[V]1.7 are shown in stick representation and labeled. Nitrogen atoms are colored in blue and oxygen atoms are colored in red. Hydrogen bonds between donor and acceptor atoms are shown by blue dash line. (C) Block of whole-cell hNa[V]1.7 sodium currents by application of increasing concentrations of PTx2-3258 and followed by 1 mM of wild-type ProTx-II as indicated. (D) Inhibition of hNa[V]1.7 currents was measured as shown in C and plotted as a function concentration of PTx2-3127 or its derivatives. Fitting the Hill equation to the data yielded the IC[50] values (95% confidence interval) of 6.9 [6.7, 7.1] nM (n = 3), 3.8 [0.3, 7.3] nM (n = 5), 41.8 [16.5, 67.1] nM (n = 3), 20.8 [12.4, 29.2] nM (n = 3),\\n8.6 [5.6, 11.6] nM (n = 3), nM for PTx2-3127, PTx2-3258, PTx2-3259, PTx2-3260, and PTx2-3361, respectively.\\nFigure 6.sciency picture\\n\\nEfficacy of designed Na[V]1.7-selective inhibitor (PTx2-3127) on Na[V] channels of mouse nonpeptidergic nociceptor neurons. (A) Immunofluorescence from MrgprD^GFP labeled NP1 nociceptors (AB_300798, green) and Na[V]1.7 (AB_2877500, magenta) in a mouse L5 spinal section. Orientation of left DRG was moved during sectioning. Lower panels are zoomed in images to highlight colocalization (white) in dorsal horn nociceptor terminals, dorsal root fibers and DRG cell bodies. NP1 nociceptor DRG cell bodies show both high (arrow) and low (arrowhead) immunofluorescence for Na[V]1.7. Top image, dorsal horn and DRG zoom images are a z-projection of 3 confocal images spanning 10.06 µm. Zoom in image of dorsal root fibers is a z-projection of 9 airyscan images spanning 3.18 µm. Scale bar in the top image is 500 µm. Scale bars in the dorsal horn, dorsal root and DRG zoom in panels are 100, 20 and 100 µm respectively. (B) Voltage clamp recordings of Na[V] currents from dissociated NP1 nociceptors showing\\nimpact of PTx2-3127 (red) and subsequent application of TTX (green). Fast- inactivating Na[V] component revealed by subtraction of 1 µM PTx2-3127 trace from total Na[V] current. Black dotted line represents 0 pA of current. (C) Left: Mean current density from 0.4-1 ms of PTx2-3127 sensitive current and vehicle sensitive current. Middle: Mean current density from 0.4-1 ms of TTX sensitive current after application of PTx2-3127 or vehicle. Right: Peak current density of TTX resistant current after application of PTx2-3127 or vehicle and TTX. Point colors represent the same neuron (N = 4 mice). p values calculated by Students T-Test. (D) Peak time of PTx2-3127 sensitive and resistant currents as well as peak time of TTX sensitive and resistant currents. Point colors correspond to the same neurons and is consistent with points shown in C. p values calculated by Students T-Test. (E) Current clamp recording of NP1 action potentials and failures with 3 Hz stimuli in vehicle, 1 µM PTx2-3127 and 1\\nµM TTX. (F) Average remaining NP1 action potentials (APs) versus frequency in PTx2-3127 (red points, n = 8 neurons, N = 4 mice) or in vehicle control (blue points, n = 8 neurons, N = 4 mice). Average remaining APs after PTx2-3127 or vehicle control in 1 µM TTX (red circle green fill and blue circle green fill respectively). Neurons with no sensitivity to TTX were excluded from this analysis. (G) Rheobase of NP1 neurons before PTx2-3127, in PTx2-3127 and in TTX (left). Rheobase of NP1 neurons before vehicle, in vehicle and in TTX (right). p values calculated by Students T-test.\\nFigure 7.sciency picture\\n\\nEfficacy of PTx2-3127 on rheobase and action potentials in human DRG neurons. (A) Rheobase of NP1 neurons before PTx2-3127, in PTx2-3127 and in TTX (left). Rheobase of NP1 neurons before vehicle, in vehicle and in TTX (right). p values calculated by Students T-test. (B) Efficacy of PTx2-3127 on rheobase in human DRG neurons following 24h incubation with Oxaliplatin (50μM). Rheobase after perfusion of the compound is normalized to baseline. (I) Efficacy of PTx2-3127 on action potentials (APs) in human DRG neurons following 24h incubation with Oxaliplatin (50μM). Action potential inhibition after perfusion of the compound is normalized to baseline. APs were elicited at 150% of baseline rheobase. Results are presented as mean ± SEM.\\nTable 3.sciency picture sciency picture\\n\\n\\n** Rheobase and number of action potentials following perfusion of PTx2-3127 following 24h incubation with Oxaliplatin.\\n------------------------------------------------------------\\nFigure 8.sciency picture\\n\\nEfficacy of PTx2-3127 on thermal pain and CIPN neuropathy. PTx2-3127 exhibited dose dependent analgesia on a 52.1°C hotplate increasing the duration of effect as well as number reaching the latency cutoff with doses of 1.2 ug i.t. (A) to 1.6 ug i.t. (B) in naïve female and male rats. The analgesia mediated by PTx2-3127 was significant compared to vehicle controls for both doses (1.2 ug, p ≤ 0.002) and the 1.6 ug dose several rats reached the hotplate latency cutoff (30 seconds to prevent injury) for several hours’ duration (1.6 ug, p < 0.001 and p = 0.013 at indicated time points). (C) PTx2-3127 was also effective against oxaliplatin chemotherapy induced neuropathic pain (CIPN) with responses also significant compared to vehicle controls (p < 0.001) and reaching the latency cutoff. (A-C, Two Way Repeated Measures ANOVA, Holm-Sidak method post hoc, treated versus control).\\nsciency picture sciency picture sciency picture sciency picture sciency picture sciency picture sciency picture sciency picture\\n\\n\\n** Editors\\n------------------------------------------------------------\\n* Senior Editor\\nRichard W Aldrich\\nThe University of Texas at Austin, United States\\n* Reviewing Editor\\nLeon D Islas\\nUniversidad Nacional Autónoma de México, Mexico\\n\\nReviewer #1 (Public Review):\\n\\nVoltage-gated sodium channels are fundamental in the generation and transmission of painful signals. For this reason their inhibition has been proposed as a potential way to treat the worst forms of chronic pain. Since the main subtype of sodium channels involved in pain signaling is Nav1.7, its important that potential inhibitors target this subtype with high efficacy and in a selective manner.\\n\\nIn this manuscript, the authors set out to improve on a peptide, ProTxII, which had been previously put forward as a promising blocker of Nav1.7 channels. For this task, they develop a computational workflow that is based on in silico manipulations of the interaction of ProTxII with a Na channel structure determined previously and evaluation of the predicted mutations with electrophysiology. The method employs previously validated algorithms implemented in Rossetta.\\n\\nThe authors succeed in producing two peptides with improved selectivity for Nav1.7 over other subtypes and capable of blocking at low nanomolar concentrations.\\n\\nThe method seems to be robust enough to be implemented for similar tasks in other protein-protein interaction scenarios, although this remains to be proven.\\n\\nThe results and methods presented here should be useful in several ways. First, the developed peptides can be further evaluated in a clinical setting or at least serve as a scaffold to develop further. Second, the methods should be useful to other groups working on biologicals as clinical pharmacological agents and in pure biophysics to probe surfaces of interactions.\\n\\nReviewer #2 (Public Review):\\n\\nIn this manuscript, Nguyen et al. make use of recently determined cryo-EM structures of Nav1.7 channels in complex with ProTX-II, a peptide spider toxin that binds to VSD2 and stabilizes the deactivated state of the channel in addition to reducing peak currents. Previous work on making modified spider toxin peptides as potent and selective Nav1.7 inhibitors by Merck, Amgen, and others was conducted in a structure-blind manner. This manuscript demonstrates that it is possible to use structure data and computational tools to identify modified spider toxin peptides that show even better potency and selectivity properties.\\n\\nThe authors did a very nice job presenting their detailed results. This detailed material should be very helpful to researchers wanting to expand on this work toward the development of peptide-based pain drugs that selectively target Nav1.7. Their in-vitro electrophysiological analysis is excellent, showing full selectivity profiles (including difficult to work with channels such as hNav1.8 and hNav1.9) from HEK293 cells and also showing inhibition of the TTX-S current with both mouse and human cultured DRG neurons. The in-vivo work shows very strong analgesia in the hotplate model as well as in a model of oxaliplatin-induced peripheral neuroparthy, showing that PTx2-3127 is a powerful analgesic in rats.\\n\\nOverall, this is an excellent investigation into the feasibility of using structural information and computational tools to design potent and selective Nav1.7 inhibitors. Such peptide-based inhibitors might be developed in the future as novel pain drugs.\\n\\nReviewer #3 (Public Review):\\n\\nThis communication describes the molecular design of antinociceptive peptides with the aim to improve the peptide affinity and blocking activity towards Nav1.7. The authors performed in vivo experimental assays of such molecular designed peptides to validate them. The methods incorporate state-of-the-art techniques, and the results are clear and of great quality.\\n\\nStrengths: Many synthetic variants were generated to accomplish the best antinociceptive peptides including its in vitro and in vivo assays.\\n\\nWeaknesses: Some of the reasonings for creating some of the in-silico peptide variants were not clear at all even though they were designed based on ligand-receptor models.",
  "stage": "published",
  "published": "2022-10-20T03:00:00Z",
  "reviewedDate": "2022-10-20T03:00:00Z",
  "versionDate": "2022-10-20T03:00:00Z",
  "statusDate": "2022-10-20T03:00:00Z",
  "subjects": [
    {
      "id": "structural-biology-molecular-biophysics",
      "name": "Structural Biology and Molecular Biophysics"
    }
  ]
}
