{
    "id": "84918",
    "doi": "10.1101/2022.12.01.518662",
    "status": "reviewed",
    "authorLine": "Consuelo Ibar, Krishna Chinthalapudi ... Kenneth D. Irvine",
    "title": "Competition between myosin II and β<sub>H</sub>-Spectrin regulates cytoskeletal tension",
    "published": "2023-01-02T03:00:00Z",
    "reviewedDate": "2023-01-02T03:00:00Z",
    "versionDate": "2023-01-02T03:00:00Z",
    "statusDate": "2023-01-02T03:00:00Z",
    "stage": "published",
    "subjects": [
        {
            "id": "cell-biology",
            "name": "Cell Biology"
        }
    ],
    "indexContent": "<h1 id=\"s1\" class=\"heading-1\">Introduction</h1><p>The spectrin cytoskeleton has been described as a lattice of cross-linked, spring-like proteins that provide structural support to cells <span>(<a href=\"#c30\">Liem, 2016</a><a href=\"#c32\">Machnicka et al., 2014</a>)</span>. Spectrins were first discovered and characterized in red blood cells but are expressed in many cell types. Spectrins can bind to cell membranes and F-actin, linking them together. They are generally thought to act as heterotetramers, composed of two α subunits and two β subunits. <em>Drosophila</em> has one α-spectrin (α-Spec) and two β-spectrins: β-Spectrin (β-Spec) and β-Heavy-Spectrin (β<sub>H</sub>-Spec, encoded by <em>karst</em> (<em>kst</em>)), which could potentially generate two distinct spectrin heterotetramers: (αβ)<sub>2</sub> and (αβ<sub>H</sub>)<sub>2</sub>. β-Spec and β<sub>H</sub>-Spec interact with F-actin through their N-terminal domains, which contain two actin-binding calponin-homology (CH) domains, connecting the spectrin cytoskeleton to the actin cytoskeleton (<a href=\"#c30\">Liem, 2016</a>). In <em>Drosophila</em> epithelia, it has been reported that β-Spec localizes to the lateral sides of cells, β<sub>H</sub>-Spec localizes to the apical sides of cells, and α-Spec localizes both laterally and apically, leading to inferences that spectrin exists as lateral (αβ)<sub>2</sub> tetramers and apical (αβ<sub>H</sub>)<sub>2</sub> tetramers <span>(<a href=\"#c10\">Dubreuil et al., 1997</a><a href=\"#c28\">Lee et al., 1997</a><a href=\"#c56\">Thomas et al., 1998</a><a href=\"#c62\">Zarnescu and Thomas, 1999</a>)</span>. Despite common assumptions that spectrins act as tetramers, there is some evidence that alternative arrangements may exist. In <em>Drosophila</em> ovarian follicle cells, the absence of α-Spec diminishes the recruitment of β<sub>H</sub>-Spec to the apical domain, but it does not affect the recruitment of β-Spec to the lateral domain (<a href=\"#c28\">Lee <em>et al</em>., 1997</a>). Examination in <em>Drosophila</em> of a mutant form of α-Spec that, based on in vitro studies, is unable to bind β-spec and compromised in its ability to bind β<sub>H</sub>-Spec, revealed that it could nonetheless rescue the lethality of an <em>α-Spec</em> mutant (<a href=\"#c25\">Khanna et al., 2015</a>). Experiments done with a mammalian homolog of β<sub>H</sub>-Spec, βV-Spec, showed that it can homodimerize through its C-terminal region, raising the possibility that βV-Spec might be able to cross-link F-actin by itself (<a href=\"#c40\">Papal et al., 2013</a>).</p><p>Several studies have reported that spectrins also regulate Hippo signaling, with effects on cell proliferation and readouts of Hippo signaling reported in <em>Drosophila</em> imaginal discs and ovarian follicles, as well as in cultured mammalian cells <span>(<a href=\"#c6\">Deng et al., 2015</a><a href=\"#c7\">Deng et al., 2020</a><a href=\"#c14\">Fletcher et al., 2015</a><a href=\"#c60\">Wong et al., 2015</a>)</span>. Hippo signaling is a signal transduction network that responds to diverse upstream inputs, including the cytoskeleton and cells’ physical environment <span>(<a href=\"#c35\">Misra and Irvine, 2018</a><a href=\"#c63\">Zheng and Pan, 2019</a>)</span>. Hippo signaling largely modulates cell proliferation and fate through the regulation of Yap family transcriptional co-activator proteins (Yorkie, Yki, in <em>Drosophila</em>, YAP1 and TAZ in humans). Yki is primarily regulated through phosphorylation by the kinase Warts (Wts), which promotes the cytoplasmic localization of Yki. Various potential mechanisms for biomechanical regulation of Yki/Yap activity have been described, but the best-characterized mechanism in <em>Drosophila</em> is the Jub biomechanical pathway. This involves tension-dependent recruitment of an Ajuba LIM protein (Jub in <em>Drosophila</em>, LIMD1 in mammals) to α-catenin at adherens junctions (AJ) <span>(<a href=\"#c1\">Alegot et al., 2019</a><a href=\"#c22\">Ibar et al., 2018</a><a href=\"#c43\">Rauskolb et al., 2022</a><a href=\"#c45\">Rauskolb et al., 2014</a><a href=\"#c51\">Sarpal et al., 2019</a><a href=\"#c54\">Sun et al., 2015</a>)</span>. Jub then recruits and inhibits Wts, resulting in increased Yki activity.</p><p>Studies of the influence of spectrins on Hippo signaling have suggested different mechanisms by which this might occur <span>(<a href=\"#c6\">Deng <em>et al</em>., 2015</a><a href=\"#c7\">Deng <em>et al</em>., 2020</a><a href=\"#c14\">Fletcher <em>et al</em>., 2015</a><a href=\"#c60\">Wong <em>et al</em>., 2015</a>)</span>. (<a href=\"#c14\">Fletcher <em>et al</em>. (2015)</a>), focusing on β<sub>H</sub>-Spec, suggested that the spectrin cytoskeleton influences the membrane density, and thereby the activation state, of upstream regulators of Hippo signaling. (<a href=\"#c60\">Wong <em>et al</em>. (2015)</a>), focusing on β-Spec, suggested that spectrins might influence Hippo signaling by modulating levels of F-actin; increased levels of F-actin have been reported in other studies to be associated with increased Yki/Yap activity <span>(<a href=\"#c2\">Aragona et al., 2013</a><a href=\"#c12\">Fernandez et al., 2011</a><a href=\"#c50\">Sansores-Garcia et al., 2011</a>)</span>. (<a href=\"#c6\">Deng <em>et al</em>. (2015)</a>), focusing on α-Spec, reported that spectrins regulate levels of phosphorylated myosin light chain (required for myosin activation) but surprisingly did not affect levels of myosin or recruitment of Jub, leading them to infer that spectrins can act through a novel tension-dependent but Jub-independent pathway. These same authors later reported that in the pupal eye, spectrins can act through Jub, while suggesting that the action of spectrins in the pupal eye differs from their action in the wing disc <span>(<a href=\"#c6\">Deng <em>et al</em>., 2015</a><a href=\"#c7\">Deng <em>et al</em>., 2020</a>)</span>.</p><p>The disparate models for how spectrins influence Hippo signaling have led to confusion over whether a distinct spectrin-based mechanism exists for the mechanical regulation of Hippo signaling. We were particularly interested in investigating claims that spectrins could alter cytoskeletal tension in wing discs without affecting Jub localization or levels of myosin. Our results reveal that both β<sub>H</sub>-Spec and α-Spec influence Jub recruitment to AJ, and their effects on Yki activity depend upon Jub. Together, these observations argue that spectrins influence Hippo signaling through the Jub biomechanical pathway. Unexpectedly, our investigations also reveal that β<sub>H</sub>-Spec and α-Spec act separately in wing discs - they do not co-localize, nor do they influence each other’s localization. These observations argue that β<sub>H</sub>-Spec does not act as part of an (αβ<sub>H</sub>)<sub>2</sub> tetramer in the wing disc but rather exerts its functions independently of α-Spec. Finally, we establish that β<sub>H</sub>-Spec and myosin reciprocally antagonize each other’s apical localization in wing discs - myosin inhibits β<sub>H</sub>-Spec, and β<sub>H</sub>-Spec inhibits myosin. We further show that β<sub>H</sub>-Spec and myosin can compete in vitro for binding to F-actin. Together with structural modeling, our observations argue that β<sub>H</sub>-Spec and myosin compete for binding to F-actin in vivo. This competition could explain how β<sub>H</sub>-Spec influences myosin activity and further suggests a simple mechanism for the contribution of β<sub>H</sub>-Spec to ratcheting processes that alter cell shape via actomyosin contractility.</p><h1 id=\"s2\" class=\"heading-1\">Results</h1><h2 id=\"s2a\" class=\"heading-2\">β<sub>H</sub>-spectrin regulates myosin activity and levels in wing imaginal discs</h2><p>Prior studies have reported that mutation or RNAi-mediated knockdown of spectrins in wing and eye imaginal discs increased myosin activity, as visualized by staining for myosin light chain phosphorylated at activation sites (pMLC) <span>(<a href=\"#c6\">Deng <em>et al</em>., 2015</a><a href=\"#c15\">Forest et al., 2018</a>)</span>. Surprisingly, it was also reported that levels of myosin co-localizing with F-actin were nonetheless unaffected (<a href=\"#c6\">Deng <em>et al</em>., 2015</a>), whereas changes in myosin activity generally correlate with changes in myosin accumulation <span>(<a href=\"#c13\">Fernandez-Gonzalez et al., 2009</a><a href=\"#c37\">Noll et al., 2017</a>)</span>. To re-examine this, we analyzed wing imaginal discs in which the apical, β<sub>H</sub>-Spec <em>kst</em> was knocked down in posterior cells by expressing UAS-RNAi lines under <em>en-Gal4</em> control. This increased apical pMLC in posterior cells, where levels of β<sub>H</sub>-Spec were reduced (<a href=\"#fig1_S1\">Figure 1- figure supplement 1B</a> and <a href=\"#fig1_S1\">D</a>), consistent with previous reports <span>(<a href=\"#c6\">Deng <em>et al</em>., 2015</a><a href=\"#c15\">Forest <em>et al</em>., 2018</a>)</span>. A difference in junctional tension between anterior (control) cells and posterior (β<sub>H</sub>-Spec RNAi) cells in our experiments was confirmed by measuring the recoil velocity of cell junctions after laser cutting, which demonstrated an increased tension in the β<sub>H</sub>-Spec depleted sides (<a href=\"#fig1\">Figure 1I</a>). To examine myosin protein levels, we employed a widely-used myosin light chain GFP fusion, Sqh:GFP. We found that depletion of β<sub>H</sub>-Spec led to increased levels of junctional myosin (<a href=\"#fig1\">Figure 1B</a>). To quantify these effects on Sqh:GFP levels, we made maps of Sqh:GFP intensity normalized against E-cad intensity. These are displayed on a red (high) to blue (low) heat map (<a href=\"#c38\">Pan et al., 2018</a>) and calculated the ratio of intensities of the anterior (control) versus posterior (experimental) compartments (<a href=\"#c1\">Alegot <em>et al</em>., 2019</a>) (<a href=\"#fig1\">Figure 1E-H, J-K</a>). This was further confirmed by using a distinct β<sub>H</sub>-Spec RNAi line (<em>UAS-kstRNAi</em><sup><em>HMS00882</em></sup>), which similarly increased myosin levels (<a href=\"#fig1_S1\">Figure 1- figure supplement 1E</a>).</p><figure class=\"figure\" id=\"fig1\"><label class=\"figure__label\">Figure 1.</label><img src=\"/iiif/2/10.1101%2F2022.12.01.518662%2F518662v1_fig1.tif/full/max/0/default.jpg\" alt=\"sciency picture\"/><figcaption class=\"figure__caption\"><h3 class=\"heading-3\">β<sub>H</sub>-Spec and α-Spec reduce junctional myosin levels in wing discs</h3><p>(A-D) Apical sections of wing imaginal discs expressing <em>en-Gal4 UAS-RFP UAS-dcr2 sqh:GFP</em> crossed to control (Oregon-R, OR) (A), <em>UAS-kstRNAi</em> (B), <em>UAS-kst-CRISPRa</em> (C), or <em>UAS-α-specRNAi</em> (D) showing the effect on Sqh:GFP (green) levels and localization in the posterior compartment (marked by RFP, blue). Scale bar = 20 μm; all images are at the same magnification. (E-H) Heat maps of relative junctional Sqh:GFP intensity of wing discs. Levels of Sqh:GFP relative to E-cad levels are shown for the different genotypes analyzed in A-D. Heat map scale is indicated on the top. Number of wing discs used for analysis: Control (OR), <em>n</em>=6; <em>UAS-kstRNAi, n</em>=5; UAS-kst-CRISPRa, <em>n</em>=5; <em>UAS-α-specRNAi, n</em>=6. (I) Average recoil velocities after laser cutting of cell junctions in anterior (A) or posterior (P) compartments of wing discs expressing <em>UAS-kstRNAi</em> or <em>UAS-a-specRNAi</em> in posterior cells (n=20). (J-K) Quantification of Sqh:GFP normalized to E-cadherin in posterior cells (P) compared to anterior cells (A) in wing disc expressing the indicated constructs, displayed as individual values, normalized by E-cad (J) or normalized by the mean intensity of Sqh:GFP (K). Data are shown as mean ± 95% CI. Statistical significance in (I) was determined by Student’s t-test between A and P. For (J) and (K), statistical significance was determined by a one-way ANOVA with Dunnett’s multiple comparison test relative to the control (Oregon-R): ns: not significant, *P&lt;0.05; **P≤0.01; ***P≤0.001; ****P≤0.0001.</p></figcaption></figure><p>As earlier studies reporting no effect on myosin levels focused on mutation or knockdown of α-Spec (<a href=\"#c6\">Deng <em>et al</em>., 2015</a>), we considered the possibility that knockdown of α- and β<sub>H</sub>-Spec might differ in their effects on apical myosin accumulation. However, we found that knockdown of α-Spec also caused an increased accumulation of apical myosin, as well as pMLC and junctional tension, similar to the effects of β<sub>H</sub>-Spec knockdown (<a href=\"#fig1\">Figure 1D, H, J, K</a>; <a href=\"#fig1_S1\">Figure 1 - figure supplement 1C</a> and <a href=\"#fig1_S1\">D</a>). α-Spec and β<sub>H</sub>-Spec knockdown differed though in that the thickness of the wing disc epithelium was reduced by α-Spec knockdown, but not by β<sub>H</sub>-Spec knockdown (<a href=\"#fig1_S2\">Figure 1 - figure supplement 2</a>).</p><h2 id=\"s2b\" class=\"heading-2\">β<sub>H</sub>-Spec regulates Hippo signaling through Jub</h2><p>It was previously argued that spectrins do not influence Hippo signaling through the Jub biomechanical pathway in wing discs, in part based on an apparent lack of effect of <em>α-Spec</em> mutation or depletion on Jub localization (<a href=\"#c6\">Deng <em>et al</em>., 2015</a>). However, multiple studies have consistently observed that Jub localization increases when tension at AJ is increased <span>(<a href=\"#c15\">Forest <em>et al</em>., 2018</a><a href=\"#c38\">Pan <em>et al</em>., 2018</a><a href=\"#c42\">Rauskolb et al., 2019</a><a href=\"#c45\">Rauskolb <em>et al</em>., 2014</a><a href=\"#c46\">Razzell et al., 2018</a>)</span>. Thus, we examined Jub localization under conditions of β<sub>H</sub>-Spec depletion. In wing imaginal discs, Jub accumulates in puncta that often occur near intercellular vertices, together with a lower-level, more even accumulation along the cell-cell junctions (<a href=\"#fig2\">Figure 2A</a> and <a href=\"#fig2_S1\">Figure 2– figure supplement 1C</a>). Jub is recruited by a tension-dependent conformational change of α-catenin, and Jub puncta are increased when cytoskeletal tension is higher. Consistent with this, examination of Jub:GFP confirmed that the increased junctional tension and myosin activity caused by β<sub>H</sub>-Spec depletion is associated with increased junctional recruitment of Jub (<a href=\"#fig2\">Figure 2B, F, I-J</a> and <a href=\"#fig2_S1\">Figure 2-figure supplement 1D</a>).</p><figure class=\"figure\" id=\"fig2\"><label class=\"figure__label\">Figure 2.</label><img src=\"/iiif/2/10.1101%2F2022.12.01.518662%2F518662v1_fig2.tif/full/max/0/default.jpg\" alt=\"sciency picture\"/><figcaption class=\"figure__caption\"><h3 class=\"heading-3\">β<sub>H</sub>-Spec and α-Spec reduce junctional Jub levels in wing discs</h3><p>(A-D) Apical sections of wing imaginal discs expressing <em>en-Gal4 UAS-RFP UAS-dcr2 jub:GFP</em> crossed to control (Oregon-R, OR) (A), and <em>UAS-kstRNAi</em> (B), <em>UAS-kst-CRISPRa</em> (C) and <em>UAS-α-specRNAi</em> (D) showing the effect on Jub:GFP (green) levels and localization in the posterior compartment (marked by RFP, blue). Scale bar = 20 μm. (E-H) Heat maps of relative junctional Jub:GFP intensity of wing discs. Levels of Jub:GFP relative to E-cad levels are shown for the different genotypes analyzed. Heat map scale is indicated on the top. Number of wing discs used for analysis: Control (OR), <em>n</em>=9; <em>UAS-kstRNAi, n</em>=8; <em>UAS-kst-CRISPRa, n</em>=6; <em>UAS-α-specRNAi, n</em>=8. (I-J) Quantification of Jub:GFP normalized to E-cadherin (I) or to Jub:GFP mean intensity (J) in posterior cells compared to anterior cells (P/A) in wing discs expressing the indicated constructs, displayed as individual values. Data are shown as mean ± 95% CI, error bars show 95% CI. Statistical significance was determined by one-way ANOVA with Dunnett’s multiple comparison test relative to the control (Oregon-R): ns: not significant, *P&lt;0.05; **P≤0.01; ***P≤0.001; ****P≤0.0001</p></figcaption></figure><p>To assess the functional significance of increased Jub localization to AJ under β<sub>H</sub>-Spec knockdown conditions, we assayed the ability of RNAi-mediated <em>jub</em> knockdown to suppress β<sub>H</sub>-Spec RNAi phenotypes. Knockdown of β<sub>H</sub>-spec throughout the developing wing under <em>nub-Gal4</em> control increases wing size (wings were 116% and 119% of <em>nub-Gal4 UAS-dcr2</em> control size for the two different UAS-RNAi lines used) (<a href=\"#fig3\">Figure 3A, C-D</a> and <a href=\"#fig1\">K</a>) <span>(<a href=\"#c6\">Deng <em>et al</em>., 2015</a><a href=\"#c14\">Fletcher <em>et al</em>., 2015</a>)</span>. Knockdown of <em>jub</em> leads to smaller wings <span>(<a href=\"#c5\">Das Thakur et al., 2010</a><a href=\"#c44\">Rauskolb et al., 2011</a>)</span>. In animals with simultaneous RNAi knockdown of <em>jub</em> and <em>kst</em>, wing size is similar to that of <em>jub</em> RNAi wings (<a href=\"#fig3\">Figure 3B, E-F</a> and <a href=\"#fig3\">K</a>). The epistasis of <em>jub</em> to <em>kst</em> suggests that β<sub>H</sub>-Spec regulates wing size through its tension-dependent regulation of Jub.</p><figure class=\"figure\" id=\"fig3\"><label class=\"figure__label\">Figure 3.</label><img src=\"/iiif/2/10.1101%2F2022.12.01.518662%2F518662v1_fig3.tif/full/max/0/default.jpg\" alt=\"sciency picture\"/><figcaption class=\"figure__caption\"><h3 class=\"heading-3\">Jub is required for β<sub>H</sub>-Spectrin and α-Spec regulation of wing size and ex-lacZ</h3><p>(A-J) Adult wings from flies cultured at 29ºC and expressing UAS transgenes altering spectrin and/or jub expression under control of a <em>nub-Gal4</em> driver. Representative adult wings are shown. (K) Quantification of wing area (mean ± 95% CI, n &gt; 20). Statistical significance was determined by a one-way ANOVA with Tukey’s multiple comparison test. Statistical comparisons are shown relative to <em>nub-Gal4 UAS-dcr2/+</em> in green or relative to <em>nub-Gal4 UAS-dcr2 UAS-jubRNAi/+</em> in purple. Additional selected statistical comparisons are shown in blue. (L-Q) Third-instar wing imaginal discs expressing <em>ex-lacZ en-Gal4 UAS-dcr2 UAS-GFP</em> (green) crossed to OR (L), <em>UAS-kstRNAi</em> (M), <em>UAS-jubRNAi</em> (N), <em>UAS-jubRNAi UAS-kstRNAi</em> (O), <em>UAS-α-specRNAi</em> (P), <em>UAS-jubRNAi UAS-α-specRNAi</em> (Q) stained for expression of ex-lacZ (red/white).</p></figcaption></figure><p>To confirm that the relationship between Jub and β<sub>H</sub>-Spec revealed by analysis of adult wing size corresponds to changes in Hippo pathway activity, we analyzed the expression of a transcriptional reporter of <em>ex, ex-lacZ</em>, which is a direct target of Yki (<a href=\"#c17\">Hamaratoglu et al., 2006</a>). Knockdown of β<sub>H</sub>-Spec in posterior compartments through the expression of UAS-<em>kst</em> RNAi under <em>en-Gal4</em> control caused a mild increase in <em>ex-lacZ</em> expression compared to the anterior compartment and to control posterior compartments (<a href=\"#fig3\">Figure 3M</a>). Knockdown of <em>jub</em> reduces <em>exlacZ</em> expression <span>(<a href=\"#c5\">Das Thakur <em>et al</em>., 2010</a><a href=\"#c44\">Rauskolb <em>et al</em>., 2011</a>)</span>. Simultaneous RNAi knockdown of <em>jub</em> and <em>kst</em> reduced <em>ex-lacZ</em> expression, similar to that in <em>jub</em> RNAi cells (<a href=\"#fig3\">Figure 3N-O</a>). The suppression of the influence of <em>kst</em> on Hippo signaling is again consistent with the inference that β<sub>H</sub>-Spec regulates Hippo signaling through the Jub biomechanical pathway.</p><p>As claims that spectrins act independently of Jub in wing discs were based primarily on analysis of α-Spec, we also examined the effect of α-Spec knockdown on Jub levels. When α-Spec was knocked down in posterior cells by <em>en-Gal4</em> driven RNAi, we observed that recruitment of Jub to cell junctions was increased (<a href=\"#fig2\">Figure 2D, H-J</a>). Moreover, as for β<sub>H</sub>-Spec, we found that the increased wing size and <em>ex-lacZ</em> expression caused by knockdown of α-Spec were suppressed by knockdown of <em>jub</em> (<a href=\"#fig3\">Figure 3G, H, K</a> and <a href=\"#fig3\">P-Q</a>). Thus, as for β<sub>H</sub>-Spec, and as suggested for pupal eyes (<a href=\"#c7\">Deng <em>et al</em>., 2020</a>), our observations imply that α-Spec also regulates Hippo signaling through Jub in wing discs.</p><h2 id=\"s2c\" class=\"heading-2\">β<sub>H</sub>-Spec localizes independently from α-Spec in wing disc cells</h2><p>Prior studies of spectrin function in imaginal discs have assumed that they function as heterotetramers, with an apical complex composed of (αβ<sub>H</sub>)<sub>2</sub> subunits and a lateral complex composed of (αβ)<sub>2</sub> subunits <span>(<a href=\"#c6\">Deng <em>et al</em>., 2015</a><a href=\"#c7\">Deng <em>et al</em>., 2020</a><a href=\"#c14\">Fletcher <em>et al</em>., 2015</a><a href=\"#c56\">Thomas <em>et al</em>., 1998</a>)</span>, as was originally suggested for ovarian follicle cells (<a href=\"#c28\">Lee <em>et al</em>., 1997</a>). However, our examination of spectrin localization in wing imaginal discs suggested that the apical-most distributions of α-Spec and β<sub>H</sub>-Spec differ. To directly compare them, we used an antibody against α-Spec (<a href=\"#c9\">Dubreuil et al., 1987</a>) and a fully functional genomic YFP-trap of β<sub>H</sub>-Spec (Kst:YFP) (<a href=\"#c31\">Lye et al., 2014</a>). β<sub>H</sub>-Spec is localized, as reported previously, at the apicobasal level of the adherens junction in wing discs <span>(<a href=\"#c14\">Fletcher <em>et al</em>., 2015</a><a href=\"#c15\">Forest <em>et al</em>., 2018</a>)</span> (<a href=\"#fig4\">Figure 4A</a> and <a href=\"#fig4\">C</a>). Conversely, α-Spec is enriched in a sub-apical region just below this, with slightly lower levels extending all along the lateral membrane (<a href=\"#fig4\">Figure 4B</a> and <a href=\"#fig4\">C</a>). Only very low levels of α-Spec are detected in the apical plane where β<sub>H</sub>-Spec is detected, and their distributions in this plane appear to differ (<a href=\"#fig4\">Figure 4A</a> and <a href=\"#fig4_S1\">Figure 4 – figure supplement 1A</a>).</p><figure class=\"figure\" id=\"fig4\"><label class=\"figure__label\">Figure 4.</label><img src=\"/iiif/2/10.1101%2F2022.12.01.518662%2F518662v1_fig4.tif/full/max/0/default.jpg\" alt=\"sciency picture\"/><figcaption class=\"figure__caption\"><h3 class=\"heading-3\">β<sub>H</sub>-Spec and α-Spec localize independently in wing imaginal discs.</h3><p>(A-C) Wing imaginal discs expressing Kst:YFP immunostained with α-Spec and E-cad antibodies showing the localization of β<sub>H</sub>-Spec (Kst:YFP) and α-Spec at the AJ (A), below the AJ (B) and in cross sections (C). Upper yellow arrow in cross section indicates AJ layer, lower yellow arrow indicates “Below AJ” layer. (D-F) Apical sections of wing imaginal discs expressing <em>en-Gal4 UAS-dcr2 kstYFP</em> along with <em>UAS-α-specRNAi</em> (D), <em>UAS-β-specRNAi</em> (E) and <em>UAS-kstRNAi</em> (F) immunostained with α-Spec (D and F) or β-Spec antibodies (E), validating the different RNAi lines used and showing that the apical localization of βH-Spec (Kst) is independent of the presence of α-Spec or β-Spec. Scale bar = 20 μm. The AJ layers were obtained by ImSAnE, using as a reference the E-cad channel and 7 layers were projected (2.1 μm).</p></figcaption></figure><p>To confirm that β<sub>H</sub>-Spec and α-Spec localize independently of each other in wing discs, we examined the consequences of depleting α-Spec, β-Spec, or β<sub>H</sub>-Spec on each other’s localization. For this, we used <em>en-Gal4</em> driven UAS-RNAi lines to knockdown one of the spectrin proteins, and then examined whether the localization of the others was affected. These experiments revealed, as expected, that β-Spec knockdown does not significantly affect β<sub>H</sub>-Spec localization (<a href=\"#fig4\">Figure 4E</a>), but it does strongly reduce α-Spec localization (<a href=\"#fig4_S1\">Figure 4 – figure supplement 1C</a>). α-Spec knockdown does not affect β<sub>H</sub>-Spec apical localization (<a href=\"#fig4\">Figure 4D</a>) but slightly reduces β-Spec localization (<a href=\"#fig4_S1\">Figure 4 – figure supplement 1B</a>). Finally, β<sub>H</sub>-Spec depletion does not affect α-Spec localization (<a href=\"#fig4\">Figure 4F</a>). These observations suggest that while α-Spec needs β-Spec to localize to lateral membranes, the localization of β<sub>H</sub>-Spec and α-Spec are functionally independent. Together with the distinct localization of these proteins revealed by imaging, these observations argue against the existence of (αβ<sub>H</sub>)<sub>2</sub> complexes in wing imaginal discs.</p><h2 id=\"s2d\" class=\"heading-2\">β<sub>H</sub>-Spec and apical myosin antagonize each others’ localization to apical F-actin</h2><p>The discovery that β<sub>H</sub>-Spec and α-Spec localize independently led us to consider what factors might influence the apical localization of β<sub>H</sub>-Spec. Intriguingly, the distribution of β<sub>H</sub>-Spec in wing disc cells appears very similar to the apical distribution of F-actin and myosin, and similarities between the localization of β<sub>H</sub>-Spec and myosin in <em>Drosophila</em> embryos have been noted previously <span>(<a href=\"#c27\">Krueger et al., 2020</a><a href=\"#c55\">Thomas and Kiehart, 1994</a>)</span>. To determine whether myosin and β<sub>H</sub>-Spec colocalize in wing discs, we imaged discs expressing GFP-tagged β<sub>H</sub>-Spec (Kst:GFP) and mCherry-tagged myosin light chain (Sqh:mCherry). This revealed extensive co-localization between these proteins in the apical region of wing disc epithelial cells (<a href=\"#fig5\">Figure 5A</a> and <a href=\"#fig5\">B</a>). Quantitation of these images yielded a Pearson’s Correlation Coefficient score of 0.636 (for comparison, the Pearson’s Correlation Coefficient score between Kst:YFP and α-Spec is 0.18 (<a href=\"#fig4\">Figure 4A</a>)).</p><figure class=\"figure\" id=\"fig5\"><label class=\"figure__label\">Figure 5.</label><img src=\"/iiif/2/10.1101%2F2022.12.01.518662%2F518662v1_fig5.tif/full/max/0/default.jpg\" alt=\"sciency picture\"/><figcaption class=\"figure__caption\"><h3 class=\"heading-3\">β<sub>H</sub>-Spec colocalizes with myosin and is regulated by myosin activity</h3><p>(A-B) Wing imaginal disc co-expressing Kst:GFP and the myosin II reporter sqh-sqh::mCherry in apical views (A) and lateral views (B), co-stained with phalloidin for F-actin (blue/white). (C-E) Apical sections of wing discs expressing <em>en-Gal4 UAS-RFP UAS-dcr2 kst:YFP</em> crossed to (Oregon R, OR) (C), <em>UAS-rokRNAi</em> (D) or <em>UAS-sqh</em><sup><em>EE</em></sup> (E) in the posterior compartment (marked by RFP, blue), showing the effect of altering myosin activity on the Kst:YFP localization (gray). Scale bar = 20 μm. (F) Higher magnification of the boxed regions indicated in E. Scale bar = 10 μm (G-I) Heat maps of junctional Kst:GFP intensity relative to E-cad of wing discs (n=5, for each genotype) are shown. Heat map scale is on the right side. (J) Quantification of Kst:YFP intensity normalized to E-cadherin in posterior cells (P) compared to anterior cells (A) in wing discs expressing the indicated constructs (n=5). Data are shown as mean ± 95% CI, error bars indicate CI. Statistical significance was determined by a one-way ANOVA with Dunnett’s multiple comparison test relative to the control (Oregon-R): ns: not significant, *P&lt;0.05; **P≤0.01.</p></figcaption></figure><p>The extensive co-localization of β<sub>H</sub>-Spec and myosin prompted us to investigate the functional relationship between them further. As noted above, reduction of β<sub>H</sub>-Spec leads to increased apical myosin levels and activity. To investigate whether myosin reciprocally regulates β<sub>H</sub>-Spec, we expressed transgenes that modulate actomyosin contractility. RNAi-mediated knockdown of Rho kinase (Rok) reduces myosin activity by reducing phosphorylation of myosin light chain (MLC, encoded in <em>Drosophila</em> by <em>spaghetti squash</em> (<em>sqh</em>)). In wing discs, knockdown of <em>Rok</em> is also associated with reduced recruitment of myosin to apical junctions (<a href=\"#c45\">Rauskolb <em>et al</em>., 2014</a>), consistent with the generally positive correlation between myosin activity and co-localization with F-actin <span>(<a href=\"#c13\">Fernandez-Gonzalez <em>et al</em>., 2009</a><a href=\"#c37\">Noll <em>et al</em>., 2017</a>)</span>. Conversely, examination of β<sub>H</sub>-Spec in wing disc cells expressing <em>Rok</em> RNAi revealed increased levels of β<sub>H</sub>-Spec along apical junctions (<a href=\"#fig5\">Figure 5D</a>). To increase myosin activity, we expressed a constitutively activated, phosphomimetic form of myosin light chain, Sqh<sup>EE</sup> (<a href=\"#c59\">Winter et al., 2001</a>). This increases the recruitment of myosin to AJ (<a href=\"#c45\">Rauskolb <em>et al</em>., 2014</a>), but decreases the recruitment of β<sub>H</sub>-Spec to AJ, and a portion of β<sub>H</sub>-Spec instead appears in apical vesicles (<a href=\"#fig5\">Figure 5E</a>). To quantify these effects on β<sub>H</sub>-Spec levels, we made maps of β<sub>H</sub>-Spec intensity normalized against E-cad intensity, displayed on a red (high) to blue (low) heat map (<a href=\"#c38\">Pan <em>et al</em>., 2018</a>). Calculation of the ratio of intensities of the anterior (control) versus posterior (experimental) compartments further confirmed our observation that myosin antagonizes localization of β<sub>H</sub>-Spec to AJ (<a href=\"#fig5\">Figure 5G-J</a>). Thus, β<sub>H</sub>-Spec and myosin II localization to AJ are affected in opposite ways by changes in cytoskeletal tension.</p><p>The opposing effects of changes in myosin activity on myosin and β<sub>H</sub>-Spec localization, together with the observation that loss of β<sub>H</sub>-Spec leads to increased myosin activity and apical localization, raised the possibility that myosin and β<sub>H</sub>-Spec compete for localization to apical F-actin. To further investigate this possibility, we overexpressed β<sub>H</sub>-Spec using a CRISPR-activator (CRISPRa) approach. This involves the expression of a transcriptional activator fused to dCas9 under UAS control, which can then be recruited to a gene of interest using a single-guide RNA (sgRNA) targeted upstream of the transcription start site <span>(<a href=\"#c23\">Jia et al., 2019</a><a href=\"#c24\">Jia et al., 2018</a>)</span>. To verify the overexpression of β<sub>H</sub>-Spec, we employed it in flies with GFP-tagged β<sub>H</sub>-Spec at the endogenous locus (Kst:GFP). To avoid excessive cell death caused by Kst overexpression we expressed this construct under inducible conditions, using the temperature-sensitive Gal4 repressor Gal80<sup>ts</sup>. Both imaging and western blotting of wing discs confirmed that this CRISPRa approach effectively increased expression of Kst:GFP (<a href=\"#fig1_S1\">Figure 1 - figure supplemental 1G-H</a>). Examination of myosin under β<sub>H</sub>-Spec overexpression conditions, using Sqh:GFP, revealed a substantial reduction of myosin localization to AJs (<a href=\"#fig1\">Figure 1C, G, J-K</a>). Apical cell areas were also increased, consistent with a reduction of junctional tension (<a href=\"#fig1\">Figure 1C</a>). As an independent method to overexpress β<sub>H</sub>-Spec, we used a previously described EP-element insertion near <em>kst</em>, P[EPgy2]EY01010 (UAS-kst<sup>EP</sup>) (<a href=\"#c41\">Pogodalla et al., 2021</a>). Over-expression of β<sub>H</sub>-Spec using UAS-kst<sup>EP</sup> under <em>en-Gal4</em> control also reduced myosin levels at AJ (<a href=\"#fig1_S1\">Figure 1 – figure supplemental 1F</a>), although the effect appeared weaker than that induced by the CRISPRa approach. These results provide further evidence that β<sub>H</sub>-Spec antagonizes myosin recruitment to AJs and establish that this effect can be observed under both increased and decreased β<sub>H</sub>-Spec expression conditions.</p><p>Consistent with these reductions in apical myosin accumulation, β<sub>H</sub>-Spec overexpression also reduced junctional recruitment of Jub (<a href=\"#fig2\">Figure 2C, G, I-J</a> and <a href=\"#fig2_S1\">Figure 2 – figure supplement 1B</a>) and decreased wing size (wings were 92% and 89% of <em>nub-Gal4 UAS-dcr2</em> control size, for the two different overexpression constructs) (<a href=\"#fig3\">Figure 3I-K</a>).</p><h2 id=\"s2e\" class=\"heading-2\">β<sub>H</sub>-Spec and myosin compete for binding to F-actin</h2><p>The reciprocal antagonism between myosin and β<sub>H</sub>-Spec suggested that they could compete for binding to F-actin. β<sub>H</sub>-Spec contains two N-terminal actin-binding domains, CH1 and CH2 (<a href=\"#c30\">Liem, 2016</a>), and myosin contains an actin-binding region in its motor domain (<a href=\"#c8\">Duan et al., 2018</a>). While spectrins and myosin have been purified and characterized in vitro, we lack a mechanistic understanding of the interaction between β<sub>H</sub>-Spec and F-actin and how it might affect myosin binding. To address this, we conducted in vitro co-sedimentation assays with purified protein domains and F-actin. We found that the isolated <em>Drosophila</em> β<sub>H</sub>-Spec actin-binding region binds F-actin weakly (<a href=\"#fig6\">Figure 6A</a>), in agreement with previous reports of F-actin binding by other spectrin CH1-CH2 domains <span>(<a href=\"#c4\">Avery et al., 2017</a><a href=\"#c8\">Duan <em>et al</em>., 2018</a>)</span>. Constitutively active <em>Drosophila</em> Myosin II (subfragment-1-like protein) binding to F-actin appears stronger than β<sub>H</sub>-Spec binding, as at the same concentration a greater fraction of Myosin II is bound to F-actin (<a href=\"#fig6\">Figure 6B</a>). To investigate the antagonism between these proteins observed in vivo, we performed biochemical competition assays between the β<sub>H</sub>-Spec CH domains and myosin for binding to F-actin. F-actin was preincubated with an excess of β<sub>H</sub>-Spec CH domains to saturate binding sites on F-actin, and then increasing concentrations of myosin were added. We found that myosin can displace the actin-binding region of β<sub>H</sub>-Spec from F-actin by ∼50% at the highest myosin concentration that we could use (<a href=\"#fig6\">Figure 6C</a>, bottom). Myosin binding to F-actin was unaffected by preincubation with β<sub>H</sub>-Spec CH domains (<a href=\"#fig6_S1\">Figure 6 – figure supplement 1A</a>), likely due to myosin’s higher binding affinity for F-actin.</p><figure class=\"figure\" id=\"fig6\"><label class=\"figure__label\">Figure 6.</label><img src=\"/iiif/2/10.1101%2F2022.12.01.518662%2F518662v1_fig6.tif/full/max/0/default.jpg\" alt=\"sciency picture\"/><figcaption class=\"figure__caption\"><h3 class=\"heading-3\">Spectrin and myosin have overlapping binding sites on F-actin.</h3><p>(A-C) Co-sedimentation assays with β<sub>H</sub>-Spec CH domains (Spectrin), F-actin, and myosin-II subfragment-1-like protein (myosin). For all sedimentation assays, A, M, Sp, E, and R refer to F-actin, myosin heavy chain, spectrin, myosin essential light chain and myosin regulatory light chain, respectively. Mw indicates marker and S and P refer to supernatant and pellet, respectively. Quantification shows mean ± S.D. of the sedimentation behavior of spectrin and myosin with F-actin (n = 3). (A) Co-sedimentation assay between spectrin (0-12 μM) and F-actin (2 μM). (B) Co-sedimentation assay between myosin (0-2.59 μM) and F-actin (2 μM). (C) Co-sedimentation assay between spectrin (12 μM), myosin (0-2.59 μM) and F-actin (2 μM). Quantification shows that myosin reduces spectrin binding by ∼50% (bottom panel). (D-D’’) Model of the Drosophila CH1 domain (yellow) bound to F-actin (grey) (D). Model of the Drosophila myosin motor domain (purple) bound to F-actin (grey) (D’). Superimposition of the CH1 and myosin motor domain on F-actin. The two strands of the actin filament are shown in light and dark grey and subdomains are indicated.</p></figcaption></figure><p>To gain a structural understanding of the antagonism between β<sub>H</sub>-Spec and myosin we built homology models of the <em>Drosophila</em> CH1-CH2 domain of β<sub>H</sub>-Spec and the myosin II motor domain and compared them with previous cryo-EM structures of the human actin-bound β-III-spectrin actin binding CH1 domain and actin-bound myosin <span>(<a href=\"#c4\">Avery <em>et al</em>., 2017</a><a href=\"#c58\">von der Ecken et al., 2016</a>)</span>. The superimposition of the isolated <em>Drosophila</em> β<sub>H</sub>-Spec CH1 domain model on the human β-III spectrin CH1 domain in a complex with F-actin structure revealed a binding site between actin subdomains (SD) SD1 and SD2 along the filament (<a href=\"#fig6\">Figure 6D</a>). The binding region of myosin on F-actin includes SD1, SD2, and SD3 (<a href=\"#fig6\">Figure 6D</a>). The superimposition of both models suggests that the binding position of the CH1 domain on F-actin sterically interferes with the formation of a strong actin-myosin interface (<a href=\"#fig6\">Figure 6D</a>’’). Modeling of the β<sub>H</sub>-Spec CH1-CH2 domain indicates that the CH2 domain presents additional steric hindrance for myosin binding to F-actin (<a href=\"#fig6_S1\">Figure 6 – figure supplement 1B-B</a>’’). Thus, structural modeling suggests that the binding of spectrin or myosin to individual binding sites on F-actin is mutually exclusive, which could explain why they compete with each other for F-actin association in vivo and in vitro.</p><h1 id=\"s3\" class=\"heading-1\">Discussion</h1><p>Multiple models for how spectrins regulate Hippo signaling have been proposed <span>(<a href=\"#c6\">Deng <em>et al</em>., 2015</a><a href=\"#c7\">Deng <em>et al</em>., 2020</a><a href=\"#c14\">Fletcher <em>et al</em>., 2015</a><a href=\"#c60\">Wong <em>et al</em>., 2015</a>)</span>. We focused on investigating claims that spectrins could alter cytoskeletal tension in wing discs by regulating pMLC levels without affecting localization of myosin or Jub (<a href=\"#c6\">Deng <em>et al</em>., 2015</a>). In contrast to prior studies, we observed that when β<sub>H</sub>-Spec or α-Spec levels are decreased by RNAi, levels of junctional myosin are increased. This increase in junctional myosin levels is associated with increased junctional tension and with increased recruitment of Jub to AJ. We are not certain why these effects were missed in prior studies, but we note that our observations are consistent with studies linking recruitment of both myosin and Jub to AJ under tension <span>(<a href=\"#c1\">Alegot <em>et al</em>., 2019</a><a href=\"#c13\">Fernandez-Gonzalez <em>et al</em>., 2009</a><a href=\"#c22\">Ibar <em>et al</em>., 2018</a><a href=\"#c37\">Noll <em>et al</em>., 2017</a><a href=\"#c42\">Rauskolb <em>et al</em>., 2019</a><a href=\"#c45\">Rauskolb <em>et al</em>., 2014</a><a href=\"#c46\">Razzell <em>et al</em>., 2018</a><a href=\"#c51\">Sarpal <em>et al</em>., 2019</a>)</span>. Moreover, our results are further supported by the observation that <em>jub</em> is genetically required for the influence of spectrin knockdown on Yki activity and wing growth. Taken together, these observations indicate that β<sub>H</sub>-Spec and α-Spec regulate Hippo signaling in wing discs through the Jub-biomechanical pathway, rather than through hypothesized alternate mechanisms.</p><p>Spectrin has been suggested to form two distinct complexes in <em>Drosophila</em> epithelial cells, (αβ)<sub>2</sub> and (αβ<sub>H</sub>)<sub>2</sub> heterotetramers, which localize to the lateral and apical sides of cells, respectively <span>(<a href=\"#c6\">Deng <em>et al</em>., 2015</a><a href=\"#c10\">Dubreuil <em>et al</em>., 1997</a><a href=\"#c14\">Fletcher <em>et al</em>., 2015</a><a href=\"#c28\">Lee <em>et al</em>., 1997</a><a href=\"#c56\">Thomas <em>et al</em>., 1998</a><a href=\"#c62\">Zarnescu and Thomas, 1999</a>)</span>. However, our observations indicate that β<sub>H</sub>-Spec functions independently of α-Spec in wing imaginal discs. α-Spec and β<sub>H</sub>-Spec do not exhibit significant co-localization. Moreover, α-Spec and β<sub>H</sub>-Spec are not required for each other’s localization to apical cell junctions. This contrasts with the requirement for β-Spec for recruitment of α-Spec to lateral membranes in wing discs. The requirement is not entirely reciprocal, as α-Spec knockdown only partially reduces β-Spec recruitment, but this likely reflects mechanisms that recruit spectrins to cell membranes: β-spectrin subunits, but not α-spectrin subunits, have a pleckstrin homology domain that can mediate membrane association, as well as possessing the CH domains that mediate F-actin association. Without these, and without β-Spec, α-Spec does not have a way to associate with lateral membranes.</p><p>An independent role for β<sub>H</sub>-Spec has also been suggested in mammalian photoreceptors, where it was reported that that mammalian βV-Spec does not colocalize with αII-spectrin, and that βV-spec could form homodimers, potentially allowing it to cross-link actin by itself, enabling α-Spec-independent functions (<a href=\"#c40\">Papal <em>et al</em>., 2013</a>). The observation that a mutation in <em>Drosophila</em> α-Spec that disrupts binding to β-Spec <em>in vitro</em> has only mild phenotypes also suggests that spectrin functions do not depend entirely on αβ interactions (<a href=\"#c25\">Khanna <em>et al</em>., 2015</a>). Collectively, our results together with these earlier studies emphasize that the dogma that “Spectrin comprises α-and β-subunits that interact in an antiparallel manner to form an αβ dimer” (<a href=\"#c30\">Liem, 2016</a>) should be revised.</p><p>The conclusion that β<sub>H</sub>-Spec and α-Spec act independently implies that they influence tension at apical junctions through distinct mechanisms. α-Spec might influence AJ tension in wing discs through the mechanism proposed to explain the influence of α- and β-Spec in pupal eyes (<a href=\"#c7\">Deng <em>et al</em>., 2020</a>). It was inferred that α- and β-Spec maintain cell rigidity by linking F-actin to membranes. In the absence of α- or β-Spec, it was proposed that dissociation between F-actin and the membrane leads to an expansion of the cell cortex. This cell shape change increases cytoskeletal tension at AJs, which bind F-actin independently of spectrins. Consistent with this, we observed a decrease in cell height in α-Spec knockdown cells in wing discs. These alterations in cell shape were not observed in β<sub>H</sub>-Spec knockdown cells, further supporting the conclusion that β<sub>H</sub>-Spec and α-Spec act independently to regulate junctional tension.</p><p>Instead, our experiments analyzing the relationship between β<sub>H</sub>-Spec and myosin revealed an entirely different mechanism by which β<sub>H</sub>-Spec influences tension at AJ. We observed a mutual antagonism between β<sub>H</sub>-Spec and myosin <em>in vivo</em> for localization to apical F-actin: decreasing β<sub>H</sub>-Spec increases junctional myosin, while increasing β<sub>H</sub>-Spec decreases junctional myosin. Reciprocally, increasing myosin activity decreases β<sub>H</sub>-Spec localization to apical F-actin, while decreasing myosin activity increases β<sub>H</sub>-Spec localization to apical F-actin. In vitro studies with purified protein domains revealed that myosin can compete with β<sub>H</sub>-Spec for binding to F-actin. Finally, computational modeling of protein structures revealed that myosin and β<sub>H</sub>-Spec would interfere with each other’s binding to F-actin. Together, these observations indicate that β<sub>H</sub>-Spec and myosin directly compete with each other for localization to F-actin. The influence of β<sub>H</sub>-Spec on junctional tension is thus a direct consequence of its competition with myosin for overlapping binding sites on F-actin.</p><p>Despite β<sub>H</sub>-Spec and myosin sharing overlapping binding sites on F-actin, and competing reciprocally in vivo, in our co-sedimentation experiments we could only detect a partial ability of myosin to compete for β<sub>H</sub>-Spec binding, and we could not detect an ability of β<sub>H</sub>-Spec to compete for myosin binding. Several factors are likely to contribute to these observations. First, we could not use higher protein concentrations of myosin or β<sub>H</sub>-Spec due to the need to keep the salt concentration constant and close to physiological levels, and to prevent protein precipitation. Second, it has been suggested for β-Spec that the CH2 domain regulates the actin binding function of the CH1 domain through steric hindrance when the two domains are associated (<a href=\"#c4\">Avery <em>et al</em>., 2017</a>). A specific mutation in β-Spec CH2 (L253P) has been shown to lower the energetic barrier between closed and open structural states, increasing the affinity of β-Spec for F-actin around 1000-fold (<a href=\"#c3\">Avery et al., 2016</a>), but it is unknown how β-Spec or β<sub>H</sub>-Spec conformational changes are normally regulated in vivo and whether both proteins share this regulatory feature. Additionally, phosphorylation of myosin regulatory light chain shifts myosin from a compact, autoinhibited conformation to a filamentous, active conformation <span>(<a href=\"#c26\">Kiehart and Feghali, 1986</a><a href=\"#c57\">Vasquez et al., 2016</a>)</span>. The autoinhibited conformation binds F-actin very weakly (K<sub>D</sub>&gt;100 μM) <span>(<a href=\"#c20\">Heissler and Manstein, 2013</a><a href=\"#c53\">Sellers et al., 1982</a>)</span> compared to the active conformation, suggesting that spectrin could outcompete autoinhibited myosin more effectively than active myosin for binding to F-actin. In addition, other factors including other actin-binding proteins and cytoskeletal tension are likely to influence the dynamic localization and actin-binding properties of both proteins <span>(<a href=\"#c8\">Duan <em>et al</em>., 2018</a><a href=\"#c16\">Greenberg et al., 2016</a>)</span>.</p><p>The competition between β<sub>H</sub>-Spec and myosin also provides key insights into how β<sub>H</sub>-Spec contributes to ratcheting of apical constriction. The apical constriction of cells in the ventral furrow that initiates <em>Drosophila</em> mesoderm invagination occurs through fast constriction pulses interrupted by pauses during which cells must stabilize their constricted state before reinitiating constriction <span>(<a href=\"#c33\">Martin et al., 2009</a><a href=\"#c61\">Xie and Martin, 2015</a>)</span>. This ratcheting-like behavior is thought to be a consequence of the finite length of actin filaments. Myosin contracts the cytoskeleton by driving filaments past each other, and extensive contractions require release and reassociation with new pairs of filaments. β<sub>H</sub>-Spec participates in ratcheting of apical constriction (<a href=\"#c27\">Krueger et al., 2020</a>). When β<sub>H</sub>-Spec is knocked down, cells can undergo cycles of unratcheted apical constriction during which they alternately constrict and then expand. Consequently, most β<sub>H</sub>-Spec depleted embryos fail to complete normal mesoderm invagination. It was proposed that the actin cross-linking function of β<sub>H</sub>-Spec could hold F-actin in place for the next cycle of myosin mediated-contraction, but this raises the question of how myosin and β<sub>H</sub>-Spec association with F-actin are coordinated so that β<sub>H</sub>-Spec prevents relaxation without interfering with constriction. Our results suggest a simple solution: since they compete for the same binding site, the release of myosin from F-actin at the end of a cycle of contraction would naturally be coupled to the accessibility of F-actin for binding by β<sub>H</sub>-Spec. Thus the competition between myosin and β<sub>H</sub>-Spec for binding to F-actin enables myosin-mediated cell contraction to effectively alternate with β<sub>H</sub>-Spec-mediated stabilization.</p><h1 id=\"s4\" class=\"heading-1\">Materials and methods</h1><h2 id=\"s4a\" class=\"heading-2\"><em>Drosophila</em> genetics</h2><p>Unless otherwise indicated, crosses were performed at 29°C. Protein localization and expression levels were monitored using previously characterized transgenes: <em>ex-lacZ</em> (<a href=\"#c17\">Hamaratoglu <em>et al</em>., 2006</a>), <em>kst:YFP</em> (<a href=\"#c31\">Lye <em>et al</em>., 2014</a>), <em>kst:GFP</em> (<a href=\"#c36\">Nagarkar-Jaiswal et al., 2015</a>), <em>jub:GFP</em> (<a href=\"#c48\">Sabino et al., 2011</a>), <em>sqh:GFP</em> (<a href=\"#c47\">Royou et al., 2004</a>) and <em>sqh:mCherry</em> (<a href=\"#c33\">Martin <em>et al</em>., 2009</a>).</p><p>To manipulate gene expression in the posterior compartment, <em>en-Gal4 UAS-RFP; UAS-dcr2</em> flies were crossed with to UAS-RNAi or overexpression lines. RNAi transgenes used were <em>UAS-kstRNAi</em> (v37075), <em>UAS-kstRNAi</em> (HMS00882), <em>UAS-α-specRNAi</em> (v25387), <em>UAS-β-specRNAi</em> (GL01174), <em>UAS-rokRNAi</em> (v104675) and <em>UAS-jubRNAi</em> (v38442). To increase myosin activity, we used <em>UAS-sqh</em><sup><em>EE</em></sup> (<a href=\"#c59\">Winter <em>et al</em>., 2001</a>) and to increase β<sub>H</sub>-Spec levels, we used <em>UAS-kstCRISPRa</em> (this paper) and <em>UAS-kst</em><sup><em>P[EPgy2]EY01010</em></sup> (<a href=\"#c41\">Pogodalla <em>et al</em>., 2021</a>).</p><h2 id=\"s4b\" class=\"heading-2\">DNA Cloning</h2><p>To overexpress β<sub>H</sub>-Spec, we used a second-generation CRISPR/Cas9-transcriptional activation approach (<a href=\"#c24\">Jia et al., 2018</a>), allowing us to recruit the transcriptional machinery near the transcription start site (TSS) of <em>kst</em> under UAS control. For this, we made the following primers to generate a gRNA located less than 400 nt from the TSS: 5’-TTCGGATAAGCCGACAGGGTCTAT and 5’-AAACATAGACCCTGTCGGCTTATC-3’ These primers were duplexed and cloned in the FlySAM 2.0 vector using the BbsI site (<a href=\"#c23\">Jia et al., 2019</a>). Transgenic flies were made by injection (BestGene).</p><p>The actin binding domain (aa 1-278) of <em>kst</em> was cloned into pGEX-3X at the EcoRI site, using the following primers: 5’-gatctgatcgaaggtcgtggaATGACCCAGCGGGACGGC-3’ and 5’-atcgtcagtcagtcacgatgTTACTTCTTGCGATCTGCGTCCATTAGC-3’, and assembled using NEBuilder<sup>®</sup> HiFi DNA Assembly (New England Biolabs, E2621) to generate plasmid pGEX-3X-ABDkst.</p><h2 id=\"s4c\" class=\"heading-2\">Histology and Imaging</h2><p>For most experiments wing discs were fixed in 4% paraformaldehyde for 15 min at room temperature. Sqh:GFP discs were fixed for 12 min. Primary antibodies used were mouse anti-α-Spectrin (1:50, Developmental Studies Hybridoma Bank, 3A9, RRID:AB_528473), rabbit anti-β-spectrin (1:100, a gift from Christian Klämbt) (<a href=\"#c21\">Hulsmeier et al., 2007</a>), rabbit anti-Dcr2 (1:800, Abcam, ab4732, RRID:AB_449344), rabbit anti-pMLC (T18/S19) (1:50, Cell Signaling Technologies, #3671, RRID:AB_330248), rat anti-E-cad (1:200, Developmental Studies Hybridoma Bank, DCAD2-c, RRID:AB_528120), mouse β-galactosidase (1:200, Developmental Studies Hybridoma Bank, JIE7, RRID:AB_528101). Secondary antibodies were used at a 1:100 dilution, and included anti-rat Alexa Fluor 647 (Jackson ImmunoResearch, 712-605-153, RRID:AB_2340694), anti-rabbit Alexa Flour 647 (Jackson ImmunoResearch, 711-605-152, RRID:AB_2492288), anti-mouse Alexa Fluor 647 (Jackson ImmunoResearch, 715-605-151, RRID:AB_2340863), anti-mouse Cy3 (Jackson ImmunoResearch, 715-165-151, RRID:AB_2315777), anti-rabbit Cy3 (Jackson ImmunoResearch, 711-165-152, RRID:AB_2307443), anti-rat Cy3 (Jackson ImmunoResearch, 712-165-153, RRID:AB_2340667), anti-mouse Alexa Fluor 488 (Thermo Fisher Scientific, A-21202, RRID:AB_141607) and anti-rabbit Alexa Flour 488 (Thermo Fisher Scientific, A-21206, RRID:AB_2535792). DNA was stained using Hoechst (Invitrogen, H3570). Wing discs were removed and mounted on a slide in Vectashield (Vector Laboratories, H-1000). Confocal images were captured on a Leica SP8 microscope.</p><h2 id=\"s4d\" class=\"heading-2\">Immunobloting</h2><p>Wing discs (20 discs per lane) were lysed in 2× Laemmli Sample Buffer (Bio-Rad, #1610737) supplemented with protease inhibitor cocktail (Roche) and phosphatase inhibitor cocktail (Calbiochem). Protein samples were loaded in 4% to 15% gradient gels (Bio-Rad). Antibodies used for immunoblotting include mouse anti-GFP (1:1000; Cell Signaling Technology, #2955, RRID:AB_1196614) and as a loading control rabbit anti-GAPDH (1:5000; Santa Cruz Biotechnology, sc-25778, RRID:AB_10167668). Blots were visualized with fluorescent-conjugated secondary antibodies (LI-COR Biosciences) and the Odyssey Imaging System (LICOR Biosciences).</p><h2 id=\"s4e\" class=\"heading-2\">Laser ablation</h2><p>Live imaging and laser ablation experiments were performed as previously described (<a href=\"#c45\">Rauskolb <em>et al</em>., 2014</a>). <em>en-Gal4 UAS-RFP/CyO; UAS-dcr2/TM6B</em> flies were crossed with <em>UAS-kstRNAi; Ubi-E-cad:GFP/TM6B</em> flies. Eggs were collected at 25ºC for 4 hours and then shifted to 29°C for 88 h. Wing disc culture was based on the procedure of (<a href=\"#c11\">Dye et al., 2017</a>). A stock medium was prepared using Grace’s medium (Sigma, G9771) without sodium bicarbonate but with the addition of 5 mM Bis-Tris and the pH was adjusted to 6.6-6.7 at room temperature. This was stored at 4ºC for less than a month. Before every experiment, we added 5% fetal bovine serum (FBS; ThermoFisher, 10082147), Penicillin-Streptomycin (Thermo-Fisher, #15070063, 100X stock solution) and 10 nM 20-hydroxy-ecdysone (Sigma, H5142) to the medium. Larvae were floated on 25% sucrose and transferred into glass dishes with culture medium. Larvae of the desired genotype were selected and sterilized in 70% ethanol for 1 min. Then, we drew a circle on the glass bottom of a 35-mm glass-bottomed Petri dish (MatTek, P35G-0-14-C) using glue made by mixing heptane with tape (Tesa, 5388). Wing discs were dissected out of larvae, transferred into this Petri dish, and oriented using tungsten needles. Then we covered the discs with a Cyclopore Polycarbonate membrane (GE Health, 7060-2513) and glued it to the glass bottom to immobilize discs. Discs were imaged every 0.2 s on a Perkin Elmer Ultraview spinning disc confocal microscope, and ablation of junctions was achieved using a Micropoint pulsed laser (Andor Technology) tuned to 365 nm. Paired cutting of junctions, one in the anterior compartment and another in the posterior compartment at a similar location, were performed and compared. The displacement of vertices for the first second after ablation was used to calculate the velocities.</p><h2 id=\"s4f\" class=\"heading-2\">Quantification and Statistical Analysis</h2><p>To obtain the surface of the wing disc and remove signals from the peripodial epithelium, we used the MATLAB toolbox ImSAnE (<a href=\"#c18\">Heemskerk and Streichan, 2015</a>) to detect and isolate a slice of the disc epithelium that surrounds the adherens junctions, using E-cad as a reference, as described previously (<a href=\"#c39\">Pan et al., 2016</a>). The KstGFP, KstYFP, SqhGFP and JubGFP images were created using ImSAnE. For septate junctions images, the surface detector was moved just below the E-cadherin level.</p><p>For the fluorescence intensity heat maps, a custom MATLAB script was used <span>(<a href=\"#c1\">Alegot <em>et al</em>., 2019</a><a href=\"#c38\">Pan <em>et al</em>., 2018</a>)</span> (<a href=\"https://github.com/alegoth/Wing-disc-Intensity-Analysis\">https://github.com/alegoth/Wing-disc-Intensity-Analysis</a>). The script generates a 3D mask with the normalization channel (E-cad) keeping only the relevant pixels. The wing disc center (intersection between AP/DV boundaries) is picked for each image manually. Then, the picture is split into blocks of a given <em>xy</em> size (3×3 μm), starting from the center, and the average intensity per pixel of each channel is measured. The intensity of the reference channel and the channel of interest are normalized over their respective average intensity. The ratio of the channel of interest over the reference channel is then determined. To average several discs, only matrices of the same <em>xy</em> size blocks were used. The center of the disc serves as a reference point; smaller matrices were expanded to correspond to the size of the biggest matrix and filled with NaN (Not-a-Number). We determined the minimum number of values required (usually three) to average the ratio for a given position. This means that the edges of the average disk are composed of the same minimum number of values, which corresponds to the <em>n</em> given for each experiment. Finally, signals from several wing discs were averaged and represented by the heat map, and a posterior versus anterior ratio was calculated.</p><p>Pearson’s correlation coefficient was calculated to establish co-localization between different proteins by using the Coloc 2 Plugin for ImageJ (<a href=\"https://imagej.net/plugins/coloc-2\">https://imagej.net/plugins/coloc-2</a>).</p><p>Statistical significance was determined with GraphPad Prism software by performing Student’s t-test (for comparison between two observations) or analysis of variance (ANOVA) with P&lt;0.05 set as the criteria for significance. The Dunnett test was used to derive adjusted P-values for comparisons against the control experimental value, and the Tukey test was used to derive adjusted P-values for multiple comparisons.</p><h2 id=\"s4g\" class=\"heading-2\">Protein production and purification</h2><p>To purify the actin binding domain of β<sub>H</sub>-Spec fused with GST, we transformed BL21-DE3 cells (NEB) with pGEX-3X-ABDkst. Protein expression was induced with 0.2 mM isopropyl-β-D-thiogalactoside (IPTG) at room temperature for 12–15 h. Cells were harvested and lysed by sonication in lysis buffer: PBS (pH 7.4), 1% Triton X-100, 5 mM dithiothreitol, 1 mM phenylmethyl sulfonyl fluoride and complete Mini Protease Inhibitor Cocktail (Roche). After centrifugation, the supernatant was collected and passed through a 1 mL GST-Trap column (Cytiva) at 4 °C. Then, the column was washed with PBS (pH 7.4) until the absorbance reached a steady baseline. To remove the GST-tag, the column was loaded with 80 units of Factor Xa (New England Biolabs, P8010) in cleavage buffer: 50 mM Tris-HCl, 150 mM NaCl, 1 mM CaCl<sub>2</sub>, pH 7.5 and incubated for 16 h at room temperature. To elute the ABD of β<sub>H</sub>-Spec while removing the protease simultaneously, we used a HiTrap Benzamidine FF (Cytiva) column in tandem with the GST-trap column and eluted the ABD of β<sub>H</sub>-spec with cleavage buffer. To switch buffers, we dialyzed the protein against 25 mM HEPES pH 7.4, 150 mM NaCl, 1 mM TCP overnight. Then the purified protein was concentrated by ultrafiltration to 30 μM and stored at −80ºC until used in experiments.</p><p>G-actin was prepared from rabbit muscle acetone powder as reported (<a href=\"#c29\">Lehrer and Kerwar, 1972</a>) and further purified with size exclusion chromatography on a Superdex 75 pg column (Cytiva, # 28989333) in buffer containing 5 mM Tris/HCl pH=8, 0.2 mM CaCl<sub>2</sub>, 0.5 mM ATP, 1 mM DTT. G-actin was polymerized to F-actin by the addition of 10X polymerization buffer (100 mM HEPES pH 7.0, 500 mM KCl, 20 mM MgCl<sub>2</sub>, 10 mM EDTA). <em>Drosophila</em> nonmuscle myosin-2 subfragment-1-like protein (<em>Zip</em>, amino acids 1-813) was recombinantly overproduced together with the myosin regulatory (<em>Sqh</em>) and essential light chain (<em>Mlc-c</em>) in the baculovirus/<em>Sf</em>9 insect cell system (Thermo Fisher Scientific) and prepared as described (<a href=\"#c19\">Heissler et al., 2015</a>).</p><h2 id=\"s4h\" class=\"heading-2\">Co-sedimentation assays</h2><p>For co-sedimentation assays, β<sub>H</sub>-Spec CH domains or myosin were incubated with F-actin for 15 mins at room temperature in an assay buffer containing 10 mM HEPES pH 7.4, 100 mM NaCl, 0.1 mM EGTA, 20μM ATP and 1 mM DTT and subsequently sedimented (100,000 x g, 15 min, 4°C, TLA-100 rotor) in an Ultima MAX-XP ultracentrifuge (Beckman). For competition assays, β<sub>H</sub>-Spec and actin were preincubated for 15 mins at room temperature before the addition of myosin. Supernatant and pellet fractions were separated and the pellet fraction was resuspended in an equal volume of assay buffer. Samples were supplemented with NuPAGE LDS sample buffer (Invitrogen, #NP0007) and heated for 10 min at 90°C. Supernatant and pellet fractions were resolved on 4-12% NuPAGE Bis-Tris polyacrylamide gels (Invitrogen, NP0323BOX). Gels were incubated with PageBlue protein staining solution (Thermo Scientific, #24620) and destained with water. Gels were documented with a ChemiDoc MP (Bio-Rad) and densitometric analysis was performed with Fiji (<a href=\"#c52\">Schindelin et al., 2012</a>). Data plots and secondary analysis were performed in Origin 2019.</p><h2 id=\"s4i\" class=\"heading-2\">Model building</h2><p>A homology model of the <em>Drosophila</em> myosin motor domain (<em>Zip</em>, amino acids 1-813) in the actin-bound state was modeled using the cryo-EM structure of the human nonmuscle myosin-2C motor domain in the rigor state (PDB entry: 5JLH) as a template. Both motor domains share ∼ 72% sequence identity at the amino acid level. The motor domain model was built using Modeler (<a href=\"#c49\">Sali and Blundell, 1993</a>). The model of the <em>Drosophila</em> β<sub>H</sub>-spectrin calponin homology domain tandem (CH1-CH2, amino acids 1-278) was modeled using ColabFold (<a href=\"#c34\">Mirdita et al., 2022</a>). This model was superimposed onto the cryo-EM structure of the human β-III spectrin CH1 domain bound to F-actin (PDB entry: 6ANU) for binding site analysis.</p><h1 class=\"heading-1\">Acknowledgements</h1><p>We thank Christian Klämbt for the β-spec antibody, and Richard Ebright and Bryce Nickels for sharing equipment for protein purification. This research was supported by National Institutes of Health grants R01GM143539 (KC) and GM131748 (KDI).</p><h1 id=\"s5\" class=\"heading-1\">Data availability</h1><p>All data generated or analyzed during this study are included in the manuscript and supporting files. Plasmids and transgenic fly lines generated in this study are all available on request</p><figure class=\"figure\" id=\"fig1_S1\"><label class=\"figure__label\">Figure 1 – figure supplement 1.</label><img src=\"/iiif/2/10.1101%2F2022.12.01.518662%2F518662v1_fig1_S1.tif/full/max/0/default.jpg\" alt=\"sciency picture\"/><figcaption class=\"figure__caption\"><h2 class=\"heading-2\">Modulation of levels of total and active myosin in wing imaginal discs by β<sub>H</sub>-Spec.</h2><p>(A-C) Apical sections of third instar wing imaginal discs expressing <em>en-Gal4 UAS-dcr2 UAS-RFP</em> (blue) crossed with control (A), <em>UAS-kstRNAi</em> (B) and <em>UAS-α-SpecRNAi</em> (C), stained with pMLC antibody (green) and E-cad (red). (D) Quantification of pMLC normalized to E-cadherin in posterior cells (P) compared to anterior cells (A) in wing discs expressing the indicated constructs, displayed as individual values. Number of wing discs used for analysis: Control (OR), n=5; <em>UAS-kstRNAi</em>, n=8, <em>UAS-α-SpecRNAi</em>, n=5. Error bars show mean with 95% CI. Statistical significance was determined by one-way ANOVA with Dunnett’s multiple comparison test. Statistical comparisons are shown relative to the control (OR). ***P≤0.001, ****P&lt;0.0001. (E-F) Third instar wing imaginal discs expressing en-Gal4 UAS-dcr2 UAS-RFP (blue) sqh:GFP (green) in combination with <em>UAS-kstRNAi</em><sup><em>HMS00882</em></sup> (E) and <em>UAS-kst</em><sup><em>P[EPgy2]EY01010</em></sup> (F), stained for E-cad (red). (G) Apical sections of a wing imaginal disc expressing <em>en-Gal4 tubG80</em><sup><em>ts</em></sup><em>kst:GFP</em> crossed with <em>UAS-kstCRISPRa</em>, stained for E-cad (red). Expression of Kst:GFP (green) was induced by transferring the flies from 18ºC to 29ºC for 24 h. (H) Western blots of wing disc lysates with the genotypes shown in the figure: <em>nub-Gal4 UAS-Dcr2 kst:GFP</em> crossed with w1118 (control) and <em>UAS-kstCRISPRa</em> (experimental). Kst:GFP was detected using a GFP antibody. GAPDH was used as a loading control.</p></figcaption></figure><figure class=\"figure\" id=\"fig1_S2\"><label class=\"figure__label\">Figure 1 – figure supplement 2.</label><img src=\"/iiif/2/10.1101%2F2022.12.01.518662%2F518662v1_fig1_S2.tif/full/max/0/default.jpg\" alt=\"sciency picture\"/><figcaption class=\"figure__caption\"><h2 class=\"heading-2\">α-Spec knockdown affects wing imaginal disc thickness.</h2><p>(A-C) Lateral views of wing imaginal discs expressing <em>en-Gal4 UAS-RFP UAS-dcr2</em> crossed with control (Oregon-R, OR) (A), <em>UAS-kstRNAi</em> (B) or <em>UAS-α-specRNAi</em> (C), immunostained with phalloidin to label F-actin (green), Hoechst to label nuclei (blue) and the posterior compartment marked by RFP (red). Dashed lines indicate 30 μm from the center. Scale bar = 20 μm (D) Quantification of wing imaginal disc thickness determined 30 μm from the center in anterior (A) and posterior (P) sides for the different genotypes indicated. Statistical significance was determined by Student’s t-test. ns: not significative; **P≤0.01; ***P≤0.001</p></figcaption></figure><figure class=\"figure\" id=\"fig2_S1\"><label class=\"figure__label\">Figure 2 – figure supplement 1.</label><img src=\"/iiif/2/10.1101%2F2022.12.01.518662%2F518662v1_fig2_S1.tif/full/max/0/default.jpg\" alt=\"sciency picture\"/><figcaption class=\"figure__caption\"><h2 class=\"heading-2\">β<sub>H</sub>-spec modulates the recruitment of Jub:GFP to AJs.</h2><p>(A, B) Third instar wing imaginal discs expressing <em>en-Gal4 UAS-dcr2 UAS-RFP</em> (blue) <em>jub:GFP</em> (green) in combination with <em>UAS-kstRNAi</em><sup><em>HMS00882</em></sup> (A) or <em>UAS-kst</em><sup><em>P[EPgy2]EY01010</em></sup> (B) stained for E-cad (red). (C, D) Apical sections of wing imaginal discs expressing <em>en-Gal4 UAS-RFP UAS-dcr2 jubGFP</em> crossed to control (Oregon-R, OR) (C), <em>UAS-kstRNAi</em> (D) from <a href=\"#fig2\">Figure 2</a>. Columns to the right show higher magnification views of the anterior (a) and posterior boxes (p).</p></figcaption></figure><figure class=\"figure\" id=\"fig4_S1\"><label class=\"figure__label\">Figure 4 – figure supplement 1.</label><img src=\"/iiif/2/10.1101%2F2022.12.01.518662%2F518662v1_fig4_S1.tif/full/max/0/default.jpg\" alt=\"sciency picture\"/><figcaption class=\"figure__caption\"><h2 class=\"heading-2\">Loss of β-Spec affects α-Spec localization in wing discs.</h2><p>(A) Higher magnification of the different channels in the boxed region indicated in A (from <a href=\"#fig4\">Figure 4A</a>). (B-E) Sections of a wing imaginal disc expressing <em>en-Gal4 UAS-RFP UAS-dcr2</em> crossed with <em>UAS-</em>α<em>-specRNAi</em> (B-C) or <em>UAS-β-specRNAi</em> (D-E) with lateral views (C, E) stained with mouse α-Spec (green) and rabbit β-Spec (red) antibody. Scale bar = 20 μm.</p></figcaption></figure><figure class=\"figure\" id=\"fig6_S1\"><label class=\"figure__label\">Figure 6 – figure supplement 1.</label><img src=\"/iiif/2/10.1101%2F2022.12.01.518662%2F518662v1_fig6_S1.tif/full/max/0/default.jpg\" alt=\"sciency picture\"/><figcaption class=\"figure__caption\"><h2 class=\"heading-2\">Additional examination of competition between spectrin and myosin for F-actin.</h2><p>(A) Quantification of the binding behavior of myosin to F-actin in the presence and absence of spectrin in co-sedimentation assays. The similarity in actin binding indicates that pre-loading spectrin does not interfere with myosin binding to F-actin under these assay conditions. (B) Model of the Drosophila CH1-CH2 domain (CH1, yellow; CH2, blue) bound to F-actin (grey) (B’). Model of the Drosophila myosin motor domain (purple) bound to F-actin (grey) (B’’). Superimposition of the CH1-CH2 and myosin motor domain on F-actin. The two strands of the actin filament are shown in light and dark grey and subdomains are indicated.</p></figcaption></figure>"
}
