{
    "id": "85111",
    "doi": "10.1101/2022.11.08.515698",
    "pdf": "https://www.biorxiv.org/content/10.1101/2022.11.08.515698v2.full.pdf",
    "status": "reviewed",
    "authorLine": "Rebecca Jordan, Georg B. Keller",
    "title": "The locus coeruleus broadcasts prediction errors across the cortex to promote sensorimotor plasticity",
    "indexContent": "<h1 id=\"s1\" class=\"heading-1\">Introduction</h1><p>Through experience with the world, brains learn to predict the sensory feedback generated by movement. For instance, learning the precise relationship between motor commands and the resulting visual feedback is the basis for both feedback control of movements as well as distinguishing self-generated from externally generated sensory feedback. One way that the brain may learn to do this is via predictive processing <span>(<a href=\"#c26\">Keller and Mrsic-Flogel, 2018</a><a href=\"#c40\">Rao and Ballard, 1999</a>)</span>. In a sensorimotor version of this framework, the brain learns an internal model which transforms motor activity into a prediction of the sensory consequences. The framework postulates that specific neurons are responsible for computing discrepancies – known as prediction errors – between the prediction and the actual sensory inputs received. The neocortex has been shown to compute signals consistent with sensorimotor prediction errors <span>(<a href=\"#c13\">Eliades and Wang, 2008</a><a href=\"#c26\">Keller and Mrsic-Flogel, 2018</a><a href=\"#c46\">Schneider et al., 2018</a>)</span>. In the primary visual cortex (V1), excitatory neurons in layer 2/3 compute mismatches between visual flow speed and locomotion speed <span>(<a href=\"#c2\">Attinger et al., 2017</a><a href=\"#c21\">Jordan and Keller, 2020</a><a href=\"#c25\">Keller et al., 2012</a><a href=\"#c58\">Zmarz and Keller, 2016</a>)</span>. Such sensorimotor prediction error responses in the cortex depend on ongoing and developmental experience with sensorimotor coupling <span>(<a href=\"#c2\">Attinger et al., 2017</a><a href=\"#c46\">Schneider et al., 2018</a><a href=\"#c54\">Vasilevskaya et al., 2022</a><a href=\"#c56\">Widmer et al., 2022</a>)</span>, and therefore the computation underlying them is actively learned. In predictive processing, one main function of prediction errors is to drive corrective plasticity in the internal model that generates predictions (<a href=\"#c26\">Keller and Mrsic-Flogel, 2018</a>).</p><p>During the first sensorimotor experience in life, prediction errors should strongly drive learning of an internal model of the world, while later in life, prediction errors should update internal models primarily when overall prediction errors are abundant (for instance, in novel or volatile situations). One way to implement such a developmental or contextual shift in the amount of plasticity induced by a particular prediction error would be a gating signal. The characteristics of a gating signal are that it is activated by prediction errors and that it permits increases in plasticity. In addition, because it is not driving plasticity, but simply gating it, it can be low dimensional (i.e., the same for all neurons). Prime candidates for a gating signal are neuromodulatory systems. Dopaminergic neurons in the midbrain signal reward prediction errors <span>(<a href=\"#c27\">Kim et al., 2020</a><a href=\"#c47\">Schultz, 2016</a>)</span> and action prediction errors (<a href=\"#c18\">Greenstreet et al., 2022</a>), which are thought to gate plasticity in downstream targets to support learning of stimulus-reward associations and goal directed behavior <span>(<a href=\"#c8\">Cox and Witten, 2019</a><a href=\"#c16\">Flagel et al., 2011</a><a href=\"#c42\">Reynolds et al., 2001</a><a href=\"#c51\">Steinberg et al., 2013</a>)</span>. Indeed, the catecholamines – dopamine and noradrenaline – regulate and gate plasticity in the cortex <span>(<a href=\"#c7\">Choi et al., 2005</a><a href=\"#c19\">He et al., 2015</a><a href=\"#c49\">Seol et al., 2007</a>)</span>. However, the midbrain dopaminergic system projects only sparsely to most of the sensory neocortex of the mouse, including V1 (<a href=\"#c36\">Nomura et al., 2014</a>), where visuomotor predictions are thought to be learned <span>(<a href=\"#c2\">Attinger et al., 2017</a><a href=\"#c56\">Widmer et al., 2022</a>)</span>. Instead, the major catecholaminergic input to the cortex is the locus coeruleus (LC). LC activity has primarily been investigated in the context of classical stimulus presentations and reinforcement tasks. Such studies have shown that the LC responds to many different events, including unexpected task outcomes <span>(<a href=\"#c4\">Bouret and Sara, 2004</a><a href=\"#c5\">Breton-Provencher et al., 2022</a>)</span>, novelty <span>(<a href=\"#c52\">Takeuchi et al., 2016</a><a href=\"#c53\">Vankov et al., 1995</a>)</span>, and unexpected sensory stimuli in general <span>(<a href=\"#c1\">Aston-Jones and Bloom, 1981</a><a href=\"#c10\">Deitcher et al., 2019</a><a href=\"#c17\">Foote et al., 1980</a><a href=\"#c20\">Hervé-Minvielle and Sara, 1995</a>)</span>. In zebrafish, noradrenergic neurons increase their activity during the prolonged visuomotor mismatches of failed swim attempts to drive ‘giving up’ behavior (<a href=\"#c33\">Mu et al., 2019</a>). We hypothesized that if the mouse LC is activated during similar visuomotor mismatches, this could represent visuomotor prediction error signaling that would function to gate prediction error driven plasticity in output circuits like the cortex.</p><p>To test fundamental aspects of this idea, we imaged calcium activity in LC axons in the cortex during visuomotor mismatches, and optogenetically manipulated LC activity levels during visuomotor experience to probe for experience dependent changes in cortical activity. We found that LC axons in both sensory and motor cortical regions respond to unsigned visuomotor prediction errors, i.e., unpredicted visual motion or unpredicted visual halts during locomotion. We then combined optogenetic LC axon stimulation with two-photon calcium imaging of layer 2/3 neurons in V1, to show that the LC greatly facilitates a form of plasticity consistent with predictive visuomotor learning: learned suppression of nasotemporal visual flow responses during forward locomotion. These results support the idea that a key function of the LC is to facilitate prediction error driven cortical plasticity.</p><h1 id=\"s2\" class=\"heading-1\">Results</h1><p>We first assessed whether locus coeruleus (LC) axons convey sensorimotor prediction errors to the cortex. To record LC axonal activity, we expressed axon-targeted, Cre-dependent GCaMP6s in noradrenergic neurons of the LC via stereotactic viral vector injections in 13 NET-Cre mice (NET = norepinephrine transporter) (<a href=\"#c55\">Wagatsuma et al., 2018</a>). We confirmed that these injections labelled only cells in the LC, and that GCaMP6s positive cells were also immunoreactive for tyrosine hydroxylase, a marker for catecholaminergic neurons (<strong><a href=\"#figS1\">Figure S1A</a></strong>). For two-photon imaging, we implanted a 4 mm imaging window either over the right V1 and surrounding cortical regions (posterior cortex, 9 mice), or over the right primary and secondary motor cortices (anterior cortex, 4 mice). Prior to imaging, mice were habituated to a virtual reality (VR) system consisting of a virtual tunnel, with walls patterned with vertical sinusoidal gratings (<strong><a href=\"#fig1\">Figure 1A</a></strong>). In the closed loop condition, locomotion was coupled to visual movement of the tunnel, and in open loop conditions, the walls moved independent of mouse locomotion. After habituation to head-fixation, we began imaging across up to five non-overlapping fields of view (FoV) in each imaging window, yielding a total of 31 posterior cortex FoVs and 9 anterior cortex FoVs. Axonal fluorescence showed strong correlations with pupil diameter (<strong><a href=\"#figS1\">Figure S1B</a></strong>) typical for LC axons (<a href=\"#c41\">Reimer et al., 2016</a>), rapid responses to air puffs (<strong><a href=\"#figS1\">Figure S1C</a></strong>) as previously reported <span>(<a href=\"#c5\">Breton-Provencher et al., 2022</a><a href=\"#c10\">Deitcher et al., 2019</a>)</span>, and increases in fluorescence at locomotion onset that decayed during the locomotion bout (<strong><a href=\"#figS2\">Figure S2</a></strong>) consistent with earlier work (<a href=\"#c41\">Reimer et al., 2016</a>). We found that within a FoV, individual axon segments exhibited highly correlated activity (<strong><a href=\"#fig1\">Figures 1B</a> and <a href=\"#figS1\">S1D-F</a></strong>). Given that the algorithms that identify axons (i.e., determine whether two axon segments belong to the same axon) rely on temporal correlations of activity <span>(<a href=\"#c28\">Leinweber et al., 2017</a><a href=\"#c34\">Mukamel et al., 2009</a>)</span>, axon segmentation is difficult in these data. Thus, to prevent oversampling of the data, we pooled data from all axon segments within a FoV for further analysis.</p><figure class=\"figure\" id=\"fig1\"><label class=\"figure__label\">Figure 1.</label><img src=\"/iiif/2/10.1101%2F2022.11.08.515698%2F515698v2_fig1.tif/full/max/0/default.jpg\" alt=\"sciency picture\"/><figcaption class=\"figure__caption\"><h2 class=\"heading-2\">LC axonal calcium activity reflects unsigned visuomotor prediction errors.</h2><p>(<strong>A</strong>) Left: Schematic of the two-photon microscope and virtual reality system. Right: Schematics of the two virtual reality conditions. Top: closed loop condition in which visual flow speed (green) is yoked to locomotion speed (purple). Mismatches consist of 1 s halts in visual flow during locomotion (orange shading). Bottom: open loop condition in which visual flow from the closed loop session is replayed to the mouse uncoupled from locomotion. Playback halts are 1 s halts in visual flow in the open loop condition (gray shading).</p><p>(<strong>B</strong>) Two-photon calcium imaging of LC axons in the dorsal cortex. Left: NET-Cre mice underwent stereotactic viral vector injections to express axon-targeted GCaMP6s in the LC. 4 weeks later, axons were imaged in two regions of the cortex. Inset shows example two-photon field of view (FoV). Right: Example ΔF/F traces (black) from three different axons segments in the same FoV, recorded during the closed loop condition. Purple and green traces show locomotion and visual flow speed respectively. Orange shading indicates mismatch events. Gray trace shows pupil diameter.</p><p>(<strong>C</strong>) Responses of LC axons to visual flow halt stimuli (left: mismatches, and right: playback halts while the mouse is stationary). Top: Locomotion speed (purple), visual flow speed (green) and absolute error (red; absolute difference between visual flow speed and locomotion speed) each averaged across trials. Middle: Heat map of the average responses of different fields of view (FoVs) sorted according to response magnitude. Bottom: Response averaged across FoVs. Shading indicates SEM.</p><p>(<strong>D</strong>) Average responses per FoV to mismatches and playback halts, while the mouse was either stationary or locomoting. Error bars indicate SEM across FoVs. Here and in other panels, n.s.: not significant, *: p &lt; 0.05, **: p &lt; 0.01, ***: p &lt; 0.001. For complete statistical information see <strong><a href=\"#tblS1\">Table S1</a></strong>.</p><p>(<strong>E</strong>) Mean mismatch response of LC axons averaged across FoVs as a function of locomotion speed. Top: Heat map of the average mismatch response, sorted according to locomotion speed (speeds correspond to below plot). Bottom: Mean and SEM (error bars) of the mismatch responses averaged over FoVs as a function of locomotion speed. Only datapoints with at least 10 FoVs in each speed bin are included.</p><p>(<strong>F</strong>) Responses of LC axons to visual flow onsets in the open loop condition during locomotion (left) or stationary periods (right), plotted as in panel <strong>C</strong>.</p><p>(<strong>G</strong>) Average responses of LC axons to visual flow onsets while the mouse was either locomoting or stationary, plotted as in panel <strong>D</strong>.</p><p>(<strong>H</strong>) Responses of LC axons to the different visual flow stimuli in different conditions averaged across FoVs, color coded according to the legend, and plotted as a function of the change in absolute error between locomotion speed and visual flow speed during the stimulus (relative to 1 s prior to stimulus onset). Error bars indicate SEM.</p></figcaption></figure><h2 id=\"s2a\" class=\"heading-2\">Locus coeruleus cortical axons signal unsigned visuomotor errors</h2><p>To determine whether LC axons respond to visuomotor errors, we first measured their responses to visuomotor mismatch stimuli (unexpected 1 s halts of visual flow during locomotion in the closed loop condition). Indeed, LC axons showed significant increases in fluorescence following mismatch presentations (<strong><a href=\"#fig1\">Figure 1C-D</a></strong>). Assuming these responses reflect visuomotor prediction errors, we would expect to find two things:</p><p>First, the responses should depend on precise coupling between visual flow speed and locomotion speed (i.e., when visual flow is predictable from locomotion). Responses to visuomotor mismatch in closed loop conditions should be higher than responses to a replay of the same visual flow halt (termed ‘playback halt’) in open loop conditions, even when the mouse is locomoting. Playback halts are visually identical to mismatches but occur independent of whether the mouse is stationary or locomoting (<strong><a href=\"#fig1\">Figure 1A</a></strong>). Responses of LC axons to playback halts when the mouse was stationary were negative and substantially different from mismatch responses (<strong><a href=\"#fig1\">Figure 1C-D</a></strong>), demonstrating that the response of LC axons to visuomotor mismatch cannot be explained by the visual stimulus alone. The mismatch responses also could not be explained by a locomotion driven increase in gain of the visual halt response: a) The average playback halt response when the mouse was stationary was negative, b) there was no correlation between playback halt responses and mismatch responses across different FoVs (R<sup>2</sup> = 0.04, p = 0.31, 25 FoVs, linear regression), and c) mismatch responses were significantly larger than playback halt responses that occurred during locomotion in the open loop condition (<strong><a href=\"#fig1\">Figure 1D</a></strong>). This indicated that responses in LC axons were acutely dependent on visuomotor coupling, since the only difference between a mismatch stimulus and a playback halt during locomotion is that the former occurs during visuomotor coupling and the latter does not.</p><p>Second, the mismatch response should scale with the size of the error between visual flow speed and locomotion speed, since the latter is a proxy for the prediction of visual flow speed. Since visual flow speed is zero during mismatch, and visual flow is perfectly coupled to locomotion prior to mismatch, the visuomotor error is proportional to the locomotion speed during mismatch (<strong><a href=\"#fig1\">Figure 1A</a></strong>). Indeed, we found that LC axonal mismatch responses increased monotonically with the locomotion speed of the mouse (<strong><a href=\"#fig1\">Figure 1E</a></strong>). Thus, LC axonal responses to visuomotor mismatch are consistent with a visuomotor prediction error signal.</p><p>Visuomotor mismatches evoke negative prediction errors because they are a condition where there is <em>less</em> visual flow than expected. However, these are not the only type of prediction error in our paradigm. In the open loop condition, visual flow onsets result in positive prediction errors (i.e., a condition with <em>more</em> visual flow than expected), especially when the mouse is stationary. We thus assessed the responses of LC axons to visual flow onsets in the open loop condition (i.e., uncoupled from locomotion). We found that LC axons showed significant responses to visual flow onsets, but only when the mouse was stationary (<strong><a href=\"#fig1\">Figure 1F-G</a></strong>). Visual flow onsets during locomotion did not evoke significant responses on average. Altogether, LC axonal responsiveness to visual and visuomotor stimuli was best explained by the absolute (i.e., unsigned) error between locomotion and visual flow speeds (|Error|=|Speed<sub>locomotion</sub>– Speed<sub>visual flow</sub>|). Changes in the absolute error resulted in corresponding changes in the activity in LC axons (<strong><a href=\"#fig1\">Figures 1C</a> and <a href=\"#fig1\">1F</a></strong>), and responses scaled with the size of Δ|Error| (i.e., the change in unsigned error magnitude, see Methods) across the different stimulus conditions (<strong><a href=\"#fig1\">Figure 1H</a></strong>).</p><h2 id=\"s2b\" class=\"heading-2\">Noradrenaline broadcasts visuomotor prediction errors across the dorsal cortex</h2><p>Individual LC neurons can preferentially target different cortical areas <span>(<a href=\"#c6\">Chandler et al., 2019</a><a href=\"#c24\">Kebschull et al., 2016</a>)</span>, but it is unclear whether these projection-specific neurons have differing response profiles. To assess the heterogeneity of LC signaling across the cortex, we first compared the calcium responses of LC axons between two imaging window locations: the anterior cortex (the primary and secondary motor cortex), and the posterior cortex (V1 and surrounding regions) (<strong><a href=\"#fig2\">Figure 2A</a></strong>). We found very similar responses to visuomotor mismatches, playback halts (stationary) and visual flow onsets (stationary) (<strong><a href=\"#fig2\">Figure 2B</a></strong>), as well as air puffs and locomotion onsets at these two locations (<strong><a href=\"#fig2\">Figure 2C</a></strong>), and there were no significant differences in the responses between the two locations. These results are consistent with the idea that the LC sends the same visuomotor and locomotion related signals to distinct regions of the cortex, in line with recent findings showing that LC axons in different cortical regions show responses to the same sensory stimuli (<a href=\"#c10\">Deitcher et al., 2019</a>).</p><figure class=\"figure\" id=\"fig2\"><label class=\"figure__label\">Figure 2.</label><img src=\"/iiif/2/10.1101%2F2022.11.08.515698%2F515698v2_fig2.tif/full/max/0/default.jpg\" alt=\"sciency picture\"/><figcaption class=\"figure__caption\"><h3 class=\"heading-3\">LC axonal responses are indistinguishable in sensory (posterior) and motor (anterior) cortical areas.</h3><p>(<strong>A</strong>) Schematic of the two different locations of the two-photon imaging windows used. Posterior windows were centered on V1 and included surrounding structures, while anterior windows included the primary and secondary motor cortex.</p><p>(<strong>B</strong>) Responses of LC axons to mismatch, playback halt, and visual flow onset averaged across FoVs, compared between posterior and anterior imaging locations. Error bars indicate SEM. Here and in other panels, n.s.: not significant. For complete statistical information see <strong><a href=\"#tblS1\">Table S1</a></strong>.</p><p>(<strong>C</strong>) As in <strong>B</strong>, but for air puff responses (which were infrequently used to evoke locomotion) and locomotion onset responses in various conditions, each averaged in the 3 s window after onset. Note that locomotion<sub>Visual flow</sub> and locomotion<sub>No visual flow</sub> occur in open loop conditions (see also <strong><a href=\"#figS2\">Figure S2</a></strong>).</p></figcaption></figure><h2 id=\"s2c\" class=\"heading-2\">We find no evidence of an effect of locus coeruleus axon stimulation on average responses in layer 2/3 of V1</h2><p>What could be the function of prediction errors signaled by the LC to the cortex? One possibility is that cortical prediction errors, like mismatch responses in V1 (<a href=\"#c25\">Keller et al., 2012</a>), are enhanced by LC output in order to augment error driven learning. Indeed, a prevalent idea is that noradrenaline is a mediator of gain modulation in the cortex (<a href=\"#c15\">Ferguson and Cardin, 2020</a>), including the gain increase in V1 during locomotion (<a href=\"#c39\">Polack et al., 2013</a>). To test whether the LC may enhance prediction error responses in cortical layer 2/3, we assessed the impact of transient LC axon stimulation on cortical responses using an optogenetic strategy (<strong><a href=\"#fig3\">Figure 3A</a></strong>). First, we injected an AAV vector encoding Cre-dependent excitatory red-light activated opsin, ChrimsonR, into the right LC of 8 NET-Cre mice, while injecting a vector encoding jGCaMP8m into the right V1 to drive non-specific neuronal expression. An imaging window was then implanted over the right V1. Mice underwent habituation to the virtual reality system before calcium imaging of V1 neurons during 1) a closed loop condition with mismatches and 2) an open loop condition with 1 s fixed-speed visual flow stimuli. During imaging, we stimulated ChrimsonR by directing a 637 nm laser through the objective into the imaging window (27 mW/mm<sup>2</sup>, in 15 ms pulses presented at 20 Hz). This stimulation was presented a) alone in closed loop conditions, b) coupled to a random 50% of mismatches (<strong><a href=\"#fig3\">Figure 3B</a></strong>), and c) coupled to a random 50% of open loop visual flow stimuli. To assess the visual effects of optical stimulation of ChrimsonR (<a href=\"#c9\">Danskin et al., 2015</a>) in absence of the effects of optogenetically stimulating LC axons, we also imaged from a second group of 6 mice treated in an identical manner, but without ChrimsonR expression in the LC (control mice). Two mice were excluded from the LC-injected group due to low density of axonal labelling with tdTomato in V1, leaving 6 ChrimsonR-expressing mice in the dataset (see Methods).</p><figure class=\"figure\" id=\"fig3\"><label class=\"figure__label\">Figure 3.</label><img src=\"/iiif/2/10.1101%2F2022.11.08.515698%2F515698v2_fig3.tif/full/max/0/default.jpg\" alt=\"sciency picture\"/><figcaption class=\"figure__caption\"><h3 class=\"heading-3\">LC axon stimulation has no measurable effect on stimulus responses in layer 2/3 of V1.</h3><p>(<strong>A</strong>) AAV vector injections were used to express ChrimsonR-tdTomato in LC NET-positive neurons, and jGCaMP8m in layer 2/3 neurons of V1. Simultaneous two-photon calcium imaging and optogenetic stimulation with a 637 nm laser would take place in layer 2/3. Injections into the LC were omitted in control mice. Example histology images indicate expression of jGCaMP8m (green) and tdTomato (magenta); note that blood vessels and pia mater (see arrows labelled ‘BV’ and ‘pia’ respectively) are also visible in the magenta channel. Arrow labelled ‘Ax’ indicates an axon.</p><p>(<strong>B</strong>) Example ΔF/F traces for three somatic ROIs in layer 2/3 of V1 (black) and the corresponding visual flow speed (green) and locomotion speed (purple) traces. Orange shading indicates visuomotor mismatch events. Red marks indicate concurrent laser stimulation to activate ChrimsonR on a random subset of mismatch trials.</p><p>(<strong>C</strong>) Average pupil diameter response to stimulation with the optogenetic laser presented in isolation for ChrimsonR-expressing mice (pink), and control mice (gray). Shading represents SEM.</p><p>(<strong>D</strong>) Left: Average population ΔF/F response of layer 2/3 neurons in V1 to the onset of the optogenetic stimulation laser presented in isolation. Right: Boxplots to compare average response (quantified in the window 0.3 to 1.6 s after optogenetic stimulation onset) for the two groups of mice. Here and in other panels, n.s.: not significant. For complete statistical information see <strong><a href=\"#tblS1\">Table S1</a></strong>.</p><p>(<strong>E</strong>) Analysis of mismatch responses of all layer 2/3 neurons. Left: Average population ΔF/F response of layer 2/3 neurons in V1 of ChrimsonR-expressing mice to visuomotor mismatch either with (red) or without (black) concurrent optogenetic laser stimulation. Right: Boxplots to compare the difference in average mismatch response between trials with and without optogenetic laser stimulation. Pink points indicate data for each neuron from ChrimsonR-expressing mice, and gray points indicate data from control mice. Note, statistical tests against zero for the effect in ChrimsonR-expressing mice were also insignificant (see <strong><a href=\"#tblS1\">Table S1</a></strong>).</p><p>(<strong>F</strong>) As for <strong>E</strong>, but for responses to 1 s fixed speed visual flow stimuli in open loop conditions.</p><p>(<strong>G</strong>) As for boxplots in panel <strong>E</strong>, but for mismatch responses of three different functionally defined neuronal groups: NPE = negative prediction error neurons, with large responses to mismatches, PPE = positive prediction error neurons, with large responses to visual flow, and an intermediate group ‘other’. See Methods and <strong><a href=\"#figS3\">Figure S3</a></strong> for information on neuronal types. Note, statistical tests against zero for the effect in ChrimsonR-expressing mice were also insignificant (see <strong><a href=\"#tblS1\">Table S1</a></strong>).</p><p>(<strong>H</strong>) As for <strong>G</strong>, but for responses to 1 s fixed speed visual flow stimuli in open loop conditions.</p><p>(<strong>H</strong>) Left: Population average responses to visual flow stimuli during stationary periods (black) and during locomotion (purple), for control mice (bottom), and ChrimsonR-expressing mice (top). Shading represents SEM. Note that only trials <em>without</em> concurrent optogenetic stimulation are included here. Right: Histograms and boxplots to show distribution of locomotion modulation index for the visual responses recorded in control (gray) and ChrimsonR-expressing mice (pink). Here, **: p &lt; 0.01 (see <strong><a href=\"#tblS1\">Table S1</a></strong>).</p></figcaption></figure><p>Optogenetic stimulation, when presented in isolation, resulted in dilations of the right pupil in mice expressing ChrimsonR (<strong><a href=\"#fig3\">Figure 3C</a></strong>), but not in control mice. This potentially resulted from antidromic activation of the LC, direct stimulation of which is known to produce strong ipsilateral pupil dilation (<a href=\"#c29\">Liu et al., 2017</a>), and increased our confidence that we were indeed driving LC axons with the parameters selected. Onset of the optogenetic stimulation laser caused a small calcium response across the population in ChrimsonR-expressing mice, which was indistinguishable from that caused in control mice (<strong><a href=\"#fig3\">Figure 3D</a></strong>). This was likely due to a visual effect of the stimulation laser. The lack of a difference in this stimulation response between ChrimsonR-expressing mice and control mice indicated that optogenetic stimulation of LC axons did not have a direct measurable effect on calcium activity of L2/3 neurons in V1.</p><p>We then analyzed the effect of optogenetic activation of LC axons on stimulus responses of the layer 2/3 population. Stimulation of ChrimsonR in LC axons had no significant effect on average visuomotor mismatch responses of layer 2/3 neurons, and the difference in response size compared between trials with and without laser stimulation was indistinguishable from that seen in control mice (<strong><a href=\"#fig3\">Figure 3E</a></strong>). The same was true for visual flow responses (<strong><a href=\"#fig3\">Figure 3F</a></strong>). The only observable difference in responses during optogenetic stimulation was that responses to visual flow onsets (i.e., at the beginning of the visual flow stimulus, or at the offset of mismatch) appeared slightly more pronounced (<strong><a href=\"#fig3\">Figure 3E-F</a></strong>).</p><p>In V1, there is electrophysiological and molecular evidence for at least three different layer 2/3 pyramidal neuron types, including negative prediction error (NPE) neurons which respond to visuomotor mismatches, positive prediction error neurons (PPE) which respond to unexpected visual flow <span>(<a href=\"#c21\">Jordan and Keller, 2020</a><a href=\"#c37\">O’Toole et al., 2022</a>)</span>, and an intermediate group. It is therefore conceivable that LC output could have differential effects on these groups that are masked when analyzed at the population level. To quantify potential cell-type specific effects of LC axon stimulation, we thus split the population of neurons into three groups based on locomotion onset responses (see <strong><a href=\"#figS3\">Figure S3</a></strong> and Methods): the group with the strongest visuomotor mismatch responses (NPE), the group with the strongest visual flow responses (PPE), and an intermediate population (Other) (<strong><a href=\"#figS3\">Figure S3</a></strong>). We found no evidence for an effect of optogenetic stimulation of LC axons on average mismatch and visual flow responses across any of these cell groups (<strong><a href=\"#fig3\">Figure 3G-H</a></strong>). We thus concluded that transient LC axon stimulation in the awake state has only a minor direct effect on the responses of neurons in layer 2/3 of V1.</p><h2 id=\"s2d\" class=\"heading-2\">Phasic LC output enhances sensorimotor plasticity in layer 2/3 of V1</h2><p>If transient LC activity in the awake state does not overtly affect average layer 2/3 responses directly, what is the function of visuomotor prediction errors signaled by the LC in the cortex? The LC is thought to be involved in cortical plasticity <span>(<a href=\"#c23\">Kasamatsu et al., 1985</a><a href=\"#c22\">Kasamatsu and Pettigrew, 1976</a><a href=\"#c30\">Martins and Froemke, 2015</a><a href=\"#c50\">Shepard et al., 2015</a>)</span>. Catecholamine receptors in V1 are known to modulate synaptic plasticity by activating intracellular signaling cascades and interacting with eligibility traces <span>(<a href=\"#c7\">Choi et al., 2005</a><a href=\"#c19\">He et al., 2015</a><a href=\"#c36\">Nomura et al., 2014</a><a href=\"#c49\">Seol et al., 2007</a>)</span>. One plausible function of LC sensorimotor prediction errors is to gate the plasticity that underlies learning of sensorimotor predictions, e.g., the prediction of visual feedback during locomotion. Primary sensory cortices can indeed learn to suppress the sensory consequences of locomotion, driving selective reductions of responses to locomotion-coupled inputs <span>(<a href=\"#c46\">Schneider et al., 2018</a><a href=\"#c56\">Widmer et al., 2022</a>)</span>.</p><p>While our optogenetic stimulation of LC axons had no measurable effects on mismatch or visual flow response size (<strong><a href=\"#fig3\">Figure 3</a></strong>), we did notice one striking difference between ChrimsonR-expressing and control mice. In V1, there is a known increase in the size of visual responses during locomotion compared to stationary periods <span>(<a href=\"#c3\">Bennett et al., 2013</a><a href=\"#c14\">Erisken et al., 2014</a><a href=\"#c35\">Niell and Stryker, 2010</a><a href=\"#c38\">Pakan et al., 2016</a><a href=\"#c39\">Polack et al., 2013</a><a href=\"#c58\">Zmarz and Keller, 2016</a>)</span>. Analyzing only trials where the optogenetic stimulation laser was not on, we found that this canonical gain increase was present for control mice but reversed in sign in ChrimsonR-expressing mice: Visual responses during locomotion were suppressed on average relative to stationary periods (<strong><a href=\"#fig3\">Figure 3I</a></strong>). This resulted in a significantly lower locomotion modulation index (see Methods) for ChrimsonR-expressing relative to control mice (<strong><a href=\"#fig3\">Figure 3I</a></strong>). Since episodic LC axon stimulation occurred throughout the whole imaging session (i.e., across 10 minutes in the closed loop condition, prior to the presentation of open loop visual flow stimuli), it is possible that the reversal of locomotion modulation index reflects a result of plasticity induced by earlier LC axon stimulation.</p><p>We wanted to directly test the idea that transient LC activation enhances plasticity that leads to a reduction in locomotion modulation index over the course of visuomotor coupling experience. To do this, we designed an experiment to assess the impact of LC axon stimulation on neuronal learning about visuomotor coupling (<strong><a href=\"#fig4\">Figure 4A</a></strong>). We expressed jGCaMP8m in neurons in V1 of 19 mice. 12 mice also had AAV vector injections into the LC to express ChrimsonR in NET-positive neurons, while the remaining 7 underwent no injection into the LC to serve as controls for the non-optogenetic effects of the protocol. Mice were habituated to the VR as before and we then proceeded to two-photon imaging in layer 2/3 of V1. During the imaging session, mice would first be exposed to 5 minutes of 1 s fixed-speed open loop visual flow presentations, to quantify the gain-change of visual flow responses during locomotion (<strong><a href=\"#fig4\">Figure 4A</a></strong>). Mice were then exposed for 5-10 minutes to either a) a closed loop condition where visual flow and locomotion are coupled, or b) an open loop replay of visual flow generated from a previous closed loop session. During this session, LC axons would be periodically optogenetically stimulated as before (15 ms pulses, presented at 20 Hz for 1 s every 7 seconds on average) to simulate phasic LC prediction error responses (<strong><a href=\"#fig4\">Figure 4A</a></strong>). Afterwards, the open loop visual flow presentations would be repeated to quantify how the previous LC axon stimulation affected visual responses. To assess the stimulus specificity with which visual responses changed, we presented both nasotemporal and temporonasal visual flow (mice see the former during forward locomotion in the closed loop condition) (<strong><a href=\"#fig4\">Figure 4A</a></strong>). If LC axon stimulation results in enhanced plasticity of locomotion based predictions of visual flow, we would expect the following observations: 1) Suppression of visual flow responses by locomotion is enhanced after stimulation of LC axons in closed loop conditions, 2) this suppression is specific to the type of visual flow seen during forward locomotion (nasotemporal), 3) the effect depends on ChrimsonR expression in the LC, and 4) the effect is absent when LC axons are instead stimulated during open loop conditions (i.e., the effect depends on visuomotor coupling).</p><figure class=\"figure\" id=\"fig4\"><label class=\"figure__label\">Figure 4.</label><img src=\"/iiif/2/10.1101%2F2022.11.08.515698%2F515698v2_fig4.tif/full/max/0/default.jpg\" alt=\"sciency picture\"/><figcaption class=\"figure__caption\"><h3 class=\"heading-3\">Phasic LC output enhances sensorimotor plasticity in layer 2/3 of V1.</h3><p>(<strong>A</strong>) Diagram of the experiment used to determine whether LC axon stimulation during different visuomotor coupling conditions can modulate plasticity. Visual responses are compared before and after 5-10 minutes of either closed or open loop conditions, during which LC axons were stimulated every 7 s on average.</p><p>(<strong>B</strong>) Left: Scatter plot to show the relationship between density of ChrimsonR-tdTomato labelled axons in V1 (total axon length per unit area of the cortex, analyzed postmortem) and the average evoked pupil dilation during optogenetic stimulation. Green dashed line is a linear regression fit to the data, and red dotted line indicates axon density threshold used to categorize low (blue) and high (pink) ChrimsonR-expressing mice. Right: Average pupil diameter response to stimulation with the optogenetic laser for 6 mice with high ChrimsonR expression in LC axons (pink), 6 mice with low ChrimsonR expression (blue), and 7 control mice that did not receive a vector injection into the LC (black). Shading represents SEM over sessions.</p><p>(<strong>C</strong>) Analysis of plasticity in nasotemporal visual flow responses in ChrimsonR-expressing mice undergoing optogenetic laser stimulation during closed loop visuomotor experience. Histograms and boxplots show distribution of locomotion modulation indices for the visual responses of layer 2/3 V1 neurons recorded before (dark gray) and after the stimulation period (red). Here and in all other panels: n.s.: not significant, *: p &lt; 0.05, **: p &lt; 0.01, ***: p &lt; 0.001. See <strong><a href=\"#tblS1\">Table S1</a></strong> for all statistical information.</p><p>(<strong>D</strong>) As for panel <strong>C</strong>, but for temporonasal visual flow responses.</p><p>(<strong>E</strong>) As for panel <strong>C</strong>, but for low ChrimsonR-expressing mice.</p><p>(<strong>F</strong>) As for panel <strong>C</strong>, but for the condition in which optogenetic stimulation occurred during open loop replays of visual flow (i.e., no visuomotor coupling).</p><p>(<strong>G</strong>) Analysis of plasticity in nasotemporal visual flow responses in high ChrimsonR-expressing mice undergoing optogenetic laser stimulation during the closed loop condition. Left: Boxplots of the change in response to visual flow after optogenetic stimulation for responses recorded during locomotion (purple) and those recorded during stationary periods (black). Right: Average population response to visual flow during locomotion (purple) and during stationary periods (black), before (top) and after (bottom) optogenetic stimulation. Shading indicates SEM.</p><p>(<strong>H</strong>) As for panel <strong>G</strong>, but for temporonasal visual flow responses.</p><p>(<strong>I</strong>) As for panel <strong>G</strong>, but for low ChrimsonR-expressing mice.</p><p>(<strong>J</strong>) Change in locomotion modulation index after optogenetic stimulation, for the four sets of experiments from panels <strong>C</strong>(nasotemporal), <strong>D</strong>(temporonasal), <strong><a href=\"#figS4\">Figure S4C</a></strong>(Control), <strong>E</strong>(low ChrimsonR expression), and <strong>F</strong>(open loop) (presented in the respective sequence).</p></figcaption></figure><p>Optogenetic stimulation caused a degree of pupil dilation that was strongly predictable from axonal ChrimsonR expression levels in V1 quantified postmortem (R<sup>2</sup> = 0.89, p &lt; 10<sup>−5</sup>, 12 mice, linear regression) (<strong><a href=\"#fig4\">Figure 4B</a></strong>). We split the LC-injected dataset into high ChrimsonR expression (six mice) and low ChrimsonR expression (six mice) according to V1 axonal expression level (<strong><a href=\"#fig4\">Figures 4B</a> and <a href=\"#figS4\">S4A</a></strong>). Low ChrimsonR-expressing mice had optogenetically evoked pupil dilations that were not statistically distinguishable from controls, while high ChrimsonR-expressing mice had overt pupil dilations (<strong><a href=\"#fig4\">Figures 4B</a> and <a href=\"#figS4\">S4B</a></strong>). For the following analyses, we excluded 8 (5) of 49 (25) sessions from the ChrimsonR (control) dataset due to lack of locomotion during those sessions (see Methods). At the beginning of the imaging session, prior to optogenetic stimulation, neurons in layer 2/3 showed a pronounced positive locomotion modulation index for both the nasotemporal and temporonasal visual flow responses, both in high and low ChrimsonR-expressing mice and in control mice (<strong><a href=\"#fig4\">Figures 4C-E</a> and <a href=\"#figS4\">S4D</a></strong>). Quantifying visual flow responses in high ChrimsonR-expressing mice after optogenetic stimulation during closed loop visuomotor experience revealed a reduction in the locomotion modulation index for nasotemporal visual flow responses (<strong><a href=\"#fig4\">Figure 4C</a></strong>). This originated from a reduction in the response to visual flow during locomotion, while responses during stationary periods remained stable (<strong><a href=\"#fig4\">Figure 4G</a></strong>). This effect was specific to the direction of visual flow seen during forward locomotion, since locomotion modulation index was preserved for temporonasal visual flow responses (<strong><a href=\"#fig4\">Figure 4D</a></strong>), with negligible changes in response size both during locomotion and stationary periods (<strong><a href=\"#fig4\">Figure 4H</a></strong>). The effect was also specific to high ChrimsonR-expressing mice, as locomotion modulation index was largely preserved in both control and low ChrimsonR-expressing mice (<strong><a href=\"#fig4\">Figures 4E, 4I</a>, and <a href=\"#figS4\">S4D</a></strong>).</p><p>The selective reduction in locomotion modulation index of nasotemporal visual flow responses in high ChrimsonR-expressing mice could be due to enhanced learning to suppress reafferent visual feedback seen during forward locomotion, or it could simply be due to general exposure to nasotemporal visual flow during optogenetic stimulation (e.g., enhanced adaptation). In the latter case, response size reduction should be the same if optogenetic stimulation takes place during open loop replay of the same visual flow seen during closed loop conditions. To assess this, we repeated the same experiment, but instead of stimulating LC axons during the closed loop condition, we stimulated LC axons during open loop replays of visual flow from previous closed loop sessions of the same mice (<strong><a href=\"#fig4\">Figure 4A</a></strong>). Instead of a stimulus selective reduction in locomotion gain, this paradigm drove a nonsignificant increase in locomotion modulation index for both nasotemporal (<strong><a href=\"#fig4\">Figures 4F</a> and <a href=\"#figS4\">S4F</a></strong>) and temporonasal visual flow (<strong><a href=\"#figS4\">Figure S4E</a></strong>) responses. This confirmed that the reduction in locomotion modulation index after stimulation of LC axons in the closed loop condition (<strong><a href=\"#fig4\">Figure 4C</a></strong>) depends on visuomotor coupling experience and is not simply due to exposure to nasotemporal visual flow.</p><p>We conclude that LC axon stimulation over the course of minutes increases locomotion driven suppression of visual flow responses in layer 2/3 in a manner that is specific to reafferent stimulus properties and dependent on both ChrimsonR expression and visuomotor coupling (<strong><a href=\"#fig4\">Figure 4J</a></strong>). Importantly, the effect could not be explained by differences in locomotion behavior between any of the groups analyzed (<strong><a href=\"#figS5\">Figure S5</a></strong>).</p><h2 id=\"s2e\" class=\"heading-2\">LC axon stimulation over minutes recapitulates visuomotor plasticity seen over days</h2><p>In the virtual reality environment, mouse movement and visual flow are constrained to the forward-backward dimension, and the visuomotor gain is constant: changes in visuomotor gain that would usually occur during changes in environment geometry are absent. Mice head-fixed in the VR therefore experience a vastly reduced diversity of visuomotor coupling compared to freely moving conditions. The reduction in locomotion modulation index resulting from LC axon stimulation (<strong><a href=\"#fig4\">Figure 4C</a></strong>) may therefore result from overlearning of this simplified visuomotor coupling.</p><p>If this interpretation is correct, then extensive training within the VR should also lead to visual flow response suppression during locomotion even in mice without artificial LC axon stimulation. To assess this idea, we reanalyzed two-photon calcium imaging data from V1 layer 2/3 in coupled trained mice reared with visual experience entirely constrained to that of the visuomotor coupling in the VR across days (and otherwise dark reared) <span>(<a href=\"#c2\">Attinger et al., 2017</a><a href=\"#c56\">Widmer et al., 2022</a>)</span> (<strong><a href=\"#fig5\">Figure 5A</a></strong>). We compared this data to similar data from normally reared mice that also have experience of the virtual reality system, but that had experience of normal visuomotor coupling in freely moving conditions <span>(<a href=\"#c54\">Vasilevskaya et al., 2022</a><a href=\"#c58\">Zmarz and Keller, 2016</a>)</span> (<strong><a href=\"#fig5\">Figure 5A</a></strong>). Analyzing responses to nasotemporal visual flow onsets during open loop replay, we found that visual flow responses were amplified during locomotion relative to stationary periods in normally reared mice but were suppressed during locomotion in coupled trained mice (<strong><a href=\"#fig5\">Figure 5B</a></strong>). This resulted in a significantly lower locomotion modulation index in coupled trained mice compared to normally reared mice (<strong><a href=\"#fig5\">Figure 5C</a></strong>). The effect was not due to dark rearing, as non-coupled trained mice (also dark reared, but with only open loop virtual reality experience (<strong><a href=\"#fig5\">Figure 5A</a></strong>) (<a href=\"#c2\">Attinger et al., 2017</a>)) showed a positive locomotion modulation index on average that did not significantly differ from that of normally reared mice (<strong><a href=\"#fig5\">Figure 5C</a></strong>).</p><figure class=\"figure\" id=\"fig5\"><label class=\"figure__label\">Figure 5.</label><img src=\"/iiif/2/10.1101%2F2022.11.08.515698%2F515698v2_fig5.tif/full/max/0/default.jpg\" alt=\"sciency picture\"/><figcaption class=\"figure__caption\"><h3 class=\"heading-3\">LC axon stimulation over minutes recapitulates the visuomotor plasticity seen over days.</h3><p>(<strong>A</strong>) Diagram of the three groups of mice reared with different visuomotor experience. Normally reared mice (NR, gray) were raised with a normal light/dark cycle in their cages, with the full diversity of visuomotor coupling in freely moving conditions. Coupled trained mice (CT, blue) were reared in the dark, and their only visuomotor experience prior to imaging was during closed loop conditions in the virtual reality system. Non-coupled trained mice (NT, orange) were reared similar to coupled trained mice, except their only visual experience was during open loop conditions in the virtual reality system.</p><p>(<strong>B</strong>) Average population responses of layer 2/3 neurons in V1 to the onset of visual flow during open loop replay sessions. Green shows the average speed profile of the visual flow stimulus, purple shows the average population responses during locomotion, and black shows the average population responses during stationary periods for normally reared (top) and coupled trained (bottom) mice. Shading indicates SEM.</p><p>(<strong>C</strong>) Distribution of the locomotion modulation indices of all V1 layer 2/3 neurons for the visual flow onset responses recorded in normally reared (gray), coupled trained (blue), and non-coupled trained (orange) mice. Here and in other panels, n.s.: not significant, *: p &lt; 0.05, **: p &lt; 0.01, ***: p &lt; 0.001. For complete statistical information see <strong><a href=\"#tblS1\">Table S1</a></strong>.</p><p>(<strong>D</strong>) Average population responses of layer 2/3 neurons in V1 in coupled trained mice to the onset of visual flow during stationary periods (black), and during slow (top) and fast (bottom) locomotion (purple). Shading indicates SEM.</p><p>(<strong>E</strong>) Comparison of locomotion modulation indices averaged across neurons for visual flow onset responses recorded during slow, medium, and fast locomotion speeds, in normally reared (left) and coupled trained (right) mice. Error bars indicate SEM. Green dashed line indicates linear regression fit to the data, and shading indicates the 95% confidence interval of the regression. Green asterisks and ‘n.s.’ indicate significance of the fit.</p><p>(<strong>F</strong>) As for panel <strong>D</strong>, but for nasotemporal visual flow responses in high ChrimsonR-expressing mice after LC axon stimulation in closed loop conditions.</p><p>(<strong>G</strong>) As for panel <strong>E</strong>, but for nasotemporal visual flow responses in high ChrimsonR-expressing mice before (left) and after (right) LC axon stimulation in closed loop visuomotor coupling.</p></figcaption></figure><p>Qualitatively, the comparison of locomotion modulation index between normally reared and coupled trained mice (<strong><a href=\"#fig5\">Figure 5B-C</a></strong>) was similar to the change in locomotion modulation index in ChrimsonR-expressing mice for nasotemporal visual flow after LC axon stimulation (<strong><a href=\"#fig4\">Figure 4C</a></strong>). This suggests that the increase in locomotion driven suppression after LC axon stimulation is caused by a similar form of plasticity to that seen when visuomotor experience is constrained to the virtual reality across days. If this is the case, we should see similarities in the properties of the locomotion driven suppression. First, we looked at the locomotion speed dependence of the suppression. If the negative locomotion modulation index results from learning to suppress visual responses according to a locomotion driven prediction of visual flow, the degree of suppression should depend on locomotion speed. As locomotion speed increased, visual flow responses were increasingly suppressed in coupled trained mice (<strong><a href=\"#fig5\">Figure 5D</a></strong>), while this was not evident in normally reared mice (<strong><a href=\"#fig5\">Figure 5E</a></strong>). For nasotemporal visual flow responses in ChrimsonR-expressing mice, locomotion modulation index was positive and did not change with locomotion speed at the start of the imaging session, but after stimulation of LC axons in closed loop conditions, locomotion modulation index became increasingly negative as locomotion speed increased (<strong><a href=\"#fig5\">Figure 5F-G</a></strong>). Thus, the locomotion driven suppression of visual flow emerging after stimulating LC axons in closed loop conditions was locomotion speed dependent in a similar manner to the locomotion driven suppression seen in coupled trained mice. Note that in high ChrimsonR-expressing mice, suppression of visual flow was seen at high locomotion speeds only (<strong><a href=\"#fig5\">Figure 5G</a></strong>), but in coupled trained mice, some level of suppression was evident across all speeds (<strong><a href=\"#fig5\">Figure 5E</a></strong>). This could be due to differences in visual flow speed: for coupled trained mice, the stimuli analyzed are visual flow onsets during open loop replay; thus, the visual flow speed will cover a similar range as the locomotion speed distribution of the mice. For high ChrimsonR-expressing mice, the stimuli are presented at a fixed visual flow speed that often exceeds the locomotion speed of the mouse. Thus, the fact that suppression only appears at the highest locomotion speed in these mice is consistent with a suppression of visual flow input based on a locomotion speed dependent expectation. In addition to the similarities in locomotion speed dependence of suppression in the two groups, the pattern of change in locomotion modulation index across different functional layer 2/3 cell groups also appeared similar between high ChrimsonR-expressing and coupled trained mice (<strong><a href=\"#figS6\">Figure S6</a></strong>).</p><p>Overall, the pattern of differences in locomotion modulation was remarkably similar for ChrimsonR-expressing (<strong><a href=\"#fig5\">Figures 5G</a>, and <a href=\"#figS6\">S6D</a></strong>) and coupled trained mice (<strong><a href=\"#fig5\">Figures 5E</a> and <a href=\"#figS6\">S6B</a></strong>). This indicates that the functional consequence of plasticity evoked by minutes of LC axon stimulation during visuomotor coupling is similar to that seen after experience is developmentally constrained to visuomotor coupling for days.</p><h1 id=\"s3\" class=\"heading-1\">Discussion</h1><p>The locus coeruleus (LC) has long been hypothesized by computational models to report quantities such as unexpected uncertainty (<a href=\"#c57\">Yu and Dayan, 2005</a>) or high level state-action prediction errors (<a href=\"#c44\">Sales et al., 2019</a>). What these quantities have in common is that they essentially are metrics for the inaccuracy of the brain’s internal models. One way to implement such a measure would be to integrate prediction errors from across the brain and then broadcast this signal back across the brain. Indeed, we found that the LC sends unsigned visuomotor prediction errors non-specifically across the dorsal cortex (<strong><a href=\"#fig1\">Figures 1</a> and <a href=\"#fig2\">2</a></strong>). Models hypothesizing that the LC reports the global inaccuracy of the brain’s internal models suggest that the purpose of this is to increase learning rates in output circuits like the cortex, enabling internal models to be modified more rapidly. In line with this, we found that stimulating cortical LC axons during closed loop visuomotor coupling over minutes reduces and even reverses the canonical locomotion related gain of visual flow responses in layer 2/3 of V1, in a manner specific to the direction of the movement-coupled stimulus (<strong><a href=\"#fig4\">Figure 4</a></strong>). Surprisingly, this enhanced plasticity seems to happen even with no overt direct effect of LC axon stimulation on average calcium responses (<strong><a href=\"#fig3\">Figure 3</a></strong>). This plasticity, on the timescale of minutes, recapitulates the effect of restricting visuomotor experience to the closed loop coupling in virtual reality across days (<strong><a href=\"#fig5\">Figure 5</a></strong>), suggesting that it reflects an acceleration of a slower form of visuomotor plasticity (i.e., an increased learning rate).</p><p>The LC responds to unexpected stimuli of various modality, including reward prediction errors, and novel or intense unexpected sensory stimuli <span>(<a href=\"#c1\">Aston-Jones and Bloom, 1981</a><a href=\"#c4\">Bouret and Sara, 2004</a><a href=\"#c5\">Breton-Provencher et al., 2022</a><a href=\"#c10\">Deitcher et al., 2019</a><a href=\"#c17\">Foote et al., 1980</a><a href=\"#c20\">Hervé-Minvielle and Sara, 1995</a><a href=\"#c52\">Takeuchi et al., 2016</a><a href=\"#c53\">Vankov et al., 1995</a>)</span>. The responses we found in LC axons to the various visual flow stimuli were proportional to the change in the degree of error between visual flow and locomotion speeds (<strong><a href=\"#fig1\">Figure 1</a></strong>). This supports a model in which the LC signals prediction errors, and combined with previous findings, suggests that prediction errors of all modalities are a general feature of LC signaling. Based on the multimodality and unsigned nature of LC responses, and the integrate and broadcast nature of its input-output anatomy (<a href=\"#c48\">Schwarz et al., 2015</a>), our working model of LC function is as follows: The LC integrates prediction errors of all modalities to compute a measure of how inaccurately internal models are currently predicting the global sensory inputs of the animal. The LC does not signal what <em>type</em> of prediction error occurred, but what the global rate of prediction errors currently is (i.e., a measure of surprise). The resulting LC output does not directly <em>drive</em> model updating in cortical output areas, but it modulates the rate at which local cortical prediction errors drive plasticity in internal models. Thus, the specificity of how internal models are changed depends on ongoing prediction errors in the cortex, and the LC input acts to control the learning rate, modulating the extent to which these cortical prediction errors drive plasticity. This would allow the LC to be a controller of plasticity in internal models: when prediction error rates are high (i.e., during developmental, novel, or volatile situations), updating of internal models will be more rapid as a result of increased LC output.</p><p>While the idea of a brain wide average over sensory prediction errors can explain many of the observed LC responses, other responses are less easily explained by prediction error. LC calcium responses to locomotion onsets, which have been shown previously in LC axons <span>(<a href=\"#c10\">Deitcher et al., 2019</a><a href=\"#c41\">Reimer et al., 2016</a>)</span>, were generally larger than visual flow or visuomotor mismatch responses (<strong><a href=\"#fig2\">Figures 2</a> and <a href=\"#figS2\">S2</a></strong>). This could be the result of a direct movement related input unrelated to prediction errors, or the result of prediction errors that are not driven by differences between forward locomotion and backward visual flow. Increases in activity occurring after locomotion onset could reflect vestibulomotor prediction errors that result from the fact that the mouse is head-fixed, or visuomotor prediction errors for motor attempts we do not record, like turns or head movements. We do find that visuomotor prediction errors contribute to locomotion onset responses, as locomotion onset responses in the open loop condition are smaller during visual flow, when locomotion evoked visuomotor error is lower (<strong><a href=\"#figS2\">Figure S2B</a></strong>). However, LC calcium activity also rises prior to locomotion onset, creating the additional possibility of an internally generated movement onset response. Other kinds of movement are also correlated with LC firing, including pup retrievals (<a href=\"#c12\">Dvorkin and Shea, 2022</a>) and lever pressing (<a href=\"#c5\">Breton-Provencher et al., 2022</a>). These movement onset responses could also reflect other forms of prediction error, including action prediction errors (<a href=\"#c18\">Greenstreet et al., 2022</a>) or temporal difference reward prediction errors (in cases where the movement is associated with reward expectation) similar to those documented in the dopaminergic system (<a href=\"#c27\">Kim et al., 2020</a>). Future work will need to investigate these possibilities to build a complete general model of LC computation.</p><p>Depleting noradrenaline has been shown to prevent forms of sensory-guided developmental plasticity in the cortex, including ocular dominance plasticity in V1 (<a href=\"#c22\">Kasamatsu and Pettigrew, 1976</a>) and changes in the tonotopic map in the auditory cortex (<a href=\"#c50\">Shepard et al., 2015</a>). Loss of function experiments can suffer from the potential confound that catecholamines may simply be necessary for normal neuronal activity, and the loss of plasticity may be a secondary effect of a disruption in neuronal function. Indeed, acute noradrenergic receptor block can silence neurons in layer 2/3, and massively reduce the amplitude of visual inputs (<a href=\"#c39\">Polack et al., 2013</a>). In gain of function experiments, electrical stimulation of the LC has been shown to partially restore ocular dominance plasticity in adult cats (<a href=\"#c23\">Kasamatsu et al., 1985</a>). Here we also performed a gain of function experiment: we show that a few minutes of optogenetic LC axon stimulation in V1 of adult mice during visuomotor coupling can recapitulate the developmental effects of constrained exposure to visuomotor coupling in the virtual reality (<strong><a href=\"#fig4\">Figure 4</a> and <a href=\"#fig5\">5</a></strong>). While our optogenetic stimulation is likely far more constrained to LC neurons than previous electrical stimulations, we cannot rule out a systemic effect of the LC axon stimulation. We know that we are likely antidromically activating the LC with our optogenetic stimulation owing to the resulting pupil dilation (<strong><a href=\"#fig3\">Figures 3C</a> and <a href=\"#fig4\">4B</a></strong>). Given that LC neurons are electrically coupled (<a href=\"#c31\">McKinney et al., 2022</a>) and have widely divergent axons, our stimulation likely has effects on other LC output targets, such as other neuromodulatory systems, and other areas of the cortex. Thus, the plasticity effect that we measure may not entirely result from LC output in V1 alone. However, since the LC will never be acting in isolation and broadcasts its output to different cortical areas, the functional impact of LC axon stimulation in this experiment is strongly suggestive of a role in facilitating plasticity. Future work will be needed to understand the circuit locus of plasticity generated by this paradigm, and its dependence on particular neuromodulators (e.g., dopamine and noradrenaline).</p><p>Prediction error driven catecholamine release is thought to gate cortical synaptic plasticity during reinforcement learning <span>(<a href=\"#c19\">He et al., 2015</a><a href=\"#c43\">Roelfsema and Holtmaat, 2018</a>)</span>. The results presented here expand this idea from reward associations to sensorimotor associations. We propose that a general function of catecholamines is to gate the plasticity underlying predictive learning across all modalities.</p><h1 class=\"heading-1\">Acknowledgements</h1><p>We thank all members of the Keller lab for discussion and support, Tingjia Lu for the production of viral vectors, Susumu Tonegawa for sharing NET-Cre mice, and Andreas Lüthi for reagents and equipment. This project has received funding from Human Frontier Science Program (LT000077/2019-L, long term fellowship to RJ), the Swiss National Science Foundation, the Novartis Research Foundation, and the European Research Council (ERC) under the European Union’s Horizon 2020 research and innovation programme (grant agreement no. 865617).</p><h1 id=\"\" class=\"heading-1\">Author contributions</h1><p>RJ designed and performed the experiments and analyzed the data. Both authors wrote the manuscript.</p><h1 id=\"\" class=\"heading-1\">Data and code availability</h1><p>All data and analysis code are available at <a href=\"https://data.fmi.ch/PublicationSupplementRepo/\">https://data.fmi.ch/PublicationSupplementRepo/</a>.</p><h1 id=\"s4\" class=\"heading-1\">Methods</h1><h2 id=\"s4a\" class=\"heading-2\">Viral vector injections and surgery</h2><p>All animal procedures were approved by and carried out in accordance with guidelines of the Veterinary Department of the Canton Basel-Stadt, Switzerland. For all surgical procedures, mice were anesthetized with an intraperitoneal injection of a mixture of fentanyl (0.05 mg/kg), medetomidine (0.5 mg/kg), and midazolam (5 mg/kg) and provided with both peri- and postoperative general and local analgesics: Metacam (5mg/kg, s.c.) and buprenorphine (0.1 mg/kg, s.c.). A lidocaine and ropivacaine mixture was injected subcutaneously into the scalp prior to incision. Metacam analgesia was provided for a further 48 hours post-surgery. Mice were allowed to recover for 1-3 weeks prior to first head-fixation.</p><h2 id=\"s4b\" class=\"heading-2\">Surgeries for two-photon imaging of LC axons</h2><p>13 male and female NET-Cre (<a href=\"#c55\">Wagatsuma et al., 2018</a>) mice (4-6 weeks old) were unilaterally injected at stereotactic coordinates (relative to bregma and brain surface): 5.45 mm posterior, 1.10 mm lateral, 3.65 mm deep. 250 to 500 nl of AAV2/5-hSyn-DIO-axon-GCaMP6s (2.7 × 10<sup>13</sup> genome copies/ml) was injected into each site. A 4 mm diameter circular imaging window was then implanted. A circular craniotomy was made overlying visual cortex (8 mice) or motor cortex (4 mice) and a durectomy was performed. A glass window was then placed onto the craniotomy and fixed in place with cyanoacrylate. A custom titanium headplate was attached to the skull using dental cement (Paladur, Kulzer).</p><h2 id=\"s4c\" class=\"heading-2\">Surgeries for two-photon imaging in layer 2/3 V1 during optogenetic stimulation of LC axons</h2><p>Male and female NET-Cre mice (4-6 weeks old) were unilaterally injected with 250 to 500 nl of AAV2/1-hSyn-DIO-ChrimsonR-tdTomato (1.2 × 10<sup>13</sup> to 3.4 × 10<sup>13</sup> genome copies/ml) into the right LC at stereotactic coordinates (relative to bregma and brain surface): 5.45 mm posterior, 1.10 mm lateral, 3.65 mm deep. A maximum of 250 nl of AAV2/1-hSyn-soma-jGCaMP8m (titer range from 10<sup>13</sup> to 10<sup>15</sup> genome copies/ml) was then injected across 3-5 locations spanning right V1, and a window and headplate were implanted as above, but with the additional measure of black pigmenting of the dental cement for the reduction of optogenetic stimulation light reaching the eyes of the mouse. For control mice, the injection into the LC was omitted. For the dataset in <strong><a href=\"#fig3\">Figure 3</a></strong>, eight mice were injected in the LC, but two were excluded due to lack of expression (see section Axon density). Six mice were not injected in the LC to serve as controls. For the dataset in <strong><a href=\"#fig4\">Figure 4</a></strong>, 12 mice were injected in the LC, with 6 mice classified as high ChrimsonR expression and 6 classified as low ChrimsonR expression (see section Axon Density). 7 mice were not injected in the LC to serve as controls.</p><h2 id=\"s4d\" class=\"heading-2\">Immunohistochemistry</h2><p>For all experiments with vector injections in LC to express either GCaMP or ChrimsonR-tdTomato, we histologically verified that expression was confined to the neurons within the anatomical location and spatial pattern expected of the LC. In a subset of mice used for imaging LC axons, we also confirmed that the transgene expressing neurons were catecholaminergic by immunostaining for tyrosine hydroxylase and GFP (<strong><a href=\"#figS1\">Figure S1A</a></strong>). After transcardial perfusion, brains were extracted and placed in 4% paraformaldehyde overnight. Brains were then embedded in 4% agar and sliced at 40 μm on a vibratome. Free floating slices were then washed in PBS-triton, blocked for 2 hours with 10% goat serum, and incubated overnight with primary antibodies (1:1000 dilution rabbit anti-tyrosine hydroxylase (Abcam ab13970), and 1:500 dilution chicken anti-GFP (Abcam ab13970). The following day, slices were washed again in PBS-triton and incubated for 2 hours with the secondary antibodies at 1:1000 dilution (Alexa Fluor 488 anti-chicken (Jackson ImmunoResearch 703-545-155) and Alexa Fluor 568 anti-rabbit (ThermoFisher Scientific, A10042)). Slices were mounted in Fluoroshield with DAPI (F6057, Sigma Aldrich).</p><h2 id=\"s4e\" class=\"heading-2\">Virtual reality and visual stimuli</h2><p>A virtual tunnel, with walls patterned with vertical sinusoidal gratings was projected onto a toroidal screen spanning 240 degrees horizontally and 100 degrees vertically of the visual field. The projector output was gated by a 24 kHz TTL such that it only turned on at the turnaround points of the two-photon resonance scanner, minimizing light artifacts during imaging. Mice were head-fixed on an air-floated polystyrene ball of 20 cm diameter. Movement of the virtual tunnel walls could occur only in one dimension (forward and backwards), with the ball restricted to rotation around the pitch axis using a pin. In closed loop conditions, visual flow speed in the tunnel was coupled to the rotation of the ball, with the exception of brief 1 s mismatch stimuli. These were triggered every 12 ± 2 s (mean ± SD) regardless of locomotion behavior and would clamp the visual flow speed to zero. In open loop conditions, the visual flow speed was controlled irrespective of mouse locomotion. Three different types of open loop session were used: 1) for LC axon imaging (<strong><a href=\"#fig1\">Figures 1</a> and <a href=\"#fig2\">2</a></strong>), as well as optogenetic stimulation of LC axons during open loop replays (<strong><a href=\"#fig4\">Figure 4</a></strong>), the visual flow from a previous closed loop session would be replayed. For LC axon imaging, the visual flow onset responses and playback halt responses were analyzed during this session. 2) For stimulation of LC axons to assess the effect on cortical responses (<strong><a href=\"#fig3\">Figure 3</a></strong>), 1 s fixed speed nasotemporal visual flow stimuli would be presented every 9 ± 3 s (mean ± SD). We presented 3 different speeds of visual flow in a pseudorandom order. 3) For assessing the effects of LC axon stimulation on visuomotor plasticity (<strong><a href=\"#fig4\">Figure 4</a></strong>), we presented 1 s duration fixed speed visual flow stimuli every 7 ± 1 s (mean ± SD), but this time only one speed was presented (equivalent to the speed seen during 24 cm/s locomotion in closed loop conditions), however, the direction was either nasotemporal or temporonasal, in a pseudorandom order. All mice imaged were habituated to head-fixation and the virtual reality tunnel for at least four daily one-hour sessions prior to imaging, until they showed regular, comfortable locomotion.</p><h2 id=\"s4f\" class=\"heading-2\">Two-photon imaging</h2><p>Imaging was performed on a modified Thorlabs Bergamo II two-photon microscope system. Excitation illumination was provided by a Ti-Sapphire laser with a wavelength at 930 nm and a laser power between 20 and 30 mW under the objective. When imaging neurons in V1, a piezo scanner was used to move the objective to image 4 separate layers sequentially (15 Hz effective frame rate), but for LC axons, imaging was fixed in a single layer (60 Hz frame rate). Field of view size was 750 × 400 pixels (approximately 300 × 300 μm). Custom software was used to acquire the imaging data. For mice undergoing imaging of layer 2/3 V1 neurons (<strong><a href=\"#fig3\">Figures 3</a> and <a href=\"#fig4\">4</a></strong>), two-photon imaging sites were confirmed as being in V1 by mapping V1 boundaries using intrinsic signal optical imaging.</p><h2 id=\"s4g\" class=\"heading-2\">Optogenetic stimulation of LC axons</h2><p>The beam from a 637 nm OBIS laser (Coherent) was focused onto the imaging site via the two-photon microscope objective. The laser was gated to turn on only during the turnaround times of the two-photon resonance scanner, to minimize stimulation induced light artifacts. During stimulation, the laser was presented in 15 ms pulses at 20 Hz (30% duty cycle) for a total duration of 1 s. For stimulation during visual stimulus presentations (<strong><a href=\"#fig3\">Figure 3</a></strong>), the power was 27 mW/mm<sup>2</sup>. Since this evoked a small visual response in the V1 calcium activity of both ChrimsonR-expressing and control mice (<strong><a href=\"#fig3\">Figure 3C</a></strong>), the power was reduced for subsequent experiments to 20 mW/mm<sup>2</sup> (<strong><a href=\"#fig4\">Figure 4</a></strong>), at which point the positive visual response disappeared (<strong><a href=\"#figS4\">Figure S4C</a></strong>). For the optogenetic stimulation during visual stimulus presentations (<strong><a href=\"#fig3\">Figure 3</a></strong>), optogenetic stimulation occurred simultaneous with a random 50% of mismatch stimuli and visual flow stimuli, or in isolation, every 12 s on average, during closed loop conditions. For optogenetic stimulation in the plasticity experiments (<strong><a href=\"#fig4\">Figure 4</a></strong>), stimulation occurred every 7 s on average. In 17/61 included imaging sites, this was gated by mouse locomotion such that stimulation only occurred when locomotion speed exceeded 4 cm/s. Since the results looked very similar for both locomotion gated and ungated stimulations, the data were pooled for analysis.</p><h2 id=\"s4h\" class=\"heading-2\">ΔF/F calculation</h2><p>Raw images were full-frame registered to correct for lateral brain motion. For V1 layer 2/3 neurons, neuronal somata were manually selected based on mean and maximum fluorescence images. Average fluorescence per region of interest (ROI) was corrected for slow fluorescence drift over time using an 8<sup>th</sup> percentile filter and a 1000 frame window, and divided by the median value over the entire trace to calculate ΔF/F (<a href=\"#c11\">Dombeck et al., 2007</a>). For LC axonal data (<strong><a href=\"#fig1\">Figures 1</a> and <a href=\"#fig2\">2</a></strong>), there were a number of alternative/additional steps. First, all ROIs within an image above a manually set fluorescence threshold were selected. Non-axonal ROIs from this set were then removed in two ways: first, a ‘circularity index’ (circularity index = 4π × area/perimeter<sup>2</sup>) and area threshold were used. ROIs with circularity index above 0.14 or a total area below 150 pixels were excluded – this served to remove non-axonal structures. Second, any ROI without evidence of calcium activity was removed: a fast Fourier transform was used to obtain the power spectrum of the ΔF/F trace. From this, the signal-to-noise ratio of the calcium signal was calculated, where noise was calculated as the average power between 3 and 8 Hz. ROIs with power below a signal-to-noise ratio of 10 in the frequency band from 0.05 to 1 Hz (classified as signal) were excluded. This served to remove uncommon elongated non-axonal ROIs, such as blood vessel walls. Next, due to the lower signal to noise of the axonal recordings, the ΔF/F recorded at 60 Hz was low pass filtered at 10 Hz. Finally, due to the high correlation of ΔF/F between LC axonal ROIs within a field of view (<strong><a href=\"#figS1\">Figure S1D-F</a></strong>), ΔF/F was averaged across all axonal ROIs within a field of view.</p><h2 id=\"s4i\" class=\"heading-2\">Calculation of visuomotor error (<a href=\"#fig1\">Figure 1</a>)</h2><p>Visuomotor error is calculated as the difference between locomotion speed and visual flow speed, assuming a constant gain between the two that the mouse predominantly experiences in the virtual reality. The change in absolute error (Δ|Error|) is calculated for each trial as the change in absolute (i.e., unsigned) visuomotor error during the stimulus window, minus the absolute visuomotor error in the 1 s preceding the stimulus. For each type of stimulus and each FoV, Δ|Error| was then averaged across trials. Note that for visuomotor mismatch, Δ|Error| is equivalent to the locomotion speed during mismatch (since visual flow speed during mismatch is zero, and the preceding 1 s is closed loop, where the error is zero). In all stimulus conditions (<strong><a href=\"#fig1\">Figure 1H</a></strong>), the Δ|Error| is calculated in a window 0.66 s (40 frames) preceding the window used to calculate ΔF/F responses.</p><h2 id=\"s4j\" class=\"heading-2\">Locomotion onsets and visual flow onsets</h2><p>Locomotion onsets were defined as the locomotion speed crossing a threshold of 0.4 cm/s, where the average speed in the previous two seconds was &lt; 0.4 cm/s, and where the average speed in the subsequent 1 s exceeded 2 cm/s. The same criteria were used to determine visual flow onsets during open loop replays, using the visual flow speed.</p><h2 id=\"s4k\" class=\"heading-2\">LC axonal responses</h2><p>For each visual stimulus trigger, the average ΔF/F in the 1 s window prior to stimulus onset was subtracted from the response, before averaging across trials to get the average response of each axon segment. Mismatch and playback halt responses were calculated for each FoV in the 1 s window beginning 0.66 s (40 frames) after stimulus onset. For visual flow onsets during open loop replays, the window was delayed by 400 ms (25 frames) to take into account the slower onset of the stimulus compared to mismatches. Trials were classified as occurring during locomotion if the locomotion speed in the 1 s after the onset of visual flow or mismatch exceeded 1 cm/s, while they were classified as occurring during stationary periods if the locomotion speed was below 1 cm/s. For <a href=\"#fig1\">Figure 1H</a>, fast locomotion during mismatch was classified as locomotion speed exceeding 10 cm/s, while slow locomotion was classified as locomotion speed between 1 cm/s and 10 cm/s. For locomotion onset responses (<a href=\"#figS2\">Figure S2</a>), the average ΔF/F in the 500 ms window 2 s prior to locomotion onset was subtracted from the response, before averaging across trials. Locomotion onsets were considered to take place during the absence of visual flow if average visual flow speed in the 2 s window centered on locomotion onset was below that corresponding to a 1 cm/s locomotion speed in closed loop conditions. If visual flow speed exceeded this value, the trial was considered to take place during visual flow. Responses for all stimuli were averaged for each FoV across trials only if there were at least three valid trials. For all stimulus conditions that were selected based on locomotion speed (e.g., mismatches), 120 sham triggers were generated and sham responses calculated from triggers that were sub-selected based on the same locomotion selection criteria. The average sham response was subtracted from the stimulus response.</p><h2 id=\"s4l\" class=\"heading-2\">V1 layer 2/3 neuron stimulus responses</h2><p>For each stimulus trigger, the average ΔF/F in the 1 s window prior to stimulus onset was subtracted from the response, before averaging across trials to get the average response of the neuron. Visual flow and mismatch responses were calculated for each neuron in the window 0.33 s to 2.33 s (5 to 30 frames) after stimulus onset. Trials were classified as occurring during locomotion if the locomotion speed in the 1 s during visual flow or mismatch exceeded 4 cm/s, while they were classified as during stationary periods if the locomotion speed was below 1 cm/s. For mismatches, only locomotion trials were included. Note that for <strong><a href=\"#fig3\">Figure 3</a></strong>, visual responses were not segregated into locomotion and stationary trials: all trials were included. For analysis of locomotion modulation index in different locomotion speed conditions (<strong><a href=\"#fig5\">Figure 5D-G</a></strong>), slow, medium, and fast locomotion speed trials were categorized where average locomotion speed during visual flow was between 1 and 5 cm/s, 5 and 10 cm/s, and above 10 cm/s respectively. For the previously published datasets (<strong><a href=\"#fig5\">Figure 5</a></strong>, CT, NR, and NT) <span>(<a href=\"#c2\">Attinger et al., 2017</a><a href=\"#c54\">Vasilevskaya et al., 2022</a><a href=\"#c56\">Widmer et al., 2022</a>)</span>, differences in the measurement of locomotion speed across the datasets made it difficult to use a common threshold value. Thus, to make the locomotion modulation indices comparable to those calculated from the newly acquired dataset (<strong><a href=\"#fig5\">Figure 5D-G</a></strong>), we used the 95<sup>th</sup> percentile of the locomotion speed to normalize thresholds across datasets. In addition, since the visual responses used to measure locomotion modulation index were visual flow onsets in open loop conditions rather than rapid onset fixed speed stimuli, the analysis window relative to stimulus onset was shifted by 400 ms to account for the slower onset. Responses were averaged for each neuron across trials only if there were at least three valid trials. For all stimulus conditions that were selected based on locomotion speed (e.g., mismatches), the average response to 1000 sham triggers sub-selected based on the same locomotion conditions was calculated. This sham response was subtracted from the stimulus response.</p><h2 id=\"s4m\" class=\"heading-2\">Locomotion modulation index</h2><p>To quantify the change in mean visual flow response during locomotion for each neuron normalized by the overall size of response, we calculated a locomotion modulation index (LMI) for each neuron as follows:\r\n</p><figure class=\"figure\"><label class=\"figure__label\"></label><img src=\"/iiif/2/10.1101%2F2022.11.08.515698%2F515698v2_ueqn1.gif/full/max/0/default.jpg\" alt=\"sciency picture\"/><figcaption class=\"figure__caption\"></figcaption></figure><p>Where R<sub>VFloco</sub> is the average visual flow response during locomotion, and R<sub>VFstat</sub> is the average visual flow response during stationary periods.</p><h2 id=\"s4n\" class=\"heading-2\">Exclusion criteria in analysis of visual plasticity (<a href=\"#fig4\">Figure 4</a>)</h2><p>Imaging sessions during which the mouse spent less than 15% of the time locomoting at a speed exceeding 4 cm/s were excluded (13 of 71 sessions), as this would limit both the amount of visuomotor coupling experienced during the plasticity assay, and our ability to analyze visual responses during locomotion.</p><h2 id=\"s4o\" class=\"heading-2\">Layer 2/3 functional cell type classification (<a href=\"#figS3\">Figure S3</a>)</h2><p>Neurons were grouped into visually suppressed and mismatch activated NPE neurons, visually activated PPE neurons, and an intermediate group (‘other’). Since we were analyzing the visual and mismatch responses of these groups, we used locomotion onset responses to group neurons to avoid a circular analysis. To compute each neuron’s locomotion onset response, for each onset the average ΔF/F in the 1 s window beginning 2 s prior to locomotion onset was subtracted from the response, before averaging across trials. Average responses to locomotion onsets (quantified in the window 0.66 to 4 s (10 to 60 frames) after onset) in open loop conditions were subtracted from locomotion onset responses in closed loop conditions (where visual flow is concurrent with locomotion) for each neuron. Note that for analyzing the dataset in <strong><a href=\"#fig4\">Figure 4</a></strong>, only the open loop locomotion onsets before LC axon stimulation were used. It was previously shown that the difference between locomotion onset responses in open and closed loop conditions correlates with these cell groups (<a href=\"#c21\">Jordan and Keller, 2020</a>). For each dataset, the 33<sup>rd</sup> and 66<sup>th</sup> percentile of these values were used as thresholds. Neurons with response differences exceeding the 66<sup>th</sup> percentile were classified as PPE neurons, and those with response differences below the 33<sup>rd</sup> percentile were classified as NPE neurons, with the remaining neurons were classified as ‘other’. Responses to mismatch and visual flow stimuli were consistent with these groupings in all three datasets (<strong><a href=\"#figS3\">Figure S3</a></strong>).</p><h2 id=\"s4p\" class=\"heading-2\">Axon density</h2><p>PFA fixed brains of mice injected with a vector to express ChrimsonR-tdTomato in NET-positive neurons of the LC were sliced at 40 μm and after mounting, examined under a confocal microscope at 20x magnification. For all mice, images were taken from four sites in V1, each one from a different cortical slice, with sites chosen based on somatic labelling in the green channel (indicating GCaMP expression and a likely two-photon imaging site). To quantify LC axon density, the red channel images were then analyzed. tdTomato labelled axonal segments were manually traced in ImageJ using the NeuronJ plugin (<a href=\"#c32\">Meijering et al., 2004</a>). The total combined length of the axon segments was then divided by the total area of the cortex in the image to calculate axon density in each image. The average density across four images was taken as the axon density for each mouse. This value was used to distinguish high expression and low expression mice based on a threshold of 0.002 μm per μm<sup>2</sup> (total axon length per unit area of the cortex) (<strong><a href=\"#fig4\">Figures 4B</a> and <a href=\"#figS4\">S4A</a></strong>). Since only two mice were categorized to have low expression in the dataset used in <strong><a href=\"#fig3\">Figure 3</a></strong>, low expression mice were not included as a separate group in these analyses, and instead excluded.</p><h2 id=\"s4q\" class=\"heading-2\">Pupillometry</h2><p>Images of the right eye, ipsilateral to the side of LC stimulation, were recorded with a CMOS infrared camera at 30 Hz. Pupil diameter was measured offline by fitting a circle to the pupil, which was backlit by the 930 nm laser light of the two-photon microscope. Pupil diameter traces were z-scored by subtracting the mean of the entire trace and dividing by the standard deviation of the entire trace. To calculate optogenetically induced pupil dilations, the average baseline pupil diameter (in the 1 s prior to stimulus onset) was subtracted from the response for each trial, then the pupil diameter response was averaged across trials. Trials including blinks were excluded.</p><h2 id=\"s4r\" class=\"heading-2\">Statistical tests</h2><p>All statistical information for the tests performed in this manuscript are provided in <strong><a href=\"#tblS1\">Table S1</a></strong>. For data where the experimental unit was neurons, we used hierarchical bootstrapping (<a href=\"#c45\">Saravanan et al., 2020</a>) for statistical testing due to the nested structure (neurons and mice) of the data. To do this, we first resampled the data (with replacement) at the level of imaging sites. From the selected set of imaging sites, we then resampled the data (with replacement) at the level of neurons. We then computed the mean of this bootstrap sample. This would be repeated 10 000 times to generate a distribution of mean values. For paired tests, the p-value was calculated as the proportion of this distribution that was higher or lower than zero, depending on the null hypothesis. For unpaired tests, the p-value was calculated as the proportion of the distribution higher or lower than the values from the distribution of the compared dataset, depending on the hypothesis. For data where the experimental unit was FoV (<strong><a href=\"#fig1\">Figures 1</a> and <a href=\"#fig2\">2</a></strong>) or mice (pupil dilation, <strong><a href=\"#figS4\">Figure S4B</a></strong>), t-tests were used to compare datasets that conformed with normality and did not show statistically distinguishable variances. Datasets that did not conform with normality or had unequal variances were compared with Rank-sum tests. Paired t-tests were used to test the mean of a population against zero when the data was normally distributed, otherwise signed-rank tests were used to test the median against zero (<strong><a href=\"#fig1\">Figure 1</a></strong>).</p><h1 id=\"\" class=\"heading-1\">Supplementary figures</h1><figure class=\"figure\" id=\"figS1\"><label class=\"figure__label\">Figure S1.</label><img src=\"/iiif/2/10.1101%2F2022.11.08.515698%2F515698v2_figS1.tif/full/max/0/default.jpg\" alt=\"sciency picture\"/><figcaption class=\"figure__caption\"><h2 class=\"heading-2\">Additional information and analyses on two-photon imaging of LC axons. Related to <a href=\"#fig1\">Figure 1</a>.</h2><p>(<strong>A</strong>) Confocal micrographs showing immunolabelling for tyrosine hydroxylase (magenta) and GCaMP6s (green) in the two LC. GCaMP6s was expressed via stereotactic viral vector injection into only the right LC of NET-Cre mice.</p><p>(<strong>B</strong>) Cross-correlations between LC axonal ΔF/F and pupil diameter (black) or the time derivative of pupil diameter (gray) averaged across 40 FoVs. Shading indicates SEM. Positive axonal lag values indicate time delays where axonal fluorescence lags relative to pupil diameter or its derivative.</p><p>(<strong>C</strong>) Responses to air puff stimuli applied to the flank which were infrequently used to evoke locomotion (here during the closed loop condition). Top: Average locomotion speed (purple) and visual flow speed (green) for trials that evoked locomotion. Middle: Heat maps of the average air puff responses of different FoVs sorted according to response magnitude, for trials that evoked locomotion (top heat map) and rare trials that did not evoke locomotion (bottom heat map). Bottom: Response averaged across FoVs for air puff trials that evoked locomotion (black) and those that did not (gray). Shading indicates SEM.</p><p>(<strong>D</strong>) Example two-photon field of view of LC axons, with 18 regions of interest (ROI) superimposed in different colors.</p><p>(<strong>E</strong>) Heat map of ΔF/F of the 18 ROIs in panel <strong>D</strong> from a segment of closed loop experience. (<strong>F</strong>) Correlation matrix of the activity of the 18 different ROIs in panels <strong>D</strong> and <strong>E</strong>.</p></figcaption></figure><figure class=\"figure\" id=\"figS2\"><label class=\"figure__label\">Figure S2.</label><img src=\"/iiif/2/10.1101%2F2022.11.08.515698%2F515698v2_figS2.tif/full/max/0/default.jpg\" alt=\"sciency picture\"/><figcaption class=\"figure__caption\"><h2 class=\"heading-2\">Locomotion onset responses of LC axons. Related to <a href=\"#fig2\">Figure 2</a>.</h2><p>(<strong>A</strong>) Responses to the onset of locomotion occurring during the closed loop condition (left), during visual flow in the open loop condition (middle), and during no visual flow in the open loop condition (right). Top: Average visual flow speed (green) and locomotion speed (purple) averaged across trials. Note that the window for defining the occurrence of visual flow is in the 2 s window centered on the locomotion onset – therefore the incidence of visual flow increases away from this onset. Red trace shows the absolute error between locomotion speed and visual flow speed averaged across trials (note that, since absolute error is averaged across trials independently, it is <em>not</em> equivalent to the absolute difference in averaged locomotion speed and visual flow speed traces plotted above. In addition, note that the minor error occurring in the closed loop condition is due to mismatches). Middle: Heat map of the average responses of different fields of view (FoV) sorted according to response magnitude. Bottom: Response averaged over FoVs. Shading indicates SEM.</p><p>(<strong>B</strong>) Comparison of average sustained response of LC axons to locomotion onsets in the open loop condition (quantified in the window 1 to 10 s after locomotion onset), during either visual flow or no visual flow, across FoVs. Each point indicates the average response of an individual FoV. Error bars indicate SEM. *: p &lt; 0.05. For statistical information see <strong><a href=\"#tblS1\">Table S1</a></strong>.</p></figcaption></figure><figure class=\"figure\" id=\"figS3\"><label class=\"figure__label\">Figure S3.</label><img src=\"/iiif/2/10.1101%2F2022.11.08.515698%2F515698v2_figS3.tif/full/max/0/default.jpg\" alt=\"sciency picture\"/><figcaption class=\"figure__caption\"><h2 class=\"heading-2\">Classification of functional neuronal types in V1 layer 2/3. Related to <a href=\"#fig3\">Figures 3</a>, <a href=\"#fig4\">4</a>, and <a href=\"#fig5\">5</a>.</h2><p>(<strong>A</strong>) Percentage of neurons as a function of the difference in response to locomotion onsets in closed loop conditions and open loop conditions. Neurons with a responses difference below the 33<sup>rd</sup> percentile (open loop response &gt; closed loop response), were classified as visually suppressed NPE neurons (red), while those with a response difference exceeding the 66<sup>th</sup> percentile (closed loop response &gt; open loop response), were classified as visually driven PPE neurons (turquoise), as shown. Data for this panel comes from <strong><a href=\"#fig3\">Figure 3</a></strong> dataset.</p><p>(<strong>B</strong>) Top: Diagram of visual flow and locomotion speed traces to indicate closed loop and open loop locomotion onsets (black dashed lines). Bottom: Responses to locomotion onset during closed loop and open loop, averaged across neurons classified as NPE, PPE, and the intermediate group (Other). Shading indicates SEM. Data for this panel comes from <strong><a href=\"#fig3\">Figure 3</a></strong> dataset.</p><p>(<strong>C</strong>) Bar graph to show visual flow and visuomotor mismatch responses, averaged across neurons, compared for the three functional neuron types: NPE, Other, and PPE neurons. Error bars indicate SEM. Data for this panel comes from <strong><a href=\"#fig3\">Figure 3</a></strong> dataset.</p><p>(<strong>D</strong>) Bar graph to show nasotemporal and temporonasal visual flow responses (split further into occurring during locomotion or stationary periods), averaged across neurons, compared for the three functional neuron types: NPE, Other, and PPE neurons. Error bars indicate SEM. Data for this panel comes from <strong><a href=\"#fig4\">Figure 4</a></strong> dataset (High ChrimsonR only). Mismatch data was not acquired for this dataset.</p><p>(<strong>E</strong>) Bar graph to show visual flow onset and visuomotor mismatch responses, averaged across neurons, compared between NPE, Other, and PPE cell classes. Error bars indicate SEM. Data for this panel comes from <strong><a href=\"#fig5\">Figure 5</a></strong> datasets (coupled trained and normally reared mice).</p></figcaption></figure><figure class=\"figure\" id=\"figS4\"><label class=\"figure__label\">Figure S4.</label><img src=\"/iiif/2/10.1101%2F2022.11.08.515698%2F515698v2_figS4.tif/full/max/0/default.jpg\" alt=\"sciency picture\"/><figcaption class=\"figure__caption\"><h2 class=\"heading-2\">Additional information and analyses on optogenetic stimulation of LC axons to drive plasticity. Related to <a href=\"#fig4\">Figure 4</a>.</h2><p>(<strong>A</strong>) Two example confocal microscopy images from V1 showing jGCaMP8m expression (green) and tdTomato expression (magenta), indicating labelled LC axons. The right image is from an animal classified as high ChrimsonR-expressing, based on labelled axon density, and left image is from an animal classified as low ChrimsonR-expressing.</p><p>(<strong>B</strong>) Comparison of average pupil diameter response (quantified in the window 1.3 to 4.7 s after optogenetic stimulation onset) for control, low ChrimsonR-expressing and high ChrimsonR-expressing mice. Here and in other panels, n.s.: p &gt; 0.05, *: p &lt; 0.05, **: p &lt; 0.01, ***: p &lt; 0.001. For complete statistical information see <strong><a href=\"#tblS1\">Table S1</a></strong>.</p><p>(<strong>C</strong>) Average population ΔF/F response of layer 2/3 neurons in V1 to the onset of the optogenetic stimulation laser. Shading indicates SEM. Note that optogenetic laser power was lowered compared to the value used in <strong><a href=\"#fig3\">Figure 3</a></strong>, and the positive response seen in <strong><a href=\"#fig3\">Figure 3D</a></strong> is no longer evident.</p><p>(<strong>D</strong>) Analysis of plasticity in nasotemporal visual flow responses in control mice which underwent optogenetic laser stimulation during the closed loop condition. Left: Distribution of locomotion modulation index for the visual responses recorded before (dark gray) and after the stimulation period (red). Right: Change in ΔF/F response to visual flow after optogenetic stimulation for responses recorded during locomotion (purple) and during stationary periods (black).</p><p>(<strong>E</strong>) As for panel <strong>D</strong>, but for temporonasal visual flow responses recorded in high ChrimsonR-expressing mice, where optogenetic stimulation occurred during open loop replays of visual flow (i.e., uncoupled from locomotion).</p><p>(<strong>F</strong>) Analysis of plasticity in nasotemporal visual flow responses for high ChrimsonR-expressing mice which underwent optogenetic laser stimulation during open loop replays of visual flow (i.e., uncoupled from locomotion). Boxplot shows the change in ΔF/F response to visual flow after optogenetic stimulation for responses recorded during locomotion (purple) and during stationary periods (black). Traces show average population response to visual flow during locomotion (purple) and during stationary periods (black), before (top) and after (below) optogenetic stimulation. Shading indicates SEM.</p></figcaption></figure><figure class=\"figure\" id=\"figS5\"><label class=\"figure__label\">Figure S5.</label><img src=\"/iiif/2/10.1101%2F2022.11.08.515698%2F515698v2_figS5.tif/full/max/0/default.jpg\" alt=\"sciency picture\"/><figcaption class=\"figure__caption\"><h2 class=\"heading-2\">Differences in locomotion during stimulation cannot explain differences in the change of locomotion modulation index between groups. Related to <a href=\"#fig4\">Figure 4</a>.</h2><p>(<strong>A</strong>) Average locomotion speed (excluding stationary periods) for: High ChrimsonR-expressing mice during closed loop stimulation, Control mice during closed loop stimulation, low ChrimsonR-expressing mice during closed loop stimulation, and high ChrimsonR-expressing mice during open loop stimulation. Points show data for each imaging session.</p><p>(<strong>B</strong>) As for panel <strong>A</strong>, but for the time spent engaged in locomotion during the stimulation period.</p><p>(<strong>C</strong>) Change in locomotion modulation index after optogenetic stimulation plotted against the time spent engaged in locomotion during the laser stimulation period of the imaging session. Each point shows the averages for a single imaging session.</p></figcaption></figure><figure class=\"figure\" id=\"figS6\"><label class=\"figure__label\">Figure S6.</label><img src=\"/iiif/2/10.1101%2F2022.11.08.515698%2F515698v2_figS6.tif/full/max/0/default.jpg\" alt=\"sciency picture\"/><figcaption class=\"figure__caption\"><h2 class=\"heading-2\">Comparison of locomotion modulation index across different functional neuronal types in layer 2/3 V1. Related to <a href=\"#fig5\">Figure 5</a>.</h2><p>(<strong>A</strong>) Average population responses of layer 2/3 neurons in V1 in coupled trained mice to the onset of visual flow during stationary periods (black), and during locomotion (purple) for visually driven positive prediction error neurons (PPE, top) and visually suppressed negative prediction error neurons (NPE, bottom). Shading indicates SEM.</p><p>(<strong>B</strong>) Comparison of locomotion modulation index for visual flow onset responses of positive (turquoise), negative (orange) prediction error neurons, and an intermediate population of neurons (gray), recorded in normally reared (left) and coupled trained (right) mice. For information on functional neuron types, see <strong><a href=\"#figS3\">Figure S3</a></strong>. Here and in other panels, n.s.: p &gt; 0.05, *: p &lt; 0.05, **: p &lt; 0.01, ***: p &lt; 0.001. For complete statistical information see <strong><a href=\"#tblS1\">Table S1</a></strong>.</p><p>(<strong>C</strong>) As for panel <strong>A</strong>, but for nasotemporal visual flow responses in high ChrimsonR-expressing mice after LC axon stimulation in closed loop conditions.</p><p>(<strong>D</strong>) As for panel <strong>B</strong>, but for nasotemporal visual flow responses in high ChrimsonR-expressing mice before (left) and after (right) LC axon stimulation in closed loop conditions.</p></figcaption></figure><h1 id=\"\" class=\"heading-1\">Tables</h1><figure class=\"figure\" id=\"tblS1\"><label class=\"figure__label\">Table S1.</label><img src=\"/iiif/2/10.1101%2F2022.11.08.515698%2F515698v2_tblS1a.tif/full/max/0/default.jpg\" alt=\"sciency picture\"/><figcaption class=\"figure__caption\"><p>All statistical information.</p></figcaption></figure>",
    "stage": "published",
    "published": "2023-01-25T03:00:00Z",
    "reviewedDate": "2023-01-25T03:00:00Z",
    "versionDate": "2023-01-25T03:00:00Z",
    "statusDate": "2023-01-25T03:00:00Z",
    "subjects": [
        {
            "id": "neuroscience",
            "name": "Neuroscience"
        }
    ]
}
