{
    "number": 1,
    "title": "What is Manuscripts?",
    "published": "2016-01-11T16:53:00+00:00",
    "image": {
        "alt": "",
        "sizes": {
            "2:1": {
                "900": "%base_url%/images/experiments/1/png?width=900&height=450",
                "1800": "%base_url%/images/experiments/1/png?width=1800&height=900"
            },
            "16:9": {
                "250": "%base_url%/images/experiments/1/png?width=250&height=141",
                "500": "%base_url%/images/experiments/1/png?width=500&height=281"
            },
            "1:1": {
                "70": "%base_url%/images/experiments/1/png?width=70&height=70",
                "140": "%base_url%/images/experiments/1/png?width=140&height=140"
            }
        }
    },
    "content": [
        {
            "type": "paragraph",
            "text": "It is a tool I created based on my own writing experiences during during my PhD research at the Sanger Institute in Cambridge."
        },
        {
            "type": "paragraph",
            "text": "In essence, Manuscripts is a word processor re-imagined to take a lot of mechanical formatting work off the author's shoulders, so he or she can focus on the actual paper. We top the editing features with a fully version-controlled file format and flexible import and export options."
        },
        {
            "type": "paragraph",
            "text": "The central solution we provide is helping an author focus on the substance of their story, as opposed to mechanical tasks that distract both the author and the publisher who ultimately receives the paper. Manuscripts helps authors to plan, navigate and edit a complex paper in a way that avoids them getting lost in the document and having to jump out of a natural writing flow to external tools that talk a different \"language”."
        },
        {
            "type": "paragraph",
            "text": "Our design packs in an unprecedented range of functionality, including multi-figure panels, table editing and equations, as well as a top-of-the-line citation workflow, all in one unified experience."
        },
        {
            "type": "paragraph",
            "text": "We also include over 1,000 journal-specific manuscript templates to act as a starting point for writing and are seeking new publishing partners to build more. Manuscript templates inform many factors besides the obvious, such as maximum word counts and acceptable figure formats which, among other details, are enforced by the app."
        },
        {
            "type": "paragraph",
            "text": "The styling used in the document can be exported to Word, LaTeX and Markdown formats. In a way, Manuscripts helps both the author and publisher by guaranteeing a certain minimum technical quality to the documents, without users needing to understand paragraph styling or, for instance, how to produce clean typesetting markup in LaTeX form."
        },
        {
            "type": "image",
            "alt": "",
            "uri": "https:\/\/cdn.elifesciences.org\/images\/news\/manuscripts-figure1.png",
            "caption": "Manuscripts at a glance"
        },
        {
            "type": "section",
            "title": "Manuscripts is an opinionated writing tool",
            "content": [
                {
                    "type": "paragraph",
                    "text": "We are big believers in building approachable, easy-to-use tools because we think that researchers really value their time and are a conservative audience in picking up new workflows and tools. I think this is often under-appreciated in the publishing world."
                },
                {
                    "type": "image",
                    "alt": "",
                    "uri": "https:\/\/cdn.elifesciences.org\/images\/news\/manuscripts_fig2.png",
                    "caption": "Manuscripts includes over 1,000 manuscript templates that help authors get started with a complex writing project."
                },
                {
                    "type": "paragraph",
                    "text": "Compared to your typical word processor, Manuscripts shuns half a dozen ribbons and most character styling options available. This is because we think that good writing is all about consistency. A visually consistent, and dare I say beautiful, representation of your writing on the screen really helps you to maintain focus on the consistency of your writing during the entire process."
                },
                {
                    "type": "paragraph",
                    "text": "This is not to say Manuscripts is feature limited in terms of styling the document. It’s actually really powerful. However, a lot of this power is hidden away in the paragraph styling that is automatically applied to different parts of the document. For instance, headings are never pieces of bold text in Manuscripts, and you cannot space items out with tabs or extra linefeeds. We feel these kinds of formatting tricks are counterproductive for the author and also the publisher that receives the document, so we don’t provide them. Instead, we automatically prepare the visual representation of a document as much as possible. This is a task that computers are good at, just as long as the document is structured well, and it lets the author focus on formulating an argument – which is what they are good at."
                },
                {
                    "type": "paragraph",
                    "text": "To see how easy Manuscripts is to get started with, have a look at our intro video:"
                },
                {
                    "type": "youtube",
                    "id": "-9JVFCL0fvk",
                    "width": 960,
                    "height": 720
                }
            ]
        },
        {
            "type": "section",
            "title": "Referencing re-imagined",
            "content": [
                {
                    "type": "paragraph",
                    "text": "An academic writing workflow typically involves using a citation tool that “sends” formatted reference data to the writing tool, to follow a specific citation style. The problem with this kind of workflow is that the reference metadata easily becomes an afterthought at the writing tool end, and the manuscript becomes locked into a particular reference management tool. This makes collaboration hard, and it also leads into situations where one is no longer easily able to reformat references: the metadata is auxiliary and can get lost, leaving behind only a particular visual representation of itself in the document."
                },
                {
                    "type": "paragraph",
                    "text": "We really want to avoid both of these problems. Manuscripts is therefore capable of formatting reference data itself so that the user has the freedom to reformat it. It also allows authors to use a mixture of citation tools in a collaborative process. In that sense, Manuscripts contains some of the logic that usually resides in a reference manager. It isn’t however trying to be a full-blown reference manager – instead, it includes an entirely open interface to work with external citation tools."
                },
                {
                    "type": "paragraph",
                    "text": "At the 1.0 launch, Manuscripts works in a highly integrated way with the Papers reference manager, in part to prove how much the deep citation tool integration can help an author become more productive. However, we also built support for importing bibliography data from essentially all key bibliography file formats (BibTeX, EndNote XML and RIS, among many others), and there's a built-in citation tool included for inserting citations. This means that you can already use it together with pretty much any given reference manager of your choice. We are also already working with external parties to integrate other reference management tools closely with the app."
                }
            ]
        },
        {
            "type": "section",
            "title": "Offline first, but built for collaboration.",
            "content": [
                {
                    "type": "paragraph",
                    "text": "Manuscripts at 1.0 is a personal, fully offline writing tool for Mac computers. We have gone with this design because a product, like writing a paper, requires focus. We have focused on proving the concept and building something beautiful and usable, allowing us to iterate very quickly according to early adopter feedback (we have been shipping beta updates on an almost daily basis, for instance)."
                },
                {
                    "type": "paragraph",
                    "text": "The tremendous response we have received has really validated this choice: we have an extremely enthusiastic group of early adopters who spread the word about us, and this is what we are going to grow the business from. That being said, Mac is really just the beginning for us. We spent a good three years developing the product, and in part that is because we wanted to begin with building the technology into a form that can be ported to the web and other desktop platforms, and perhaps even the iPad."
                },
                {
                    "type": "paragraph",
                    "text": "We believe strongly that scholarly authors will continue to care about a fully offline writing experience, where they are in full ownership and control over their own manuscripts. The more substantial the writing project, the more likely that offline uses become key to real-world productivity. In this sense, the present breed of collaborative scientific writing tools all require an author to make a substantial compromise between personal productivity and the need to write collaboratively, and we think we will be able to offer something unique in that respect. Indeed, the next big thing you can expect from us is a solution to collaborative writing. To give you a hint, the Manuscripts documents are already fully version-controlled in part because of upcoming collaboration features."
                }
            ]
        }
    ],
    "impactStatement": "Manuscripts is a writing tool for scholarly documents: it helps with the entire process of writing up complex work, from outlining the paper to the editing, proofreading and publishing stages, all from within one beautiful experience."
}
